import React from 'react';

const Lesson0212 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>โลกและชีวิตความรู้สึกเป็นอันเดียวกัน + ชื่อ</h2>
          </div>
            <h4>
            ความคิด โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อความคิด โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เท้าเดิน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเท้าเดิน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            มือจับ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อมือจับ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เหลียวซ้าย โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเหลียวซ้าย โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เหลียวขวา โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเหลียวขวา โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ก้มหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อก้มหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เงยหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเงยหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ยืน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อยืน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เดิน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเดิน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            นั่ง โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อนั่ง โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            นอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อนอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ตื่นนอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อตื่นนอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ลืมตา โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อลืมตา โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ที่นอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อที่นอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ผ้าห่ม โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อผ้าห่ม โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ล้างหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อล้างหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            แปรงฟัน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อแปรงฟัน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            อาบน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่ออาบน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ใส่เสื้อ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อใส่เสื้อ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ใส่กางเกง โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อใส่กางเกง โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            หวีผม โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อหวีผม โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            แต่งหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อแต่งหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ไปทานข้าว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อไปทานข้าว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            จาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อจาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ช้อน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อช้อน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ข้าว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อข้าว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            กับข้าว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อกับข้าว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ดื่มน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อดื่มน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ดื่มกาแฟ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อดื่มกาแฟ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ไปทำงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อไปทำงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ขับรถ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อขับรถ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ที่ทำงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อที่ทำงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เพื่อนร่วมงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเพื่อนร่วมงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            นั่งเก้าอี้ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อนั่งเก้าอี้ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            จับปากกา โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อจับปากกา โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เขียนหนังสือ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเขียนหนังสือ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เข้าห้องน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเข้าห้องน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เลิกงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเลิกงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            กลับบ้าน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อกลับบ้าน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ซื้อของ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อซื้อของ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เข้าบ้าน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเข้าบ้าน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ให้อาหารสัตว์ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อให้อาหารสัตว์ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            รดน้ำต้นไม้ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อรดน้ำต้นไม้ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            กวาดบ้าน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อกวาดบ้าน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ถูพื้น โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อถูพื้น โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ซักผ้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อซักผ้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ไม้แขวนเสื้อ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อไม้แขวนเสื้อ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ตากผ้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อตากผ้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            กินข้าวเย็น โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อกินข้าวเย็น โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            อาบน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่ออาบน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เปิดพัดลม โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเปิดพัดลม โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เปิดแอร์ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเปิดแอร์ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ดูทีวี โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อดูทีวี โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ฟังเพลง โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อฟังเพลง โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            โทรศัพท์ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อโทรศัพท์ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ปิดไฟ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อปิดไฟ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เข้านอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อเข้านอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            การเคลื่อนไหว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ชื่อการเคลื่อนไหว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br /><br />
            นี่คือผลต่อเนื่องของโลกและชีวิต กำหนดรู้ว่าทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <a href="/third/lesson0301">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ว่าด้วยความเป็นอนิจจังแห่งอายตนะภายใน
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0212;