import React from 'react';

const Lesson0207 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>องค์ประกอบของโลกและชีวิต + กำหนดรู้ธาตุ 6</h2>
          </div>
            <h4>
            โลกและองค์ประกอบของโลก คือดิน น้ำ ลม ไฟ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            ผลต่อเนื่องของโลกคือวัตถุสิ่งของ แผ่นดิน แผ่นน้ำ ลมฟ้าอากาศ ต้นไม้ ใบหญ้า สัตว์ บุคคล<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ประกอบด้วยดิน น้ำ ลม ไฟ<br />
            เป็นเหตุเป็นปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            ชีวิตและองค์ประกอบของชีวิต คือดิน น้ำ ลม ไฟ กรรมและวิญญาณ<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            ผลต่อเนื่องของชีวิตคือรูปร่าง หน้าตา ลักษณะท่าทาง นิสัยใจคอ<br />
            ความคิดความเห็น คำพูดการกระทำ ดีใจเสียใจ ไปไหนมาไหน<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ประกอบด้วยดิน น้ำ ลม ไฟ<br />
            เป็นเหตุเป็นปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br /><hr /><br />
            ปฐวีธาตุ (ธาตุดิน) ก็ปฐวีธาตุเป็นไฉน คือปฐวีธาตุภายในก็มีภายนอกก็มี<br />
            ก็ปฐวีธาตุภายในเป็นไฉน<br />
            ได้แก่สิ่งที่แค่นแข็ง กำหนดได้มีในตนอาศัยตน<br />
            คือผม ขน เล็บ ฟัน หนัง เนื้อ เอ็น กระดูก<br />
            เยื่อในกระดูก ม้าม หัวใจ ตับ พังผืด ไต ปอด ไส้ใหญ่ ไส้น้อย อาหารเก่า อาหารใหม่<br />
            หรือแม้สิ่งอื่นไม่ว่าชนิดไรๆ ที่แข้นแข็ง กำหนดได้มีในตนอาศัยตน<br />
            นี้เรียกว่าปฐวีธาตุภายใน ก็ปฐวีธาตุทั้งภายในและภายนอกนี้แล เป็นปฐวีธาตุทั้งนั้น<br />
            พึงเห็นปฐวีธาตุนั้น ด้วยปัญญาอันชอบ ตามความเป็นจริงอย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้น ว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ครั้นเห็นแล้วจะเบื่อหน่ายปฐวีธาตุ และให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น ปฐวีธาตุได้ไม่เที่ยงเกิดดับ<br /><br />
            อาโปธาตุ (ธาตุน้ำ) ก็อาโปธาตุเป็นไฉน คืออาโปธาตุภายในก็มีภายนอกก็มี<br />
            ก็อาโปธาตุภายในเป็นไฉน<br />
            ได้แก่สิ่งที่เอิบอาบซึมซาบไป กำหนดได้มีในตนอาศัยตน<br />
            คือ ดี เสลด น้ำเหลือง เลือด เหงื่อ<br />
            มันข้น น้ำตา เปลวมัน น้ำลาย น้ำมูก ไขข้อ มูตร<br />
            หรือแม้แต่สิ่งอื่นไม่ว่าชนิดไรๆ ที่เอิบอาบซึมซาบไป กำหนดได้มีในตนอาศัยตน<br />
            นี้เรียกว่าอาโปธาตุภายใน ก็อาโปธาตุทั้งภายในและภายนอกนี้แล เป็นอาโปธาตุทั้งนั้น<br />
            พึงเห็นอาโปธาตุนั้น ด้วยปัญญาอันชอบ ตามความเป็นจริงอย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้น ว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ครั้นเห็นแล้วจะเบื่อหน่ายอาโปธาตุ และให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น อาโปธาตุได้ไม่เที่ยงเกิดดับ<br /><br />
            วาโยธาตุ (ธาตุลม) ก็วาโยธาตุเป็นไฉน คือวาโยธาตุภายในก็มีภายนอกก็มี<br />
            ก็วาโยธาตุภายในเป็นไฉน<br />
            ได้แก่สิ่งที่พัดผันไป กำหนดได้มีในตนอาศัยตน<br />
            คือ ลมพัดขึ้นเบื้องบน ลมพัดลงเบื้องต่ำ<br />
            ลมในท้อง ลมในลำไส้ ลมแล่นไปตามอวัยวะน้อยใหญ่ ลมหายใจออก ลมหายใจเข้า<br />
            หรือแม้แต่สิ่งอื่นไม่ว่าชนิดไรๆที่พัดผันไป กำหนดได้มีในตนอาศัยตน<br />
            นี้เรียกว่าวาโยธาตุภายใน ก็วาโยธาตุทั้งภายในและภายนอกนี้แล เป็นวาโยธาตุทั้งนั้น<br />
            พึงเห็นวาโยธาตุนั้น ด้วยปัญญาอันชอบ ตามความเป็นจริงอย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ครั้นเห็นแล้วจะเบื่อหน่ายวาโยธาตุ และให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น วาโยธาตุได้ไม่เที่ยงเกิดดับ<br /><br />
            เตโชธาตุ (ธาตุไฟ) ก็เตโชธาตุเป็นไฉน คือเตโชธาตุภายในก็มีภายนอกก็มี<br />
            ก็เตโชธาตุภายในเป็นไฉน<br />
            ได้แก่สิ่งที่อบอุ่นถึงความเร่าร้อน กำหนดได้มีในตนอาศัยตน<br />
            คือ ธาตุที่เป็นเครื่องยังกายให้อบอุ่น ยังกายให้ทรุดโทรม<br />
            ยังกายให้กระวนกระวาย และธาตุที่เป็นเหตุให้ของกิน ที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้มแล้วถึงความย่อยไปด้วยดี<br />
            หรือแม้แต่สิ่งอื่นไม่ว่าชนิดไรๆ ที่อบอุ่นถึงความเร่าร้อน กำหนดได้มีในตนอาศัยตน<br />
            นี้เรียกว่าเตโชธาตุภายใน ก็เตโชธาตุทั้งภายในและภายนอกนี้แล เป็นเตโชธาตุทั้งนั้น<br />
            พึงเห็นเตโชธาตุนั้น ด้วยปัญญาอันชอบ ตามความเป็นจริงอย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้น ว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ครั้นเห็นแล้วจะเบื่อหน่ายเตโชธาตุ และให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น เตโชธาตุได้ไม่เที่ยงเกิดดับ<br /><br />
            อากาศธาตุ (ความว่าง) ก็อากาศธาตุเป็นไฉน คืออากาศธาตุภายในก็มีภายนอกก็มี<br />
            ก็อากาศธาตุภายในเป็นไฉน<br />
            ได้แก่สิ่งที่ว่างปรุโปร่ง กำหนดได้มีในตนอาศัยตน<br />
            คือ ช่องหู ช่องจมูก ช่องปาก ซึ่งเป็นทางให้กลืนของกิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม<br />
            และเป็นทางระบายของ ที่กิน ที่เคี้ยว ที่ดื่ม แล้วออกมาทางเบื้องล่าง<br />
            หรือแม้แต่สิ่งอื่นไม่ว่าชนิดไรๆ ที่ว่างปรุโปร่ง กำหนดได้มีในตนอาศัยตน<br />
            นี้เรียกว่าอากาศธาตุภายใน ก็อากาศธาตุทั้งภายในและภายนอกนี้แล เป็นอากาศธาตุทั้งนั้น<br />
            พึงเห็นอากาศธาตุนั้น ด้วยปัญญาอันชอบ ตามความเป็นจริงอย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้น ว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ครั้นเห็นแล้วจะเบื่อหน่ายอากาศธาตุ และให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น อากาศธาตุได้ไม่เที่ยงเกิดดับ<br /><br />
            วิญญาณธาตุ (ความรู้) ต่อจากนั้นสิ่งที่เหลืออยู่ ก็คือวิญญาณธาตุอันบริสุทธิ์ผุดผ่อง<br />
            บุคคลย่อมรู้อะไรได้ด้วยวิญญาณนั้น<br />
            คือรู้ชัดว่าสุขบ้าง ทุกข์บ้าง ไม่ทุกข์ไม่สุขบ้าง<br />
            เพราะอาศัยผัสสะเป็นที่ตั้งแห่งสุขเวทนา ย่อมเกิดสุขเวทนา<br />
            บุคคลนั้นเมื่อเสวยสุขเวทนา ย่อมรู้สึกว่ากำลังเสวยสุขเวทนาอยู่<br />
            เพราะผัสสะเป็นที่ตั้ง แห่งสุขเวทนานั้นแลดับไป<br />
            ย่อมรู้สึกว่าความเสวยอารมณ์ ที่เกิดแก่ผัสสะนั้นคือตัวสุขเวทนา<br />
            อันเกิดเพราะอาศัยผัสสะเป็นที่ตั้ง แห่งสุขเวทนาย่อมดับไปย่อมเข้าไปสงบ<br />
            เพราะอาศัยผัสสะ เป็นที่ตั้งแห่งทุกขเวทนา ย่อมเกิดทุกขเวทนา<br />
            บุคคลนั้นเมื่อเสวยทุกขเวทนา ย่อมรู้สึกว่ากำลังเสวยทุกขเวทนาอยู่<br />
            เพราะผัสสะเป็นที่ตั้งแห่งทุกขเวทนานั้นแลดับไป ย่อมรู้สึกว่าความเสวยอารมณ์ที่เกิดแก่ผัสสะนั้น คือตัวทุกขเวทนา<br />
            อันเกิดเพราะอาศัยผัสสะ เป็นที่ตั้งแห่งทุกขเวทนาย่อมดับไป ย่อมเข้าไปสงบ<br />
            เพราะอาศัยผัสสะเป็นที่ตั้ง แห่งไม่ทุกข์ ไม่สุขเวทนา ย่อมเกิดไม่ทุกข์ ไม่สุขเวทนา<br />
            บุคคลนั้นเมื่อเสวย ไม่ทุกข์ ไม่สุขเวทนา ย่อมรู้สึกว่ากำลังเสวย ไม่ทุกข์ ไม่สุขเวทนาอยู่<br />
            เพราะผัสสะเป็นที่ตั้ง แห่งไม่ทุกข์ ไม่สุขเวทนานั้นแลดับไป<br />
            ย่อมรู้สึกว่าความเสวยอารมณ์ ที่เกิดแก่ผัสสะนั้น คือตัวไม่ทุกข์ ไม่สุขเวทนา<br />
            อันเกิดเพราะอาศัยผัสสะเป็นที่ตั้ง แห่งไม่ทุกข์ ไม่สุขเวทนาย่อมดับไป ย่อมเข้าไปสงบ<br />
            เปรียบเหมือนประทีปน้ำมัน อาศัยน้ำมันและไส้จึงลุกโพลงอยู่ได้<br />
            เพราะสิ้นน้ำมันและไส้นั้น และไม่เติมน้ำมันและไส้อื่น ย่อมเป็นประทีปหมดเชื้อดับไป ฉันใดฉันนั้นเหมือนกันแล<br />
            บุคคลนั้นเมื่อเสวยเวทนามีกายเป็นที่สุด ย่อมรู้สึกว่ากำลังเสวยเวทนามีกายเป็นที่สุด<br />
            เมื่อเสวยเวทนามีชีวิตเป็นที่สุด ย่อมรู้สึกว่ากำลังเสวยเวทนามีชีวิตเป็นที่สุด<br />
            และรู้สึกว่า เบื้องหน้าแต่สิ้นชีวิตเพราะตายไปแล้ว ความยินดีกันในโลกนี้แลจักเป็นของสงบ<br /><br /><hr /><br />
            </h4>
            <a href="/secondary/lesson0208">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                วิปัสสนากำหนดรู้ส่วน 2 อย่าง
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0207;