import React from 'react';

const Lesson0208 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>วิปัสสนากำหนดรู้ส่วน 2 อย่าง</h2>
          </div>
            <h4>
            วิญญาณเกิดขึ้นอย่างไร วิญญาณเกิดขึ้น เพราะอาศัยส่วนสอง<br />
            วิญญาณเกิดขึ้น เพราะอาศัยส่วนสองเป็นอย่างไร<br /><br /><hr /><br />
            จักษุวิญญาณย่อมเกิดขึ้น เพราะอาศัยจักษุและรูป<br />
            จักษุไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            รูปไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ส่วนสองอย่างนี้หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            จักษุวิญญาณไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งจักษุวิญญาณก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็จักษุวิญญาณที่เกิดขึ้นแล้ว เพราะอาศัยเหตุปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            ความประจวบ ความประชุม ความพร้อมกันแห่งธรรมทั้งสามนี้แล เรียกว่าจักษุสัมผัส<br />
            แม้จักษุสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งจักษุสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็จักษุสัมผัสที่เกิดขึ้นแล้ว เพราะอาศัยปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            บุคคลอันผัสสะกระทบแล้วย่อมรู้สึก อันผัสสะกระทบแล้วย่อมคิด อันผัสสะกระทบแล้วย่อมจำ<br />
            แม้ธรรมเหล่านี้ก็หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            โสตะวิญญาณ ย่อมเกิดขึ้น เพราะอาศัยหูและเสียง<br />
            หูไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            เสียงไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ส่วนสองอย่างนี้หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            โสตวิญญาณไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งโสตวิญญาณก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็โสตวิญญาณที่เกิดขึ้นแล้ว เพราะอาศัยเหตุปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            ความประจวบ ความประชุม ความพร้อมกันแห่งธรรมทั้งสามนี้แล เรียกว่าโสตสัมผัส<br />
            แม้โสตสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งโสตสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็โสตสัมผัสที่เกิดขึ้นแล้ว เพราะอาศัยปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            บุคคลอันผัสสะกระทบแล้วย่อมรู้สึก อันผัสสะกระทบแล้วย่อมคิด อันผัสสะกระทบแล้วย่อมจำ<br />
            แม้ธรรมเหล่านี้ก็หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            ฆานะวิญญาณ ย่อมเกิดขึ้น เพราะอาศัยจมูกและกลิ่น<br />
            จมูกไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            กลิ่นไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ส่วนสองอย่างนี้หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ฆานวิญญาณไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งฆานวิญญาณก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็ฆานวิญญาณที่เกิดขึ้นแล้ว เพราะอาศัยเหตุปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            ความประจวบ ความประชุม ความพร้อมกันแห่งธรรมทั้งสามนี้แล เรียกว่าฆานสัมผัส<br />
            แม้ฆานสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งฆานสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็ฆานสัมผัสที่เกิดขึ้นแล้ว เพราะอาศัยปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            บุคคลอันผัสสะกระทบแล้วย่อมรู้สึก อันผัสสะกระทบแล้วย่อมคิด อันผัสสะกระทบแล้วย่อมจำ<br />
            แม้ธรรมเหล่านี้ก็หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            ชิวหาวิญญาณ ย่อมเกิดขึ้น เพราะอาศัยลิ้นและรส<br />
            ลิ้นไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            รสไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ส่วนสองอย่างนี้หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ชิวหาวิญญาณไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งชิวหาวิญญาณก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็ชิวหาวิญญาณที่เกิดขึ้นแล้ว เพราะอาศัยเหตุปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            ความประจวบ ความประชุม ความพร้อมกันแห่งธรรมทั้งสามนี้แล เรียกว่าชิวหาสัมผัส<br />
            แม้ชิวหาสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งชิวหาสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็ชิวหาสัมผัสที่เกิดขึ้นแล้ว เพราะอาศัยปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหนv บุคคลอันผัสสะกระทบแล้วย่อมรู้สึก อันผัสสะกระทบแล้วย่อมคิด อันผัสสะกระทบแล้วย่อมจำ<br />
            แม้ธรรมเหล่านี้ก็หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            กายวิญญาณ ย่อมเกิดขึ้น เพราะอาศัยกายและสัมผัส<br />
            กายไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            สัมผัสไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ส่วนสองอย่างนี้หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            กายวิญญาณไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งกายวิญญาณก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็กายวิญญาณที่เกิดขึ้นแล้ว เพราะอาศัยเหตุปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            ความประจวบ ความประชุม ความพร้อมกันแห่งธรรมทั้งสามนี้แล เรียกว่ากายสัมผัส<br />
            แม้กายสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งกายสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็กายสัมผัสที่เกิดขึ้นแล้ว เพราะอาศัยปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            บุคคลอันผัสสะกระทบแล้วย่อมรู้สึก อันผัสสะกระทบแล้วย่อมคิด อันผัสสะกระทบแล้วย่อมจำ<br />
            แม้ธรรมเหล่านี้ก็หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            มโนวิญญาณ ย่อมเกิดขึ้น เพราะอาศัยใจและธรรมารมณ์<br />
            ใจไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ธรรมทั้งหลายก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ส่วนสองอย่างนี้หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            มโนวิญญาณไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งมโนวิญญาณก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็มโนวิญญาณที่เกิดขึ้นแล้ว เพราะอาศัยเหตุปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            ความประจวบ ความประชุม ความพร้อมกันแห่งธรรมทั้งสามนี้แล เรียกว่ามโนสัมผัส<br />
            แม้มโนสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            แม้เหตุปัจจัยเพื่อความเกิดขึ้น แห่งมโนสัมผัสก็ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            ก็มโนสัมผัสที่เกิดขึ้นแล้ว เพราะอาศัยปัจจัยอันไม่เที่ยง จักเป็นของเที่ยงได้แต่ไหน<br />
            บุคคลอันผัสสะกระทบแล้วย่อมรู้สึก อันผัสสะกระทบแล้วย่อมคิด อันผัสสะกระทบแล้วย่อมจำ<br />
            แม้ธรรมเหล่านี้ก็หวั่นไหว และอาพาธ ไม่เที่ยง มีความแปรปรวน มีความเป็นอย่างอื่น<br />
            มโนวิญญาณย่อมเกิดขึ้น เพราะอาศัยส่วนสองอย่างด้วยประการฉะนี้แล<br /><br /><hr /><br />
            </h4>
            <a href="/secondary/lesson0203">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                กำหนดรู้ธรรมที่เนื่องด้วยอายตนะ 6
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0208;