import React from 'react';

const Lesson0203 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>กำหนดรู้โลกและชีวิตกระทบสัมผัสว่างจากตนหรือของของตน</h2>
          </div>
            <h4>
            ตาเห็นรูป รูปไม่เที่ยงเกิดดับ จักขุ ว่างเปล่าจากตนหรือจากของๆตน<br />
            รูป ว่างเปล่าจากตนหรือจากของๆตน<br />
            จักขุวิญญาณ ว่างเปล่าจากตนหรือจากของๆตน<br />
            จักขุสัมผัส ว่างเปล่าจากตนหรือจากของๆตน<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากจักขุสัมผัส เป็นปัจจัยก็ว่างเปล่า จากตนหรือจากของๆตน<br />
            เพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนั้นโลกนี้จึงว่างเปล่า จากตนหรือจากของๆตน<br />
            ไม่มีวัตถุ สิ่งของ สัตว์ บุคคล ที่จะไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ โสตะ ว่างเปล่าจากตนหรือจากของๆตน<br />
            เสียง ว่างเปล่าจากตนหรือจากของๆตน<br />
            โสตะวิญญาณ ว่างเปล่าจากตนหรือจากของๆตน<br />
            โสตะสัมผัส ว่างเปล่าจากตนหรือจากของๆตน<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากโสตะสัมผัส เป็นปัจจัยก็ว่างเปล่า จากตนหรือจากของๆตน<br />
            เพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนั้นโลกนี้จึงว่างเปล่า จากตนหรือจากของๆตน<br />
            ไม่มีวัตถุ สิ่งของ สัตว์ บุคคล ที่จะไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ฆานะ ว่างเปล่าจากตนหรือจากของๆตน<br />
            กลิ่น ว่างเปล่าจากตนหรือจากของๆตน<br />
            ฆานะวิญญาณ ว่างเปล่าจากตนหรือจากของๆตน<br />
            ฆานะสัมผัส ว่างเปล่าจากตนหรือจากของๆตน<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากฆานะสัมผัส เป็นปัจจัยก็ว่างเปล่า จากตนหรือจากของๆตน<br />
            เพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนั้นโลกนี้จึงว่างเปล่า จากตนหรือจากของๆตน<br />
            ไม่มีวัตถุ สิ่งของ สัตว์ บุคคล ที่จะไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            ลิ้นได้รส รสไม่เที่ยงเกิดดับ ชิวหา ว่างเปล่าจากตนหรือจากของๆตน<br />
            รส ว่างเปล่าจากตนหรือจากของๆตน<br />
            ชิวหาวิญญาณ ว่างเปล่าจากตนหรือจากของๆตน<br />
            ชิวหาสัมผัส ว่างเปล่าจากตนหรือจากของๆตน<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากชิวหาสัมผัส เป็นปัจจัยก็ว่างเปล่า จากตนหรือจากของๆตน<br />
            เพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนั้นโลกนี้จึงว่างเปล่า จากตนหรือจากของๆตน<br />
            ไม่มีวัตถุ สิ่งของ สัตว์ บุคคล ที่จะไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ กาย ว่างเปล่าจากตนหรือจากของๆตน<br />
            สัมผัส ว่างเปล่าจากตนหรือจากของๆตน<br />
            กายวิญญาณ ว่างเปล่าจากตนหรือจากของๆตน<br />
            กายสัมผัส ว่างเปล่าจากตนหรือจากของๆตน<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากกายสัมผัส เป็นปัจจัยก็ว่างเปล่า จากตนหรือจากของๆตน<br />
            เพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนั้นโลกนี้จึงว่างเปล่า จากตนหรือจากของๆตน<br />
            ไม่มีวัตถุ สิ่งของ สัตว์ บุคคล ที่จะไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br />
            ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ มโน ว่างเปล่าจากตนหรือจากของๆตน<br />
            ธรรมารมณ์ ว่างเปล่าจากตนหรือจากของๆตน<br />
            มโนวิญญาณ ว่างเปล่าจากตนหรือจากของๆตน<br />
            มโนสัมผัส ว่างเปล่าจากตนหรือจากของๆตน<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากมโนสัมผัส เป็นปัจจัยก็ว่างเปล่า จากตนหรือจากของๆตน<br />
            เพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนั้นโลกนี้จึงว่างเปล่า จากตนหรือจากของๆตน<br />
            ไม่มีวัตถุ สิ่งของ สัตว์ บุคคล ที่จะไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br /><br /><hr /><br />
            </h4>
            <a href="/secondary/lesson0203">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                กำหนดรู้อินทรีย์ 6 ตามความเป็นจริง
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0203;