import React from 'react';

const Lesson0209 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>กำหนดรู้ธรรมที่เนื่องด้วยอายตนะ 6</h2>
          </div>
            <h4>
            พระพุทธเจ้าตรัสไว้ดังนี้ว่า บุคคลเมื่อไม่รู้ไม่เห็นจักษุ ตามความเป็นจริง<br />
            เมื่อไม่รู้ไม่เห็นรูป ตามความเป็นจริง<br />
            เมื่อไม่รู้ไม่เห็นจักษุวิญญาณ ตามความเป็นจริง<br />
            เมื่อไม่รู้ไม่เห็นจักษุสัมผัส ตามความเป็นจริง<br />
            เมื่อไม่รู้ไม่เห็นความเสวยอารมณ์ เป็นสุขก็ตาม เป็นทุกข์ก็ตาม มิใช่ทุกข์ มิใช่สุขก็ตาม<br />
            ที่เกิดขึ้นเพราะจักษุสัมผัส เป็นปัจจัยตามความเป็นจริง<br />
            ย่อมกำหนัดในจักษุ กำหนัดในรูป กำหนัดในจักษุวิญญาณ กำหนัดในจักษุสัมผัส<br />
            กำหนัดในเสวยอารมณ์ เป็นสุขก็ตามเป็นทุกข์ก็ตาม มิใช่ทุกข์มิใช่สุขก็ตาม<br />
            ที่เกิดขึ้นเพราะจักษุสัมผัสเป็นปัจจัย<br />
            เมื่อบุคคลนั้นกำหนัดนักแล้ว ประกอบพร้อมแล้ว ลุ่มหลงเล็งเห็นคุณอยู่<br />
            ย่อมมีอุปทานขันธ์ 5 ถึงความพอกพูนต่อไป<br />
            และเขาจะมีตัณหาที่นำไปสู่ภพใหม่ ร่วมกันด้วยความกำหนัด<br />
            ด้วยอำนาจความยินดี อันมีความเพลิดเพลิน ในอารมณ์นั้นๆ เจริญทั่ว<br />
            จะมีความกระวนกระวาย แม้ทางกายแม้ทางใจเจริญทั่ว<br />
            มีความเดือดร้อน แม้ทางกายแม้ทางใจเจริญทั่ว<br />
            มีความเร่าร้อน แม้ทางกายแม้ทางใจเจริญทั่ว<br />
            เขาย่อมเสวยทุกข์ทางกายบ้างทุกข์ทางใจบ้าง<br /><br />
            ส่วนบุคคลเมื่อรู้เมื่อเห็นจักษุ ตามความเป็นจริง<br />
            เมื่อรู้เมื่อเห็นรูป ตามความเป็นจริง<br />
            เมื่อรู้เมื่อเห็นจักษุวิญญาณ ตามความเป็นจริง<br />
            เมื่อรู้เมื่อเห็นจักษุสัมผัส ตามความเป็นจริง<br />
            เมื่อรู้เมื่อเห็นความเสวยอารมณ์ เป็นสุขก็ตามเป็นทุกข์ก็ตาม มิใช่ทุกข์ มิใช่สุขก็ตาม<br />
            ที่เกิดขึ้นเพราะจักษุสัมผัส เป็นปัจจัยตามความเป็นจริง<br />
            ย่อมไม่กำหนัดในจักษุ ไม่กำหนัดในรูป<br />
            ไม่กำหนัดในจักษุวิญญาณ ไม่กำหนัดในจักษุสัมผัส<br />
            ไม่กำหนัดในความเสวยอารมณ์ เป็นสุขก็ตามเป็นทุกข์ก็ตาม มิใช่ทุกข์มิใช่สุขก็ตาม<br />
            ที่เกิดขึ้นเพราะจักษุสัมผัสเป็นปัจจัย<br />
            เมื่อบุคคลนั้นไม่กำหนัดนักแล้ว ไม่ประกอบพร้อมแล้ว ไม่ลุ่มหลงเล็งเห็นโทษอยู่<br />
            ย่อมมีอุปทานขันธ์ 5 ไม่พอกพูนต่อไป<br />
            และเขาละตัณหาที่นำไปสู่ภพใหม่ ร่วมกันด้วยความกำหนัด<br />
            ด้วยอำนาจความยินดี อันมีความเพลิดเพลินในอารมณ์นั้นๆได้<br />
            จะละความกระวนกระวาย แม้ทางกายแม้ทางใจได้<br />
            จะละความเดือดร้อน แม้ทางกายแม้ทางใจได้<br />
            จะละความเร่าร้อน แม้ทางกายแม้ทางใจได้<br />
            เขาย่อมเสวยสุขทางกายบ้างสุขทางใจบ้าง<br />
            บุคคลผู้เป็นเช่นนั้นแล้ว มีความเห็นอันใด ความเห็นอันนั้นย่อมเป็นสัมมาทิฏฐิ<br />
            มีความดำริอันใด ความดำริอันนั้นย่อมเป็นสัมมาสังกัปปะ<br />
            มีความพยายามอันใด ความพยายามอันนั้นย่อมเป็นสัมมาวายามะ<br />
            มีความระลึกอันใด ความระลึกอันนั้นย่อมเป็นสัมมาสติ<br />
            มีความตั้งใจอันใด ความตั้งใจอันนั้นย่อมเป็นสัมมาสมาธิ<br />
            ส่วนกายกรรม วจีกรรม อาชีวะของเขา ย่อมบริสุทธิ์ดีในเบื้องต้น เที่ยงด้วยอาการอย่างนี้<br />
            เขาชื่อว่าอัฏฐังคิกมรรค อันประเสริฐถึงความเจริญบริบูรณ์<br /><br />
            เมื่อบุคคลนั้นเจริญอัฏฐังคิกมรรคนี้อยู่อย่างนี้ ชื่อว่ามีสติปัฏฐาน 4 สัมมัปปธาน 4 อิทธิบาท 4 อินทรีย์ 5 พละ 5 โพชฌงค์ 7<br />
            ถึงความเจริญบริบูรณ์ บุคคลนั้นเมื่อมีธรรมทั้ง 2 ดังนี้<br />
            คือสมถะและวิปัสสนาคู่เคียงกันเป็นไป เขาชื่อว่ากำหนดรู้ธรรม ที่ควรกำหนดรู้ด้วยปัญญาอันยิ่ง<br />
            ละธรรมที่ควรละด้วยปัญญาอันยิ่ง เจริญธรรมที่ควรเจริญด้วยปัญญาอันยิ่ง<br />
            ทำให้แจ้งธรรมที่ควรทำให้แจ้งด้วยปัญญาอันยิ่ง<br /><br /><hr /><br />
            กามคุณ 5 กามคุณนี้มี 5 อย่างแล 5 อย่างเป็นไฉน<br />
            รูปที่เห็นด้วยจักษุ อันน่าปรารถนา น่าใคร่ น่าพอใจ เป็นที่รักประกอบด้วยกาม เป็นที่ตั้งแห่งความกำหนัด<br />
            เสียงที่รู้ได้ด้วยโสต อันน่าปรารถนา น่าใคร่ น่าพอใจ เป็นที่รักประกอบด้วยกาม เป็นที่ตั้งแห่งความกำหนัด<br />
            กลิ่นที่รู้ได้ด้วยฆานะ อันน่าปรารถนา น่าใคร่ น่าพอใจ เป็นที่รักประกอบด้วยกาม เป็นที่ตั้งแห่งความกำหนัด<br />
            รสที่รู้ได้ด้วยชิวหา อันน่าปรารถนา น่าใคร่ น่าพอใจ เป็นที่รักประกอบด้วยกาม เป็นที่ตั้งแห่งความกำหนัด<br />
            โผฏฐัพพะที่รู้ด้วยกาย อันน่าปรารถนา น่าใคร่ น่าพอใจ เป็นที่รักประกอบด้วยกาม เป็นที่ตั้งแห่งความกำหนัด นี้แลกามคุณ 5 อย่าง<br /><br /><hr /><br />
            </h4>
            <a href="/secondary/lesson0203">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                วิปัสสนาภาวนา พิจารณาขันธ์ 5 อินทรีย์ 6
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0209;