import React from 'react';

const Lesson0210 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>วิปัสสนาภาวนา พิจารณาขันธ์ 5 อินทรีย์ 6</h2>
          </div>
            <h4>
            ตาเห็นรูปโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            ตัวฉันโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br /><br />
            หูได้ยินเสียงโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            ตัวฉันโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br /><br />
            จมูกได้กลิ่นโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            ตัวฉันโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br /><br />
            ลิ้นได้รสโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            ตัวฉันโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br /><br />
            กายสัมผัสโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            ตัวฉันโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br /><br />
            ใจคิดนึกโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            ตัวฉันโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตไม่ว่า เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br /><hr /><br />
            </h4>
            <a href="/secondary/lesson0211">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                โลกและชีวิตความรู้สึกเป็นอันเดียวกัน
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0210;