import React from 'react';

const Lesson0211 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>โลกและชีวิตความรู้สึกเป็นอันเดียวกัน</h2>
          </div>
            <h4>
            ความคิด โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เท้าเดิน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            มือจับ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เหลียวซ้าย โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เหลียวขวา โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ก้มหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เงยหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ยืน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เดิน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            นั่ง โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            นอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ตื่นนอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ลืมตา โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ที่นอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ผ้าห่ม โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ล้างหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            แปรงฟัน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            อาบน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ใส่เสื้อ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ใส่กางเกง โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            หวีผม โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            แต่งหน้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ไปทานข้าว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            จาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ช้อน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ข้าว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            กับข้าว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ดื่มน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ดื่มกาแฟ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ไปทำงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ขับรถ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ที่ทำงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เพื่อนร่วมงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            นั่งเก้าอี้ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            จับปากกา โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เขียนหนังสือ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เข้าห้องน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เลิกงาน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            กลับบ้าน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ซื้อของ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เข้าบ้าน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ให้อาหารสัตว์ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            รดน้ำต้นไม้ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            กวาดบ้าน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ถูพื้น โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ซักผ้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ไม้แขวนเสื้อ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ตากผ้า โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            กินข้าวเย็น โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            อาบน้ำ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เปิดพัดลม โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เปิดแอร์ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ดูทีวี โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ฟังเพลง โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            โทรศัพท์ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ปิดไฟ โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            เข้านอน โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            การเคลื่อนไหว โลกและชีวิตความรู้สึก เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br /><br />
            นี่คือผลต่อเนื่องของโลกและชีวิต กำหนดรู้ว่าทั้งหมดเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <a href="/secondary/lesson0212">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                โลกและชีวิตความรู้สึกเป็นอันเดียวกัน + ชื่อ
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0211;