import React from 'react';

const Lesson0204 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>กำหนดรู้อินทรีย์ 6 ตามความเป็นจริง</h2>
          </div>
            <h4>
            ตาเห็นรูป รูปเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ไม่มีตัวตน สัตว์ บุคคล ชื่อ สิ่งของในรูปที่เห็น<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับดับไม่เหลือ<br /><br />
            หูได้ยินเสียง เสียงเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ไม่มีตัวตน สัตว์ บุคคล ชื่อ สิ่งของในเสียงที่ได้ยิน<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับดับไม่เหลือ<br /><br />
            จมูกได้กลิ่น กลิ่นเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ไม่มีตัวตน สัตว์ บุคคล ชื่อ สิ่งของในกลิ่นที่ได้กลิ่น<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับดับไม่เหลือ<br /><br />
            ลิ้นได้รส รสเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ไม่มีตัวตน สัตว์ บุคคล ชื่อ สิ่งของในรสที่ได้รส<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับดับไม่เหลือ<br /><br />
            กายสัมผัส สัมผัสเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ไม่มีตัวตน สัตว์ บุคคล ชื่อ สิ่งของในสัมผัสที่สัมผัส<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับดับไม่เหลือ<br /><br />
            ใจคิดนึก ความคิดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ไม่มีตัวตน สัตว์ บุคคล ชื่อ สิ่งของในใจคิดนึกที่คิดนึก<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับดับไม่เหลือ<br /><br /><hr /><br />
            </h4>
            <a href="/secondary/lesson0205">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                วิปัสสนาภาวนา พิจารณาขันธ์ 5 อินทรีย์ 6
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0204;