import React from 'react';

const Lesson0206 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>วิปัสสนาภาวนา พิจารณาขันธ์ 5 อินทรีย์ 6</h2>
          </div>
            <h4>
            เท้าเดิน โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าเท้าเดิน เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าโลกและชีวิต มีตัวตนเป็นของตนเอง เป็นความเห็นผิด<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            เพราะเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            ความรู้สึกว่าสิ่งนี้มี เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            กำหนดรู้สุขถาวรเกิดขึ้นแล้ว เก็บสุขถาวรไว้ทันที<br /><br />
            เหลียวซ้าย โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าเหลียวซ้าย เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าโลกและชีวิต มีตัวตนเป็นของตนเอง เป็นความเห็นผิด<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            เพราะเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            ความรู้สึกว่าสิ่งนี้มี เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            กำหนดรู้สุขถาวรเกิดขึ้นแล้ว เก็บสุขถาวรไว้ทันที<br /><br />
            เหลียวขวา โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าเหลียวขวา เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าโลกและชีวิต มีตัวตนเป็นของตนเอง เป็นความเห็นผิด<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            เพราะเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            ความรู้สึกว่าสิ่งนี้มี เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            กำหนดรู้สุขถาวรเกิดขึ้นแล้ว เก็บสุขถาวรไว้ทันที<br /><br />
            เงยหน้า โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าเงยหน้า เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าโลกและชีวิต มีตัวตนเป็นของตนเอง เป็นความเห็นผิด<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            เพราะเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            ความรู้สึกว่าสิ่งนี้มี เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            กำหนดรู้สุขถาวรเกิดขึ้นแล้ว เก็บสุขถาวรไว้ทันที<br /><br />
            ก้มหน้า โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าก้มหน้า เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าโลกและชีวิต มีตัวตนเป็นของตนเอง เป็นความเห็นผิด<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            เพราะเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            ความรู้สึกว่าสิ่งนี้มี เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            กำหนดรู้สุขถาวรเกิดขึ้นแล้ว เก็บสุขถาวรไว้ทันที<br /><br /><hr /><br />
            การเคลื่อนไหว คือโลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าการเคลื่อนไหว คือโลกและชีวิตมีตัวตนเป็นของตนเอง เป็นความเห็นผิด<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            เพราะเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            กำหนดรู้สุขถาวรเกิดขึ้นแล้ว เก็บสุขถาวรไว้ทันที<br /><br />
            รูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์ คือโลกเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่า รูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์ คือโลกมีตัวตนเป็นของตนเอง เป็นความเห็นผิด<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            ตา หู จมูก ลิ้น กาย ใจ คือชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าตา หู จมูก ลิ้น กาย ใจ คือชีวิตมีตัวตนเป็นของตนเอง เป็นความเห็นผิด<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            โลกและชีวิตกระทบสัมผัส ผลต่อเนื่องที่เกิดขึ้นเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ความรู้สึกว่าโลกและชีวิตกระทบสัมผัส ผลต่อเนื่องที่เกิดขึ้นมีตัวตนเป็นของตนเอง เป็นความเห็นผิด<br />
            ความจริงเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br />
            กำหนดรู้สุขถาวรเกิดขึ้นแล้ว เก็บสุขถาวรไว้ทันที<br /><br /><hr /><br />
            </h4>
            <a href="/secondary/lesson0207">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                องค์ประกอบของโลกและชีวิต + กำหนดรู้ธาตุ 6
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0206;