import React from 'react';

const Lesson0205 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>วิปัสสนาภาวนา พิจารณาขันธ์ 5 อินทรีย์ 6</h2>
          </div>
            <h4>
            ตาเห็นรูป โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ตัวฉัน โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            เวทนา สัญญา สังขาร วิญญาณ เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            หูได้ยินเสียง โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ตัวฉัน โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            เวทนา สัญญา สังขาร วิญญาณ เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            จมูกได้กลิ่น โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ตัวฉัน โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            เวทนา สัญญา สังขาร วิญญาณ เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            ลิ้นได้รส โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ตัวฉัน โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            เวทนา สัญญา สังขาร วิญญาณ เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            กายสัมผัส โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ตัวฉัน โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            เวทนา สัญญา สังขาร วิญญาณ เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br />
            ใจคิดนึก โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ตัวฉัน โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            โลกและชีวิต เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            เวทนา สัญญา สังขาร วิญญาณ เป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ ดับไม่เหลือเหมือนกัน<br /><br /><hr /><br />
            </h4>
            <a href="/secondary/lesson0206">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                วิปัสสนาภาวนา พิจารณาขันธ์ 5 อินทรีย์ 6
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0205;