import React from 'react';

const Lesson0504 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ภาวนาเสมอด้วยธาตุ 5</h2>
          </div>
            <h4>
            ภาวนาเสมอด้วยธาตุ 5<br />
            ดูกรราหุล<br />
            เธอจงเจริญภาวนา เสมอด้วยแผ่นดินเถิด<br />
            เพราะเมื่อเธอเจริญภาวนา เสมอด้วยแผ่นดินอยู่<br />
            ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้<br /><br />

            ดูกรราหุล<br />
            เปรียบเหมือนคนทั้งหลาย ทิ้งของสะอาดบ้างไม่สะอาดบ้าง<br />
            คูถบ้าง มูตรบ้าง น้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง<br />
            ลงที่แผ่นดิน แผ่นดินจะอึดอัด หรือระอาหรือเกลียดของนั้นก็หาไม่ฉันใด<br />
            เธอจงเจริญภาวนา เสมอด้วยแผ่นดินฉันนั้นแล<br />
            เพราะเมื่อเธอเจริญภาวนา เสมอด้วยแผ่นดินอยู่<br />
            ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้<br /><br />

            ดูกรราหุล<br />
            เธอจงเจริญภาวนาเสมอด้วยน้ำเถิด เพราะเมื่อเธอเจริญภาวนา เสมอด้วยน้ำอยู่<br />
            ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้<br />
            ดูกรราหุล<br />
            เปรียบเหมือนคนทั้งหลาย ล้างของสะอาดบ้างของไม่สะอาดบ้าง<br />
            คูถบ้าง มูตรบ้าน น้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง<br />
            ลงในน้ำ น้ำจะอึดอัดหรือระอา หรือเกลียดของนั้นก็หาไม่ฉันใด<br />
            เธอจงเจริญภาวนา เสมอด้วยน้ำฉันนั้นแล<br />
            เพราะเมื่อเธอเจริญภาวนา เสมอด้วยน้ำอยู่<br />
            ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้<br /><br />

            ดูกรราหุล<br />
            เธอจงเจริญภาวนาเสมอด้วยไฟเถิด เพราะเมื่อเธอเจริญภาวนาเสมอด้วยไฟอยู่<br />
            ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ ที่เกิดขึ้นแล้วจะไม่ครอบงำจิตได้<br />
            ดูกรราหุล<br />
            เปรียบเหมือนไฟ ที่เผาของสะอาดบ้านของไม่สะอาดบ้าง<br />
            คูถบ้าง มูตรบ้าง น้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง<br />
            ไฟจะอึดอัดหรือระอา หรือเกลียดของนั้นก็หาไม่ฉันใด<br />
            เธอจงเจริญภาวนา เสมอด้วยไฟฉันนั้นแล<br />
            เพราะเมื่อเธอเจริญภาวนา เสมอด้วยไฟอยู่<br />
            ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้<br /><br />

            ดูกรราหุล<br />
            เธอจงเจริญภาวนาเสมอด้วยลมเถิด เพราะเมื่อเธอเจริญภาวนาเสมอด้วยลมอยู่<br />
            ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตของเธอได้<br />
            ดูกรราหุล<br />
            เปรียบเหมือนลมย่อมพัดต้องของสะอาดบ้างของไม่สะอาดบ้าง<br />
            คูถบ้าง มูตรบ้าง น้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง<br />
            ลมจะอึดอัดหรือระอา หรือเกลียดของนั้นก็หาไม่ฉันใด<br />
            เธอจงเจริญภาวนา เสมอด้วยลมฉันนั้น<br />
            ก็เมื่อเธอเจริญภาวนา เสมอด้วยลมอยู่<br />
            ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้<br /><br />

            ดูกรราหุล<br />
            เธอจงเจริญภาวนาเสมอด้วยอากาศเถิด เพราะเมื่อเธอเจริญภาวนา<br />
            เสมอด้วยอากาศอยู่ ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ<br />
            ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้<br />
            ดูกรราหุล<br />
            เปรียบเหมือนอากาศ ไม่ตั้งอยู่ในที่ไหนฉันใด<br />
            เธอจงเจริญภาวนา เสมอด้วยอากาศฉันนั้นแล<br />
            เพราะเมื่อเธอเจริญภาวนา เสมอด้วยอากาศอยู่<br />
            ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้<br /><br />
            </h4>
            <h3>การเจริญภาวนาธรรม 6 อย่าง</h3>
            <h4>
            ดูกรราหุล<br />
            เธอจงเจริญเมตตาภาวนาเถิด<br />
            เพราะเมื่อเธอเจริญเมตตาภาวนาอยู่ จักละพยาบาทได้<br />
            เธอจงเจริญกรุณาภาวนาเถิด<br />
            เพราะเมื่อเธอเจริญกรุณาภาวนาอยู่ จักละวิหิงสาได้<br />
            เธอจงเจริญมุทิตาภาวนาเถิด<br />
            เพราะเมื่อเธอเจริญมุทิตาภาวนาอยู่ จักละอรติได้<br />
            เธอจงเจริญอุเบกขาภาวนาเถิด<br />
            ก็เมื่อเธอเจริญอุเบกขาภาวนาอยู่ จักละปฏิฆะได้<br />
            เธอจงเจริญอสุภภาวนาเถิด<br />
            เพราะเมื่อเธอเจริญอสุภภาวนาอยู่ จักละราคาได้<br />
            เธอจงเจริญอนิจจสัญญาภาวนาเถิด<br />
            เพราะเมื่อเธอเจริญอนิจจสัญญาภาวนาอยู่ จักละอัสมิมานะได้<br /><br /><hr /><br />
            </h4>
            <a href="/fifth/lesson0505">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                อานาปานสติภาวนา
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0504;