import React from 'react';

const Lesson0510 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ปริวีมังสนสูตร</h2>
          </div>
            <h4>
            ปริวีมังสนสูตร<br />
            ว่าด้วยการพิจารณา เพื่อความสิ้นทุกข์โดยชอบ<br />
            ข้าพเจ้าสดับมาแล้วอย่างนี้<br />
            สมัยหนึ่งพระผู้มีพระภาค ประทับอยู่ ณ พระเชตวัน<br />
            อารามของท่านอนาถบิณฑิกเศรษฐี เขตพระนครสาวัตถี<br />
            ณ ที่นั้นแลพระผู้มีพระภาค ตรัสเรียกภิกษุทั้งหลายว่า<br />
            ดูกรภิกษุทั้งหลาย<br />
            ภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคว่า พระพุทธเจ้าข้า<br />
            พระผู้มีพระภาคได้ตรัสว่า<br />
            ดูกรภิกษุทั้งหลายด้วยเหตุเท่าไรหนอแล ภิกษุเมื่อพิจารณาพึงพิจารณา<br />
            เพื่อความสิ้นทุกข์โดยชอบ โดยประการทั้งปวง<br />
            ภิกษุเหล่านั้นทูลว่าพระพุทธเจ้าข้า<br />
            ธรรมทั้งหลายของพวกข้าพระองค์<br />
            มีพระผู้มีพระภาคเป็นที่ตั้ง<br />
            มีพระผู้มีพระภาคเป็นผู้นำ<br />
            มีพระผู้มีพระภาคเป็นที่พึ่ง<br />
            ได้โปรดเถิดพระพุทธเจ้าข้า<br />
            ขอเนื้อความแห่งภาษิตนี้จงแจ่มแจ้ง กะพระผู้มีพระภาคเถิด<br />
            ภิกษุทั้งหลายได้ฟัง<br />
            ต่อพระผู้มีพระภาคแล้ว จะทรงจำไว้<br />
            พระผู้มีพระภาคตรัสว่า<br />
            ดูกรภิกษุทั้งหลายถ้าเช่นนั้น<br />
            เธอทั้งหลายจงฟังจงใส่ใจให้ดี เราจักกล่าว<br />
            ภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคแล้ว<br />
            พระผู้มีพระภาคได้ตรัสว่า<br />
            ดูกรภิกษุทั้งหลายภิกษุในธรรมวินัยนี้<br />
            เมื่อพิจารณาย่อมพิจารณาว่า ทุกข์คือชราและมรณะ<br />
            มีประการต่างๆมากมายเกิดขึ้นในโลก<br />
            ทุกข์นี้มีอะไรเป็นเหตุ มีอะไรเป็นสมุทัย มีอะไรเป็นกรรม<br />
            มีอะไรเป็นแดนเกิดหนอแล<br />
            เมื่ออะไรมีชราและมรณะจึงมี<br />
            เมื่ออะไรไม่มีชราและมรณะจึงไม่มี<br />
            ภิกษุนั้นพิจารณาอยู่ย่อมรู้ประจักษ์ว่า<br />
            ทุกข์คือชราและมรณะ<br />
            มีประการต่างๆมากมายเกิดขึ้นในโลก<br />
            ทุกข์นี้แลมีชาติเป็นเหตุ<br />
            มีชาติเป็นสมุทัย<br />
            มีชาติเป็นกำเนิด<br />
            มีชาติเป็นแดนเกิด<br />
            เมื่อชาติมีชราและมรณะจึงมี<br />
            เมื่อชาติไม่มีชราและมรณะจึงไม่มี<br />
            ภิกษุนั้นย่อมรู้ประจักษ์ชราและมรณะ<br />
            ย่อมรู้ประจักษ์เหตุเกิดชราและมรณะ<br />
            ย่อมรู้ประจักษ์ความดับแห่งชราและมรณะ<br />
            ย่อมรู้ประจักษ์ปฏิปทาอันสมควร<br />
            ที่ให้ถึงความดับแห่งชราและมรณะ<br />
            และย่อมเป็นผู้ปฏิบัติอย่างนั้น<br />
            เป็นผู้ประพฤติธรรมอันสมควร<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            ภิกษุนี้เราเรียกว่า<br />
            เป็นผู้ปฏิบัติเพื่อความสิ้นทุกข์โดยชอบ<br />
            โดยประการทั้งปวง<br />
            เพื่อความดับแห่งชราและมรณะ<br />
            อีกประการหนึ่ง<br />
            ภิกษุเมื่อพิจารณาย่อมพิจารณาว่า<br />
            ก็ชาตินี้มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นสมุทัย<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br />
            เมื่ออะไรมี ชาติจึงมี<br />
            เมื่ออะไรไม่มี ชาติจึงไม่มี<br />
            ภิกษุนั้นพิจารณาอยู่ย่อมรู้ประจักษ์ว่า<br />
            ชาติมีภพเป็นเหตุ<br />
            มีภพเป็นสมุทัย<br />
            มีภพเป็นกำเนิด<br />
            มีภพเป็นแดนเกิด<br />
            เมื่อภพมีชาติจึงมี<br />
            เมื่อภพไม่มีชาติจึงไม่มี<br />
            ภิกษุนั้นย่อมรู้ประจักษ์ชาติ<br />
            ย่อมรู้ประจักษ์เหตุเกิดแห่งชาติ<br />
            ย่อมรู้ประจักษ์ความดับแห่งชาติ<br />
            ย่อมรู้ประจักษ์ปฏิปทาอันสมควร<br />
            ที่ให้ถึงความดับแห่งชาติ<br />
            และย่อมเป็นผู้ปฏิบัติอย่างนั้น<br />
            เป็นผู้ประพฤติธรรมอันสมควร<br />
            ภิกษุนี้เราเรียกว่า<br />
            เป็นผู้ปฏิบัติเพื่อความสิ้นทุกข์โดยชอบ<br />
            โดยประการทั้งปวง<br />
            เพื่อความดับแห่งชาติ',
            อีกประการหนึ่งภิกษุเมื่อพิจารณา<br />
            ย่อมพิจารณาว่า<br />
            ก็ภพนี้มีอะไรเป็นเหตุ ฯลฯ<br />
            ก็อุปาทานนี้มีอะไรเป็นเหตุ ฯลฯ<br />
            ก็ตัณหานี้มีอะไรเป็นเหตุ ฯลฯ<br />
            ก็เวทนานี้มีอะไรเป็นเหตุ​ ฯลฯ<br />
            ก็ผัสสะนี้มีอะไรเป็นเหตุ ฯลฯ<br />
            ก็สฬายตนะนี้มีอะไรเป็นเหตุ ฯลฯ<br />
            ก็นามรูปนี้มีอะไรเป็นเหตุ ฯลฯ<br />
            ก็วิญญาณนี้มีอะไรเป็นเหตุ ฯลฯ<br />
            ก็สังขารนี้มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นสมุทัย<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br />
            เมื่ออะไรมีสังขารจึงมี<br />
            เมื่ออะไรไม่มีสังขารจึงไม่มี<br />
            ภิกษุนั้นเมื่อพิจารณาย่อมรู้ประจักษ์ว่า<br />
            สังขารมีอวิชชาเป็นเหตุ<br />
            มีอวิชชาเป็นสมุทัยมีอวิชชาเป็นกำเนิด<br />
            มีอวิชชาเป็นแดนเกิด<br />
            เมื่ออวิชามีสังขารจึงมี<br />
            เมื่ออวิชชาไม่มีสังขารจึงไม่มี<br />
            ภิกษุนั้นย่อมรู้ประจักษ์สังขาร<br />
            ย่อมรู้ประจักษ์เหตุเกิดแห่งสังขาร<br />
            ย่อมรู้ประจักษ์ความดับแห่งสังขาร<br />
            ย่อมรู้ประจักษ์ปฏิปทาอันสมควร<br />
            ที่ให้ถึงความดับแห่งสังขาร<br />
            และย่อมเป็นผู้ปฏิบัติอย่างนั้น<br />
            เป็นผู้ประพฤติธรรมอันสมควร<br />
            ภิกษุนี้เราเรียกว่า<br />
            เป็นผู้ปฏิบัติเพื่อความสิ้นทุกข์โดยชอบ<br />
            โดยประการทั้งปวง<br />
            เพื่อความดับแห่งสังขาร<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            บุคคลตกอยู่ในอวิชชา<br />
            สังขารที่เป็นบุญปรุงแต่ง<br />
            วิญญาณก็เข้าถึงบุญ<br />
            ถ้าสังขารที่เป็นบาปปรุงแต่ง<br />
            วิญญาณก็เข้าถึงบาป<br />
            ถ้าสังขารที่เป็นอเนญชาปรุงแต่ง<br />
            วิญญาณก็เข้าถึงอเนญชา<br />
            ดูกรภิกษุทั้งหลาย<br />
            ในกาลใดแลภิกษุละอวิชชาได้แล้ว<br />
            วิชชาเกิดขึ้นแล้วในกาลนั้น<br />
            ภิกษุนั้นก็ไม่ทำกรรมเป็นบุญ<br />
            ไม่ทำกรรมเป็นบาป<br />
            ไม่ทำการเป็นอเนญชา<br />
            เพราะสำรอกอวิชชาเสีย<br />
            เพราะมีวิชชาเกิดขึ้น<br />
            เมื่อไม่ทำเมื่อไม่คิด<br />
            ก็ไม่ถือมั่นอะไรๆในโลก<br />
            เมื่อไม่ถือมั่นก็ไม่สะดุ้งกลัว<br />
            เมื่อไม่สะดุ้งกลัวก็ปรินิพพาน<br />
            ย่อมรู้ชัดว่าชาติสิ้นแล้ว<br />
            พรหมจรรย์อยู่จบแล้ว<br />
            กิจที่ควรทำ ทำเสร็จแล้ว<br />
            กิจอื่นเพื่อความเป็นอย่างนี้มิได้มี<br />
            ภิกษุนั้นถ้าเสวยสุขเวทนา<br />
            ก็รู้ชัดว่าสุขเวทนานั้นไม่เที่ยง<br />
            อันตนไม่ยึดถือแล้วด้วยตัณหา<br />
            อันตนไม่เพลิดเพลินแล้วด้วยตัณหา<br />
            ถ้าเสวยทุกขเวทนาก็รู้ชัดว่า<br />
            ทุกขเวทนานั้นไม่เที่ยง<br />
            อันตนไม่ยึดถือแล้วด้วยตัณหา<br />
            อันตนไม่เพลิดเพลินแล้วด้วยตัณหา<br />
            ถ้าเสวยไม่ทุกข์ไม่สุขเวทนา<br />
            ก็รู้ชัดว่าไม่ทุกข์ไม่สุขเวทนานั้นไม่เที่ยง<br />
            อันตนไม่ยึดถือแล้วด้วยตัณหา<br />
            อันตนไม่เพลิดเพลินแล้วด้วยตัณหา<br />
            ภิกษุนั้นถ้าเสวยสุขเวทนา<br />
            ก็วางใจเฉยเสวยไป<br />
            ถ้าเสวยทุกขเวทนา<br />
            ก็วางใจเฉยเสวยไป<br />
            ถ้าเสวยไม่ทุกข์ไม่สุขเวทนา<br />
            ก็วางใจเฉยเสวยไป<br />
            ภิกษุนั้นเมื่อเสวยเวทนา<br />
            ที่ปรากฏทางกาย<br />
            ก็รู้ชัดว่าเราเสวยเวทนา<br />
            ที่ปรากฏทางกาย<br />
            เมื่อเสวยเวทนา<br />
            ที่ปรากฏทางชีวิต<br />
            ก็รู้ชัดว่าเราเสวยเวทนา<br />
            ที่ปรากฏทางชีวิต<br />
            ก็รู้ชัดว่าเวทนาทั้งปวง<br />
            อันตัณหาไม่เพลิดเพลินแล้ว<br />
            จักเป็นของเย็น<br />
            สรีระธาตุจักเหลืออยู่ในโลกนี้เท่านั้น<br />
            เบื้องหน้าตั้งแต่สิ้นชีวิต<br />
            เพราะความแตกแห่งกาย<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            บุรุษยกหม้อที่ยังร้อนออกจากเตาเผา<br />
            เมื่อวางไว้ที่พื้นดินอันเรียบ<br />
            ไออุ่นที่หม้อนั้นพึงหายไป<br />
            กระเบื้องหม้อยังเหลืออยู่ที่พื้นดินนั้นนั่นแหละ<br />
            แม้ฉันใดภิกษุทั้งหลาย<br />
            ภิกษุเมื่อเสวยเวทนาที่ปรากฏทางกาย<br />
            ก็รู้ชัดว่าเราเสวยเวทนาที่ปรากฏทางกาย<br />
            เมื่อเสวยเวทนาที่ปรากฏทางชีวิต<br />
            ก็รู้ชัดว่าเราเสวยเวทนาที่ปรากฏทางชีวิต<br />
            ก็รู้ชัดว่าเวทนาทั้งปวง<br />
            อันตัณหาไม่เพลิดเพลินแล้ว<br />
            จะเป็นของเย็น<br />
            สรีระธาตุจักเหลืออยู่ในโลกนี้เท่านั้น<br />
            เบื้องหน้าตั้งแต่สิ้นชีวิต<br />
            เพราะความแตกแห่งกายฉันนั้นเหมือนกัน<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            พวกเธอจะสำคัญความข้อนั้นเป็นไฉน<br />
            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายว่า<br />
            ภิกษุผู้ขีณาสพพึงทำกรรมเป็นบุญบ้าง<br />
            ทำกรรมเป็นบาปบ้าง<br />
            ทำกรรมเป็นเนญชาบ้างหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า<br />
            ไม่เป็นอย่างนั้นพระเจ้าข้า<br /><br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อสังขารไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะสังขารดับวิญญาณพึงปรากฎหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า<br />
            ไม่เป็นอย่างนั้นพระเจ้าข้า<br /><br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อวิญญาณไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะวิญญาณดับนามรูปพึงปรากฎหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า<br />
            ไม่เป็นอย่างนั้นพระเจ้าข้า<br /><br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อนามรูปไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะนามรูปดับสฬายตนะพึงปรากฎหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า<br />
            ไม่เป็นอย่างนั้นพระเจ้าข้า<br /><br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อสฬายตนะไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะสฬายตนะดับผัสสะพึงปรากฏหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า<br />
            ไม่เป็นอย่างนั้นพระเจ้าข้า<br /><br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อผัสสะไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะผัสสะดับเวทนาพึงปรากฏหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า<br />
            ไม่เป็นอย่างนั้นพระเจ้าข้า<br /><br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อเวทนาไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะเวทนาดับตัณหาพึงปรากฏหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า<br />
            ไม่เป็นอย่างนั้นพระเจ้าข้า<br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อเวทนาไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะเวทนาดับตัณหาพึงปรากฏหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า<br />
            ไม่เป็นอย่างนั้นพระเจ้าข้า<br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อตัณหาไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะตัณหาดับอุปาทานพึงปรากฏหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า<br />
            ไม่เป็นอย่างนั้นพระเจ้าข้า<br /><br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่ออุปาทานไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะอุปาทานดับภพพึงปรากฏหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า ไม่เป็นอย่างนั้นพระเจ้าข้า<br /><br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อภพไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะภพดับชาติพึงปรากฏหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า ไม่เป็นอย่างนั้นพระเจ้าข้า<br /><br />

            พระพุทธเจ้าทรงตรัสถามภิกษุทั้งหลายต่อไปว่า<br />
            ก็อีกอย่างหนึ่งเมื่อชาติไม่มี<br />
            โดยประการทั้งปวง<br />
            เพราะชาติดับชราและมรณะพึงปรากฏหรือหนอ<br />
            ภิกษุทั้งหลายทูลตอบว่า ไม่เป็นอย่างนั้นพระเจ้าข้า<br />
            ดีละๆภิกษุทั้งหลาย พวกเธอจงสำคัญ จงเชื่อซึ่งข้อนั้นไว้อย่างนั้นเถิด<br />
            พวกเธอจงน้อมใจไปสู่ข้อนั้นอย่างนั้นเถิด<br />
            จงหมดความเคลือบแคลงสงสัยในข้อนั้นเถิด นั่นเป็นที่สุดทุกข์<br /><br /><hr /><br />
            </h4>
            <a href="/fifth/lesson0511">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                สัมมสนสูตรที่ 2
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0510;