import React from 'react';

const Lesson0505 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>อานาปานสติภาวนา</h2>
          </div>
            <h4>
            อานาปานสติภาวนา<br />
            ดูกรราหุล<br />
            เธอจงเจริญอานาปานสติภาวนาเถิด<br />
            เพราะอานาปานสติ ที่บุคคลเจริญแล้วทำให้มากแล้ว ย่อมมีผลมีอานิสงส์ใหญ่<br />
            ก็อานาปานสติอันบุคคลเจริญอย่างไร ทำให้มากอย่างไร จึงมีผลใหญ่มีอานิสงส์ใหญ่<br /><br />

            ดูกรราหุล<br />
            ภิกษุในธรรมวินัยนี้ อยู่ในป่าก็ดี อยู่ที่โคนไม้ก็ดี อยู่ในเรือนว่างก็ดี<br />
            นั่งคู้บัลลังก์ตั้งกายตรง ดำรงสติไว้เฉพาะหน้า<br />
            เธอมีสติหายใจออก มีสติหายใจเข้า<br />
            เมื่อหายใจออกยาว ก็รู้ชัดว่าหายใจออกยาว<br />
            เมื่อหายใจเข้ายาว ก็รู้ชัดว่าหายใจเข้ายาว<br />
            เมื่อหายใจออกสั้น ก็รู้ชัดว่าหายใจออกสั้น<br />
            เมื่อหายใจเข้าสั้น ก็รู้ชัดว่าหายใจเข้าสั้น<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้กองลมทั้งปวงหายใจออก<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้กองลมทั้งปวงหายใจเข้า<br />
            ย่อมสำเหนียกว่า จักระงับกายสังขารหายใจออก<br />
            ย่อมสำเหนียกว่า จักระงับกายสังขารหายใจเข้า<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้ปิติหายใจออก<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้ปิติหายใจเข้า<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้สึกหายใจออก<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้สึกหายใจเข้า<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้จิตสังขารหายใจออก<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้จิตสังขารหายใจเข้า<br />
            ย่อมสำเหนียกว่า จักระงับจิตสังขารหายใจออก<br />
            ย่อมสำเหนียกว่า จักระงับจิตสังขารหายใจเข้า<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้จิตหายใจออก<br />
            ย่อมสำเหนียกว่า จักกำหนดรู้จิตหายใจเข้า<br />
            ย่อมสำเหนียกว่า จักทำจิตให้ร่าเริงหายใจออก<br />
            ย่อมสำเหนียกว่า จักทำจิตให้ร่าเริงหายใจเข้า<br />
            ย่อมสำเหนียกว่า จักดำรงจิตมั่นหายใจออก<br />
            ย่อมสำเหนียกว่า จักดำรงจิตมั่นหายใจเข้า<br />
            ย่อมสำเหนียกว่า จักเปลื้องจิตหายใจออก<br />
            ย่อมสำเหนียกว่า จักเปลื้องจิตหายใจเข้า<br />
            ย่อมสำเหนียกว่าจักพิจารณา โดยความเป็นของไม่เที่ยงหายใจออก<br />
            ย่อมสำเหนียกว่าจักพิจารณา โดยความเป็นของไม่เที่ยงหายใจเข้า<br />
            ย่อมสำเหนียกว่าจักพิจารณา ธรรมอันปราศจากราคะหายใจออก<br />
            ย่อมสำเหนียกว่าจักพิจารณา ธรรมอันปราศจากราคะหายใจเข้า<br />
            ย่อมสำเหนียกว่าจักพิจารณา ธรรมเป็นที่ดับสนิทหายใจออก <br />
            ย่อมสำเหนียกว่าจักพิจารณา ธรรมเป็นที่ดับสนิทหายใจเข้า<br />
            ย่อมสำเหนียกว่าจักพิจารณา ธรรมเป็นที่สละคืนหายใจออก<br />
            ย่อมสำเหนียกว่าจักพิจารณา ธรรมเป็นที่สละคืนหายใจเข้า<br /><br />

            ดูกรราหุล<br />
            อานาปานสติที่บุคคลเจริญแล้วอย่างนี้ ทำให้มากแล้วอย่างนี้ ย่อมมีผลใหญ่มีอานิสงส์ใหญ่<br /><br />

            ดูกรราหุล<br />
            เมื่ออานาปานสติอันบุคคลเจริญแล้วอย่างนี้ ทำให้มากแล้วอย่างนี้<br />
            ลมอัสสาสะปัสสาสะอันมีในภายหลัง<br />
            อันบุคคลผู้เจริญอานาปานสติ ทราบชัดแล้วย่อมดับไป<br />
            หาเป็นอันบุคคลผู้เจริญอานาปานสติ ไม่ทราบชัดแล้วดับไปไม่ได้ดังนี้<br />
            พระผู้มีพระภาคได้ตรัสพระพุทธพจน์นี้แล้ว<br />
            ท่านพระราหุลมีใจยินดี ชื่นชมพระภาษิตของพระผู้มีพระภาคดังนี้แล<br /><br /><hr /><br />
            </h4>
            <a href="/fifth/lesson0506">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                เทศนาสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0505;