import React from 'react';

const Lesson0502 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ภิกขุวรรค</h2>
          </div>
            <h4>
            ภิกขุวรรค<br />
            จูฬราหุโลวาทสูตร<br />
            เรื่องพระราหุล<br />
            ข้าพเจ้าได้สดับมาอย่างนี้ สมัยหนึ่งพระผู้มีพระภาค<br />
            ประทับอยู่ณพระวิหารเวฬุวัน กลันทกนิวาปสถาน เขตพระนครราชคฤห์<br />
            ก็สมัยนั้นแลท่านพระราหุล อยู่ ณ ปราสาท ชื่อว่าอัมพลัฏฐิกา<br />
            ครั้งนั้นเวลาเย็น พระผู้มีพระภาคเสด็จออกจากที่เร้นอยู่<br />
            แล้วเสด็จเข้าไปยัง อัมพลัฏฐิกาปราสาท ที่ท่านพระราหุลอยู่<br />
            ท่านพระราหุลได้เห็นพระผู้มีพระภาค เสด็จมาแต่ไกลจึงปูลาดอาสนะ<br />
            และตั้งน้ำสำหรับล้างพระบาทไว้<br />
            พระผู้มีพระภาคประทับนั่ง บนอาสนะที่ปูลาดไว้ แล้วทรงล้างพระบาท<br />
            ท่านพระราหุลถวายบังคม พระผู้มีพระภาค<br />
            แล้วนั่ง ณ ที่ควรส่วนข้างหนึ่ง<br />
            ลำดับนั้นพระผู้มีพระภาค เหลือน้ำไว้ในภาชนะน้ำหน่อยหนึ่ง<br />
            แล้วตรัสกะท่านพระราหุลว่า<br />
            ดูกรราหุลเธอเห็นน้ำเหลือหน่อยหนึ่ง อยู่ในภาชนะน้ำนี้หรือ<br />
            ท่านพระราหุลกราบทูลว่า เห็นพระเจ้าข้า<br />
            ดูกรราหุลสมณธรรมของบุคคล<br />
            ผู้ไม่มีความละอายในการกล่าวมุสา ทั้งรู้อยู่ก็มีน้อยเหมือนกันฉะนั้น<br />
            ลำดับนั้นพระผู้มีพระภาคเทน้ำ ที่เหลือหน่อยหนึ่งนั้นเสีย<br />
            แล้วตรัสกะท่านพระราหุลว่า<br />
            ดูกรราหุลเคยเห็นน้ำหน่อยหนึ่ง ที่เราเทเสียแล้วหรือ<br />
            ท่านพระราหูกราบทูลว่า เห็นพระเจ้าข้า<br />
            ดูกรราหุลสมณธรรมของบุคคล<br />
            ผู้ไม่มีความละอายในการกล่าวมุสา ทั้งรู้อยู่ก็เป็นของที่เขาทิ้งเสียแล้ว เหมือนกันฉะนั้น<br />
            ลำดับนั้นพระผู้มีพระภาค ทรงคว่ำภาชนะน้ำนั้น<br />
            แล้วตรัสกะท่านพระราหุลว่า<br />
            ดูกรราหุลเธอเห็นภาชนะน้ำ ที่คว่ำนี้หรือ<br />
            ท่านพระราหุลกราบทูลว่า เห็นพระเจ้าข้า<br />
            ดูกรราหุลสมณธรรมของบุคคล<br />
            ผู้ไม่มีความละอายในการกล่าวมุสา ทั้งรู้อยู่ก็เป็นของที่เขาคว่ำเสียแล้ว เหมือนกันฉะนั้น<br />
            ลำดับนั้น พระผู้มีพระภาคทรงหงายภาชนะน้ำนั้นขึ้น<br />
            แล้วตรัสกะท่านพระราหุลว่าดูกรราหุล<br />
            เธอเห็นภาชนะมันว่างเปล่านี้หรือ<br />
            ท่านพระราหุลกราบทูลว่า เห็นพระเจ้าข้า<br />
            ดูกรราหุลสมณธรรมของบุคคล<br />
            ผู้ไม่มีความละอายในการกล่าวมุสา ทั้งรู้อยู่ ก็เป็นของว่างเปล่าเหมือนกันฉะนั้น<br />
            ดูกรราหุลเธอจะสำคัญความข้อนั้นเป็นไฉน<br />
            แว่นมีประโยชน์อย่างไร<br />
            ท่านพระราหุลกราบทูลว่า<br />
            มีประโยชน์สำหรับส่องดูพระเจ้าข้า<br />
            ฉันนั้นเหมือนกันแลราหุล<br />
            บุคคลควรพิจารณาเสียก่อน แล้วจึงทำกรรมด้วยกาย ด้วยวาจา ด้วยใจ<br /><br /><hr /><br />
            </h4>
            <h3>กรรม 3</h3>
            <h4>
            ดูกรราหุล<br />
            เธอปรารถนาจะทำกรรมใดด้วยกาย กายกรรมนั้นเธอพึงพิจารณาเสียก่อนว่า<br />
            เราปรารถนาจะทำกรรมนี้ใดด้วยกาย กายกรรมของเรานี้พึงเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนทั้งผู้อื่นบ้าง<br />
            ดูกรราหุล ถ้าเมื่อเธอพิจารณาอยู่<br />
            พึงรู้อย่างนี้ว่า เราปรารถนาจะทำกรรมใด ด้วยกายกายกรรมของเรานี้<br />
            พึงเป็นไปเพื่อเบียดเบียนตน เพื่อเบียดเบียนผู้อื่น<br />
            เพื่อเบียดเบียนทั้งตนทั้งผู้อื่น กายกรรมนี้เป็นอกุศล<br />
            มีทุกข์เป็นกำไร มีทุกข์เป็นวิบากดังนี้ไซร้<br />
            กรรมเห็นปานนี้ เธอไม่พึงทำด้วยกายโดยส่วนเดียว<br />
            แต่ถ้าเมื่อเธอพิจารณาอยู่<br />
            พึงรู้อย่างนี้ว่า<br />
            เราปรารถนาจะทำกรรมใด ด้วยกายกายกรรมของเรานี้<br />
            ไม่พึงเป็นไปเพื่อเบียดเบียนตน เพื่อเบียดเบียนผู้อื่น เพื่อเบียดเบียนทั้งตนทั้งผู้อื่น<br />
            กายกรรมนี้เป็นกุศลมีสุขเป็นกำไร มีสุขเป็นวิบากดังนี้ไซร้<br />
            กรรมเห็นปานนั้น เธอพึงทำด้วยกาย<br />
            แม้เมื่อเธอกำลังทำกรรมด้วยกาย เธอก็คือพิจารณากายกรรมนั้นแหละว่า<br />
            เรากำลังทำกรรมใดด้วยกาย กายกรรมของเรานี้<br />
            ย่อมเป็นไปเพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            กายกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากกระมังหนอ<br />
            ถ้าเมื่อเธอพิจารณาอยู่<br />
            พึงรู้อย่างนี้ว่า<br />
            เราทำกรรมใดด้วยกาย กายกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            กายกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากดังนี้ไซร้<br />
            เธอพึงเลิกกายกรรมเห็นปานนั้นเสีย<br />
            แต่ถ้าเธอพิจารณาอยู่พึงรู้อย่างนี้ว่า<br />
            เราทำกรรมใดด้วยกาย กายกรรมของเรานี้ย่อมไม่เป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            กายกรรมนี้เป็นกุศลมีสุขเป็นกำไร มีสุขเป็นวิบากดังนี้ไซร้<br />
            เธอพึงเพิ่มกายกรรมเห็นปานนั้น<br />
            ดูกรราหุล แม้เธอทำกรรมด้วยกายแล้ว<br />
            เธอก็พึงพิจารณากายกรรมนั้นแหละว่า<br />
            เราได้ทำแล้วซึ่งกรรมใดด้วยกาย กายกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            กายกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากกระมังหนอ<br />
            ถ้าเธอพิจารณาอยู่พึงรู้อย่างนี้ว่า<br />
            เราได้ทำแล้วซึ่งกายกรรมใด กายกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            กายกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากดังนี้ไซร้<br />
            กายกรรมเห็นปานนั้น<br />
            เธอพึงแสดงเปิดเผยทำให้ตื้น ในพระศาสนา<br />
            หรือในเพื่อนพรหมจรรย์ทั้งหลายผู้วิญญู แล้วพึงสำรวมต่อไป<br />
            แต่ถ้าเธอพิจารณาอยู่เพิ่งรู้อย่างนี้ว่า<br />
            เราได้ทำแล้วซึ่งกรรมใดด้วยกาย กายกรรมของเรานี้ย่อมไม่เป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            กายกรรมนี้เป็นกุศลมีสุขเป็นกำไร มีสุขเป็นวิบากดังนี้ไซร้<br />
            เธอจึงมีปิติและปราโมทย์ ศึกษาในกุศลธรรมทั้งกลางวันและกลางคืน อยู่ด้วยกายกรรมนั้นแหละ<br /><br />

            ดูกรราหุล<br />
            เธอปรารถนาจะทำกรรมใดด้วยวาจา<br />
            เธอพึงพิจารณาเสียก่อนว่า<br />
            เราปรารถนาจะทำกรรมใดด้วยวาจา วจีกรรมของเรานี้พึงเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            วจีกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากกระมังหนอ<br />
            ถ้าเธอพิจารณาอยู่เพิ่งรู้อย่างนี้ว่า<br />
            เราปรารถนาจะทำกรรมใดด้วยวาจา วจีกรรมของเรานี้พึงเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            วจีกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากดังนี้ไซร้<br />
            วจีกรรมเห็นปานนั้น เธอไม่ควรทำโดยส่วนเดียว<br />
            แต่ถ้าเธอพิจารณาอยู่พึงรู้อย่างนี้ว่า<br />
            เราปรารถนาจะทำกรรมใดด้วยวาจา วจีกรรมของเรานี้ไม่พึงเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            วจีกรรมนี้เป็นกุศลมีสุขเป็นกำไร มีสุขเป็นผลดังนี้ไซร้<br />
            วจีกรรมเห็นปานนั้นเธอควรทำ<br /><br />

            ดุกรราหุล<br />
            แม้เมื่อเธอกำลังทำกรรมด้วยวาจา เธอก็พึงพิจารณาวจีกรรมนั้นแหละว่า<br />
            เราทำอยู่ซึ่งกรรมใดด้วยวาจา วจีกรรมของเรานี้<br />
            ย่อมเป็นไปเพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            วจีกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากกระมังหนอ<br />
            ถ้าเธอพิจารณาอยู่พึงรู้อย่างนี้ว่า<br />
            เราทำอยู่ซึ่งกรรมใดด้วยวาจา วจีกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตน เพื่อเบียดเบียนผู้อื่น และเพื่อเบียดเบียนทั้งตนและผู้อื่น<br />
            วจีกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากดังนี้ไซร้<br />
            เธอจึงเลิกวจีกรรมเห็นปานนั้นเสีย<br />
            แต่ถ้าเธอพิจารณาอยู่<br />
            พึงรู้อย่างนี้ว่า<br />
            เราทำอยู่ซึ่งกรรมใดด้วยวาจา วจีกรรมของเรานี้ย่อมไม่เป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง และเพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            วจีกรรมนี้เป็นกุศลมีสุขเป็นกำไรมีสุขเป็นวิบากดังนี้ไซร้<br />
            เธอพึงเพิ่มวจีกรรมเห็นปานนั้น<br /><br />

            ดูกรราหุล<br />
            แม้เธอทำกรรมด้วยวาจาแล้ว<br />
            เธอก็พึงพิจารณาวจีกรรมนั้นแหละว่า<br />
            เราได้ทำแล้วซึ่งกรรมใดด้วยวาจา วจีกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            วจีกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากกระมังหนอ<br />
            ถ้าเธอพึงพิจารณาอยู่<br />
            พึงรู้อย่างนี้ว่า<br />
            เราได้ทำแล้วซึ่งกรรมใดด้วยวาจา วจีกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            วจีกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากดังนี้ไซร้<br />
            วจีกรรมเห็นปานนั้น เธอพึงแสดงเปิดเผย ทำให้ตื้นในพระศาสนา<br />
            หรือในเพื่อนพรหมจรรย์ทั้งหลายผู้วิญญู ครั้นแล้วพึงสำรวมต่อไป<br />
            แต่ถ้าเธอพิจารณาอยู่พึงรู้อย่างนี้ว่า<br />
            เราได้ทำแล้วซึ่งกรรมใดด้วยวาจา วจีกรรมของเรานี้ย่อมไม่เป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            วจีกรรมนี้เป็นกุศลมีสุขเป็นกำไร มีสุขเป็นวิบากดังนี้ไซร้<br />
            เธอพึงมีปิติและปราโมทย์ ศึกษาในกุศลธรรม<br />
            ทั้งกลางวันและกลางคืน อยู่ด้วยวจีกรรมนั้นแหละ<br /><br />

            ดูกรราหุล<br />
            เธอปรารถนาจะทำกรรมใดด้วยใจ เธอจึงพิจารณามโนกรรมนั้นเสียก่อนว่า<br />
            เราปรารถนาจะทำกรรมใดด้วยใจ มโนกรรมของเรานี้พึงเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            มโนกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากกระมังหนอ<br />
            ถ้าเธอพิจารณาอยู่พึงรู้อย่างนี้ว่า<br />
            เราปรารถนาจะทำกรรมใดด้วยใจ มโนกรรมของเรานี้พึงเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            มโนกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากดังนี้ไซร้<br />
            มโนกรรมเห็นปานนี้ เธอไม่ควรทำโดยส่วนเดียว<br />
            แต่ถ้าเธอพิจารณาอยู่<br />
            พึงรู้อย่างนี้ว่า<br />
            เราปรารถนาจะทำกรรมใดด้วยใจ มโนกรรมของเรานี้ไม่พึงเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            มโนกรรมนี้เป็นกุศลมีสุขเป็นกำไร มีสุขเป็นวิบากดังนี้ไซร้<br />
            กรรมเห็นปานนั้นเธอควรทำ<br /><br />

            ดูกรราหุล<br />
            แม้เมื่อเธอกำลังทำกรรมใดด้วยใจ เธอก็พึงพิจารณามโนกรรมนั้นแหละว่า<br />
            เราทำอยู่ซึ่งกรรมใดด้วยใจ มโนกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            มโนกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากกระมังหนอ<br />
            ถ้าเธอพิจารณาอยู่พึงรู้อย่างนี้ว่า<br />
            เราทำอยู่ซึ่งกรรมใดด้วยใจ มโนกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            มโนกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากดังนี้ไซร้<br />
            เธอพึงเลิกมโนกรรมเห็นปานนั้นเสีย<br />
            แต่ถ้าเธอพิจารณาอยู่ พึงรู้อย่างนี้ว่า<br />
            เราทำอยู่ซึ่งกรรมใดด้วยใจ มโนกรรมของเรานี้ย่อมไม่เป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            มโนกรรมนี้เป็นกุศลมีสุขเป็นกำไร มีสุขเป็นวิบากดังนี้ไซร้<br />
            เธอพึงเพิ่มมโนกรรมเห็นปานนั้น<br /><br />

            ดูกรราหุล<br />
            แม้เธอทำกรรมใดด้วยใจแล้ว เธอก็พึงพิจารณามโนกรรมนั้นแหละว่า<br />
            เราได้ทำกรรมด้วยใดด้วยใจแล้ว มโนกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            มโนกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากกระมังหนอ<br />
            ถ้าเธอพิจารณาอยู่พึงรู้อย่างนี้ว่า<br />
            เราทำได้แล้วซึ่งกรรมใดด้วยใจ มโนกรรมของเรานี้ย่อมเป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            มโนกรรมนี้เป็นอกุศลมีทุกข์เป็นกำไร มีทุกข์เป็นวิบากดังนี้ไซร้<br />
            เธอพึงกระดาก ละอาย เกลียด ในมโนกรรมเห็นปานนั้น<br />
            ครั้นแล้วพึงสำรวมต่อไป<br />
            แต่ถ้าเธอพิจารณาอยู่<br />
            พึงรู้อย่างนี้ว่า<br />
            เราได้ทำแล้วซึ่งกรรมใดด้วยใจ มโนกรรมของเรานี้ย่อมไม่เป็นไป<br />
            เพื่อเบียดเบียนตนบ้าง เพื่อเบียดเบียนผู้อื่นบ้าง เพื่อเบียดเบียนทั้งตนและผู้อื่นบ้าง<br />
            มโนกรรมนี้เป็นกุศลมีสุขเป็นกำไร มีสุขเป็นวิบากดังนี้ไซร้<br />
            เธอพึงมีปิติและปราโมทย์ ศึกษาในกุศลธรรมทั้งหลาย<br />
            ทั้งกลางวันและกลางคืน อยู่ด้วยมโนกรรมนั้นแหละ<br /><br />

            ดูกรราหุล<br />
            สมณะหรือพราหมณ์เหล่าใดเหล่าหนึ่ง ในอดีตกาล<br />
            ได้ชำระกายกรรมวจีกรรมมโนกรรม<br />
            แม้สมณะหรือพราหมณ์ทั้งหมดนั้นพิจารณา <br />
            พิจารณาอย่างนี้นั่นเอง แล้วจึงชำระกายกรรมวจีกรรมมโนกรรม<br />
            แม้สมณะหรือพราหมณ์เหล่าใดเหล่าหนึ่ง ในอนาคตกาล<br />
            จะชำระกายกรรมวจีกรรมมโนกรรม<br />
            สมณะหรือพราหมณ์ทั้งหมดนั้น<br />
            ก็จักพิจารณา พิจารณาอย่างนี้นั่นเอง แล้วจึงชำระกายกรรมวจีกรรมมโนกรรม<br />
            ถึงสมณะหรือพราหมณ์เหล่าใดเหล่าหนึ่ง ในปัจจุบัน<br />
            กำลังชำระกายกรรมวจีกรรมมโนกรรมอยู่<br />
            สมณะหรือพราหมณ์ทั้งหมดนั้นก็พิจารณา<br />
            พิจารณาอย่างนี้นั่นเอง แล้วจึงชำระกายกรรมวจีกรรมมโนกรรม<br />
            เพราะเหตุนั้นแหละราหุล<br />
            เธอเพื่อศึกษาว่าเราจักพิจารณา พิจารณาแล้ว <br />
            จึงชำระกายกรรม วจีกรรม มโนกรรม<br />
            ดูกรราหุลเธอพึงศึกษาอย่างนี้แหละ<br />
            พระผู้มีพระภาคได้ตรัสพระพุทธพจน์นี้แล้ว<br />
            ท่านพระราหุลมีใจยินดีชื่นชมพระภาษิต<br />
            ของพระผู้มีพระภาคดังนี้แล<br /><br /><hr /><br />
            </h4>
            <a href="/fifth/lesson0503">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                มหาราหุโลวาทสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0502;