import React from 'react';

const Lesson0506 = () => {
  return (
    <div>
      <section
        id='hero2'
        className='d-flex'
      >
        <div
          className='container'
          data-aos='fade-up'
        >
          <div className='section-title'>
            <h2>เทศนาสูตร</h2>
          </div>
          <h4>
            เทศนาสูตร
            <br />
            ว่าด้วยปฏิจจสมุปบาท
            <br />
            ข้าพเจ้าได้สดับมาอย่างนี้
            <br />
            สมัยหนึ่งพระผู้มีพระภาค ประทับอยู่ ณ พระวิหารเชตวัน
            <br />
            อารามของท่านอนาถบิณฑิกเศรษฐี เขตพระนครสาวัตถี
            <br />
            ณ ที่นั้นพระผู้มีพระภาค ตรัสเรียกภิกษุทั้งหลายว่า
            <br />
            ดูกรภิกษุทั้งหลาย
            <br />
            ภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคว่า พระพุทธเจ้าข้า
            <br />
            พระผู้มีพระภาคได้ตรัสพระพุทธดำรัสนี้ว่า
            <br />
            <br />
            ดูกรภิกษุทั้งหลาย
            <br />
            เราจักแสดงปฏิจจสมุปบาทแก่พวกเธอ พวกเธอจงฟังปฏิจจสมุปบาทนั้น
            <br />
            จงใส่ใจให้ดีเถิดเราจักกล่าว
            <br />
            ภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคแล้ว
            <br />
            <br />
            พระผู้มีพระภาคได้ตรัสว่า
            <br />
            ดูกรภิกษุทั้งหลาย
            <br />
            ก็ปฏิจจสมุปบาทเป็นไฉน
            <br />
            ดูกรภิกษุทั้งหลาย
            <br />
            เพราะอวิชชาเป็นปัจจัยจึงมีสังขาร
            <br />
            เพราะสังขารเป็นปัจจัยจึงมีวิญญาณ
            <br />
            เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป
            <br />
            เพราะนามรูปเป็นปัจจัยจึงมีสฬายตนะ
            <br />
            เพราะสฬายตนะเป็นปัจจัยจึงมีผัสสะ
            <br />
            เพราะผัสสะเป็นปัจจัยจึงมีเวทนา
            <br />
            เพราะเวทนาเป็นปัจจัยจึงมีตัณหา
            <br />
            เพราะตัณหาเป็นปัจจัยจึงมีอุปาทาน
            <br />
            เพราะอุปาทานเป็นปัจจัยจึงมีภพ
            <br />
            เพราะภพเป็นปัจจัยจึงมีชาติ
            <br />
            เพราะชาติเป็นปัจจัยจึงมีชรา
            <br />
            และมรณะโสกะปริเทวะ
            <br />
            ทุกขโทมนัสและอุปายาส <br />
            ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้
            <br />
            ย่อมมีด้วยประการอย่างนี้
            <br />
            นี้เราเรียกว่าปฏิจจสมุปบาท
            <br />
            <br />
            ก็เพราะอวิชชานั่นแหละ
            <br />
            ดับด้วยการสำรอกโดยไม่เหลือ
            <br />
            สังขารจึงดับ
            <br />
            เพราะสังขารดับวิญญาณจึงดับ
            <br />
            เพราะวิญญาณดับนามรูปจึงดับ
            <br />
            เพราะนามรูปดับสฬายตนะจึงดับ
            <br />
            เพราะสฬายตนะดับผัสสะจึงดับ
            <br />
            เพราะผัสสะดับเวทนาจึงดับ
            <br />
            เพราะเวทนาดับตัณหาจึงดับ
            <br />
            เพราะตัณหาดับอุปาทานจึงดับ
            <br />
            เพราะอุปาทานดับภพจึงดับ
            <br />
            เพราะภพดับชาติจึงดับ
            <br />
            เพราะชาติดับชราและมรณะ
            <br />
            โสกะปริเทวะทุกขโทมนัส
            <br />
            และอุปายาสจึงดับ
            <br />
            ความดับแห่งกองทุกข์ทั้งมวลนี้
            <br />
            ย่อมมีด้วยประการอย่างนี้
            <br />
            พระผู้มีพระภาค
            <br />
            ได้ตรัสพระพุทธภาษิตนี้แล้ว
            <br />
            ภิกษุเหล่านั้นมีใจยินดีชื่นชมภาษิต
            <br />
            ของพระผู้มีพระภาคแล้ว
            <br />
            <br />
            <hr />
            <br />
          </h4>
          <a href='/fifth/lesson0507'>
            <button
              type='button'
              className='btn btn-primary me-5'
            >
              <i className='bi bi-arrow-right-square' /> &nbsp; วิภังคสูตร
            </button>
          </a>
        </div>
      </section>
    </div>
  );
};

export default Lesson0506;
