import React from 'react';

const Lesson0508 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>อาหารสูตร</h2>
          </div>
            <h4>
            อาหารสูตร<br />
            ว่าด้วยอาหาร 4 อย่าง<br />
            ข้าพเจ้าได้สดับมาอย่างนี้<br />
            สมัยหนึ่งพระผู้มีพระภาค ประทับอยู่ ณ พระเชตวัน<br />
            อารามของท่านอนาถบิณฑิกเศรษฐี เขตพระนครสาวัตถี<br /><br />

            พระผู้มีพระภาคได้ตรัสว่า<br />
            ดูกรภิกษุทั้งหลาย<br />
            อาหาร 4 เหล่านี้ย่อมเป็นไป<br />
            เพื่อความดำรงอยู่ของหมู่สัตว์<br />
            ผู้เกิดมาแล้ว<br />
            หรือเพื่ออนุเคราะห์หมู่สัตว์<br />
            ผู้แสวงหาที่เกิด<br /><br />

            อาหาร 4 เป็นไฉน<br />
            คือ 1 กวฬิงการาหารหยาบหรือละเอียด <br />
            2 ผัสสาหาร<br />
            3 มโนสัญเจตนาหาร <br />
            4 วิญญาณาหาร<br />
            อาหาร 4 เหล่านี้แลย่อมเป็นไป<br />
            เพื่อความดำรงอยู่ของหมู่สัตว์<br />
            ผู้เกิดมาแล้ว<br />
            หรือเพื่ออนุเคราะห์หมู่สัตว์<br />
            ผู้แสวงหาที่เกิด<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            ก็อาหาร 4 เหล่านี้มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นที่ตั้งขึ้น<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br />
            อาหาร 4 เหล่านี้มีตัณหาเป็นเหตุ<br />
            มีตัณหาเป็นที่ตั้งขึ้น<br />
            มีตัณหาเป็นกำเนิด<br />
            มีตัณหาเป็นแดนเกิด<br />
            ก็ตัณหานี้มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นที่ตั้งขึ้น<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br /><br />

            ตัณหามีเวทนาเป็นเหตุ<br />
            มีเวทนาเป็นที่ตั้งขึ้น<br />
            มีเวทนาเป็นกำเนิด<br />
            มีเวทนาเป็นแดนเกิด<br />
            ก็เวทนานี้มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นที่ตั้งขึ้น<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br /><br />

            เวทนามีผัสสะเป็นเหตุ<br />
            มีผัสสะเป็นที่ตั้งขึ้น<br />
            มีผัสสะเป็นกำเนิด<br />
            มีผัสสะเป็นแดนเกิด<br /><br />
            
            ก็ผัสสะนี้มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นที่ตั้งขึ้น<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br />
            ผัสสะมีสฬายตนะเป็นเหตุ<br />
            มีสฬายตนะเป็นที่ตั้งขึ้น<br />
            มีสฬายตนะเป็นกำเนิด<br />
            มีสฬายตนะเป็นแดนเกิด<br /><br />

            ก็สฬายตนะนี้มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นที่ตั้งขึ้น<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br />
            สฬายตนะมีนามรูปเป็นเหตุ<br />
            มีนามรูปเป็นที่ตั้งขึ้น<br />
            มีนามรูปเป็นกำเนิด<br />
            มีนามรูปเป็นแดนเกิด<br /><br />

            ก็นามรูปนี้มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นที่ตั้งขึ้น<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br />
            นามรูปมีวิญญาณเป็นเหตุ<br />
            มีวิญญาณเป็นที่ตั้งขึ้น<br />
            มีวิญญาณเป็นกำเนิด<br />
            มีวิญญาณเป็นแดนเกิด<br /><br />

            ก็วิญญาณนี้มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นที่ตั้งขึ้น<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br />
            วิญญาณมีสังขารเป็นเหตุ<br />
            มีสังขารเป็นที่ตั้งขึ้น<br />
            มีสังขารเป็นกำเนิด<br />
            มีสังขารเป็นแดนเกิด<br /><br />

            ก็สังขารเหล่านี้ มีอะไรเป็นเหตุ<br />
            มีอะไรเป็นที่ตั้งขึ้น<br />
            มีอะไรเป็นกำเนิด<br />
            มีอะไรเป็นแดนเกิด<br />
            สังขารทั้งหลายมีอวิชชาเป็นเหตุ<br />
            มีอวิชชาเป็นที่ตั้งขึ้น<br />
            มีอวิชาเป็นกำเนิด<br />
            มีวิชาเป็นแดนเกิด<br />
            ดูกรภิกษุทั้งหลาย<br />
            เพราะอวิชชาเป็นปัจจัยจึงมีสังขาร<br />
            เพราะสังขารเป็นปัจจัยจึงมีวิญญาณ<br />
            ดังพรรณนามาฉะนี้<br />
            ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้<br />
            ย่อมมีด้วยประการอย่างนี้<br />
            ก็เพราะอวิชชานั่นแหละดับ<br />
            ด้วยการสำรอกโดยไม่เหลือ สังขารจึงดับ<br />
            เพราะสังขารดับวิญญาณจึงดับ<br />
            ความดับแห่งกองทุกข์ทั้งมวลนี้<br />
            ย่อมมีด้วยประการอย่างนี้<br /><br /><hr /><br />
            </h4>
            <a href="/fifth/lesson0509">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ติมพรุกขสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0508;