import React from 'react';

const Lesson0511 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>สัมมสนสูตรที่ 2</h2>
          </div>
            <h4>
            สัมมสนสูตรที่ 2<br />
            ว่าด้วยปัจจัยให้ชราและมรณะ<br />
            สมัยหนึ่งท่านพระสารีบุตร และท่านพระมหาโกฏฐิตะ<br />
            อยู่ ณ ป่าอิสิปตนมฤคทายวัน เขตพระนครพาราณสี<br />
            ครั้งนั้นแลเป็นเวลาเย็น<br />
            ท่านพระมหาโกฏฐิตะ ออกจากที่พักผ่อน<br />
            เข้าไปหาพระสารีบุตรถึงที่อยู่ ได้ปราศรัยกับท่านพระสารีบุตร<br />
            ครั้นผ่านการปราศรัย พอให้ระลึกถึงกันไปแล้ว<br />
            จึงนั่ง ณ ที่ควรส่วนข้างหนึ่ง<br />
            ท่านพระมหาโกฏฐิตะ นั่งเรียบร้อยแล้ว<br />
            ได้กล่าวคำนี้กะท่านพระสารีบุตรว่า<br />
            ท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า<br />
            ชราและมรณะตนทำเอง ผู้อื่นทำให้ <br />
            ทั้งตนทำเองทั้งผู้อื่นทำให้ หรือว่าชราและมรณะบังเกิดขึ้น<br />
            เพราะอาศัยตนไม่ได้ทำเอง ผู้อื่นไม่ได้ทำให้<br /><br />

            ท่านพระสารีบุตรกล่าวตอบว่า<br />
            ท่านโกลิตะชราและมรณะ ตนทำเองก็ไม่ใช่<br />
            ผู้อื่นทำให้ก็ไม่ใช่ ทั้งต้นทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่<br />
            บังเกิดขึ้น เพราะอาศัยตนไม่ได้ทำเอง<br />
            ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่ แต่ว่าเพราะชาติเป็นปัจจัย<br />
            จึงมีชราและมรณะ ท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า<br />
            ท่านสารีบุตรชาติตนทำเอง ผู้อื่นทำให้ ทั้งต้นทำเองทั้งผู้อื่นทำให้<br />
            หรือว่าชาติบังเกิดขึ้น เพราะอาศัยตนไม่ได้ทำเอง ผู้อื่นไม่ได้ทำให้<br /><br />

            ท่านพระสารีบุตรกล่าวตอบว่า<br />
            ท่านโกลิตะชาติตนทำเองก็ไม่ใช่ ผู้อื่นทำให้ก็ไม่ใช่<br />
            ทั้งตนทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่ ชาติบังเกิดขึ้น<br />
            เพราะอาศัยตนไม่ได้ทำเอง ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่<br />
            แต่เพราะภพเป็นปัจจัยจึงมีชาติ<br />
            ท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า<br />
            ท่านสารีบุตรภพตนทำเอง อุปทานตนทำเอง<br />
            ตัณหาตนทำเอง เวทนาตนทำเอง<br />
            ผัสสะตนทำเองทำเอง นามรูปตนทำเอง ผู้อื่นทำให้<br />
            ทั้งตนทำเองทั้งผู้อื่นทำให้ หรือว่านามรูปบังเกิดขึ้น<br />
            เพราะอาศัยตนไม่ได้ทำเอง ผู้อื่นไม่ได้ทำให้<br /><br />

            ท่านพระสารีบุตรกล่าวตอบว่าท่านโกฏฐิตะ<br />
            นามรูปตนทำเองก็ไม่ใช่<br />
            ผู้อื่นทำให้ก็ไม่ใช่<br />
            ทั้งต้นทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่<br />
            นามรูปบังเกิดขึ้น<br />
            เพราะอาศัยตนไม่ได้ทำเอง<br />
            ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่<br />
            แต่เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป<br />
            ท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า<br />
            ท่านสารีบุตรวิญญาณตนทำเอง ผู้อื่นทำให้<br />
            ทั้งตนทำเอง ทั้งผู้อื่นทำให้ หรือว่าวิญญาณบังเกิดขึ้น<br />
            เพราะอาศัยตนไม่ได้ทำเอง ผู้อื่นไม่ได้ทำให้<br />
            ท่านพระสารีบุตรกล่าวตอบว่าท่านโกฏฐิตะ<br />
            วิญญาณตนทำเองก็ไม่ใช่ ผู้อื่นทำให้ก็ไม่ใช่ ทั้งตนเองและผู้อื่นทำให้ก็ไม่ใช่<br />
            วิญญาณบังเกิดขึ้น เพราะอาศัยตนไม่ได้ทำเอง ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่<br />
            แต่เพราะนามรูปเป็นปัจจัยจึงมีวิญญาณ<br />
            เราทั้งหลายเพิ่งรู้ชัดภาษิต ของท่านสารีบุตรในบัดนี้เอง<br />
            อย่างนี้ว่าท่านโกฏฐิตะ<br />
            นามรูปตนทำเองก็ไม่ใช่ ผู้อื่นทำให้ก็ไม่ใช่<br />
            ทั้งตนทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่<br />
            บังเกิดขึ้น เพราะอาศัยตนไม่ได้ทำเอง ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่<br />
            แต่เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป<br />
            อนึ่งเราทั้งหลายรู้ชัดภาษิต ของท่านพระสารีบุตรในบัดนี้เอง<br />
            อย่างนี้ว่าท่านโกฏฐิตะ<br />
            วิญญาณตนทำเองก็ไม่ใช่ ผู้อื่นก็ทำให้ก็ไม่ใช่<br />
            บังเกิดขึ้นเพราะ อาศัยตนไม่ได้ทำเอง ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่<br />
            แต่เพราะนามรูปเป็นปัจจัย จึงมีวิญญาณ<br /><br />

            ท่านสารีบุตรก็เนื้อความของภาษิตนี้<br />
            เราทั้งหลายจะพึงเห็นได้อย่างไร<br />
            ดูกรอาวุโสถ้าเช่นนั้น<br />
            ผมจะเปรียบให้ท่านฟัง ในโลกนี้บุรุษผู้ฉลาดบางพวก<br />
            ย่อมรู้ชัดเนื้อความของภาษิต ได้แม้ด้วยอุปมา<br />
            อาวุโสไม้อ้อ 2 กำพึงตั้งอยู่ได้<br />
            เพราะต่างอาศัยซึ่งกันและกันฉันใด<br />
            เพราะนามรูปเป็นปัจจัยจึงมีวิญญาณ<br />
            เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป<br />
            ท่อนามรูปเป็นปัจจัยจึงมีสฬายตนะ<br />
            สฬายตนะเป็นปัจจัยจึงมีผัสสะ<br />
            ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้<br />
            ย่อมมีด้วยประการอย่างนี้ฉันนั้นแล',
            ถ้าไม้อ้อ 2 กำนั้นพึงเอาออกเสียกำหนึ่ง<br />
            อีกคำหนึ่งก็ล้มไป<br />
            ถ้าดึงอีกกำหนึ่งออก<br />
            อีกคำหนึ่งก็ล้มไปฉันใด<br />
            เพราะนามรูปดับวิญญาณจึงดับ<br />
            เพราะวิญญาณดับนามรูปจึงดับ<br />
            เพราะนามรูปดับสฬายตนะจึงดับ<br />
            เพราะสฬายตนะดับผัสสะจึงดับ<br />
            ความดับแห่งกองทุกข์ทั้งมวลนี้<br />
            ย่อมมีด้วยประการอย่างนี้ฉันนั้นแล<br />
            น่าอัศจรรย์ท่านสารีบุตรไม่เคยมีมา<br />
            ท่านสารีบุตรเท่าที่ท่านสารีบุตรกล่าวนี้<br />
            เป็นอันกล่าวดีแล้ว<br />
            ก็แลเราทั้งหลายพลอยยินดีสุภาษิตนี้ ของท่านสารีบุตร<br />
            ด้วยเรื่อง 36 เรื่องเหล่านี้<br />
            ถ้าภิกษุแสดงธรรมเพื่อความหน่าย เพื่อคลายกำหนัด<br />
            เพื่อดับชราและมรณะ ควรจะกล่าวว่าภิกษุธรรมกถึก<br />
            ถ้าภิกษุปฏิบัติเพื่อความหน่าย เพื่อคลายกำหนัด<br />
            เพื่อดับชราและมรณะ ควรจะกล่าวว่า ภิกษุปฏิบัติธรรมสมควรแก่ธรรม<br />
            ถ้าภิกษุหลุดพ้นเพราะความหน่าย เพราะคลายกำหนัด<br />
            เพราะความดับ เพราะไม่ถือมั่นชราและมรณะ<br />
            ควรจะกล่าวว่า ภิกษุบรรลุนิพพานในปัจจุบัน<br /><br />

            ถ้าภิกษุแสดงธรรมเพื่อความหน่าย เพื่อคลายกำหนัด<br />
            เพื่อดับชาติ ภพ อุปาทาน ตัณหา เวทนา ผัสสะ <br />
            สฬายตนะ นามรูป วิญญาณ สังขารทั้งหลาย อวิชชา<br />
            ควรจะกลับว่าภิกษุธรรมกถึก<br />
            ถ้าภิกษุปฏิบัติเพื่อความหน่าย เพื่อคลายกำหนัด เพื่อดับอวิชชา<br />
            ควรจะกล่าวว่า ภิกษุปฏิบัติธรรมสมควรแก่ธรรม<br />
            ถ้าภิกษุหลุดพ้น เพราะความหน่าย เพราะคลายกำหนัด<br />
            เพราะความดับ เพราะความไม่ถือมั่นในอวิชชา<br />
            ควรจะกล่าวว่าภิกษุบรรลุนิพพานในปัจจุบัน<br /><br /><hr /><br />
            </h4>
            <a href="/fifth/lesson0512">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                อนาคตสูตรที่ 2
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0511;