import React from 'react';

const Lesson0507 = () => {
  return (
    <div>
      <section
        id='hero2'
        className='d-flex'
      >
        <div
          className='container'
          data-aos='fade-up'
        >
          <div className='section-title'>
            <h2>วิภังคสูตร</h2>
          </div>
          <h4>
            วิภังคสูตร
            <br />
            ว่าด้วยจำแนกปฏิจจสมุปบาท
            <br />
            พระผู้มีพระภาคประทับอยู่ ณ พระวิหารเชตวัน
            <br />
            อารามของท่านอนาถบิณฑิกเศรษฐี เขตพระนครสาวัตถี
            <br />
            พระผู้มีพระภาคได้ตรัสว่า
            <br />
            ดูกรภิกษุทั้งหลาย
            <br />
            เราจักแสดงจักจำแนกปฏิจจสมุปบาทแก่พวกเธอ
            <br />
            พวกเธอจงฟังปฏิจจสมุปบาทนั้น จงใส่ใจให้ดีเถิดเราจักกล่าว
            <br />
            ภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคแล้ว
            <br />
            <br />
            พระผู้มีพระภาคได้ตรัสว่า
            <br />
            ดูกรภิกษุทั้งหลาย
            <br />
            ก็ปฏิจจสมุปบาทเป็นไฉน
            <br />
            ดูกรภิกษุทั้งหลาย
            <br />
            เพราะอวิชชาเป็นปัจจัยจึงมีสังขาร
            <br />
            เพราะสังขารเป็นปัจจัยจึงมีวิญญาณ
            <br />
            เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป
            <br />
            เพราะนามรูปเป็นปัจจัยจึงมีสฬายตนะ
            <br />
            เพราะสฬายตนะเป็นปัจจัยจึงมีผัสสะ
            <br />
            เพราะผัสสะเป็นปัจจัยจึงมีเวทนา
            <br />
            เพราะเวทนาเป็นปัจจัยจึงมีตัณหา
            <br />
            เพราะตัณหาเป็นปัจจัยจึงมีอุปาทาน
            <br />
            เพราะอุปาทานเป็นปัจจัยจึงมีภพ
            <br />
            เพราะภพเป็นปัจจัยจึงมีชาติ
            <br />
            เพราะชาติเป็นปัจจัยจึงมีชรา
            <br />
            และมรณะโสกะปริเทวะ
            <br />
            ทุกข์โทมนัสและอุปายาส
            <br />
            ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้
            <br />
            ย่อมมีด้วยประการอย่างนี้
            <br />
            <br />
            ดูกรภิกษุทั้งหลาย
            <br />
            ก็ชราและมรณะเป็นไฉน
            <br />
            ความแก่ ภาวะของความแก่
            <br />
            ฟันหลุด ผมหงอก หนังเป็นเกลียว
            <br />
            ความเสื่อมแห่งอายุ <br />
            ความแก่หง่อมแห่งอินทรีย์
            <br />
            ในหมู่สัตว์นั้นๆของเหล่าสัตว์นั้นๆ
            <br />
            นี้เรียกว่าชรา
            <br />
            <br />
            ก็มรณะเป็นไฉน
            <br />
            ความเคลื่อนภาวะของความเคลื่อน
            <br />
            ความทำลายความอันตรธานมฤตยู
            <br />
            ความตาย กาลกิริยา
            <br />
            ความแตกแห่งขันธ์
            <br />
            ความทอดทิ้งซากศพ
            <br />
            ความขาดแห่งชีวิตินทรีย์
            <br />
            จากนั้นของเหล่าสัตว์นั้นๆ
            <br />
            นี้เรียกว่ามรณะ
            <br />
            ชราและมรณะดังพรรณนามาฉะนี้
            <br />
            เรียกว่าชราและมรณะ
            <br />
            <br />
            ก็ชาติเป็นไฉน
            <br />
            ความเกิดความบังเกิด
            <br />
            ความหยั่งลง
            <br />
            เกิด
            <br />
            เกิดจำเพาะ
            <br />
            ความปรากฏแห่งขันธ์
            <br />
            ความได้อายตนะครบในหมู่สัตว์นั้นๆ
            <br />
            ของเหล่าสัตว์นั้นๆ
            <br />
            นี้เรียกว่าชาติ
            <br />
            <br />
            ก็ภพเป็นไฉน
            <br />
            ภพ 3 เหล่านี้คือ
            <br />
            กามภพ รูปภพ อรูปภพ
            <br />
            นี้เรียกว่าภพ
            <br />
            <br />
            ก็อุปาทานเป็นไฉน
            <br />
            อุปาทาน 4 เหล่านี้
            <br />
            คือกามุปาทาน
            <br />
            ทิฏฐุปาทาน
            <br />
            สีลพัตตุปาทาน
            <br />
            อัตตวาทุปาทาน
            <br />
            นี้เรียกว่าอุปาทาน
            <br />
            <br />
            ก็ตัณหาเป็นไฉน
            <br />
            ตัณหา 6 หมวดเหล่านี้คือ
            <br />
            รูปตัณหา สัททตัณหา
            <br />
            คันธตัณหา รสตัณหา
            <br />
            โผฏฐัพพะตัณหา ธัมมตัณหา
            <br />
            นี้เรียกว่าตัณหา
            <br />
            <br />
            ก็เวทนาเป็นไฉน
            <br />
            เวทนา 6 หมวดเหล่านี้คือ
            <br />
            จักขุสัมผัสสชาเวทนา
            <br />
            โสตสัมผัสสชาเวทนา
            <br />
            ฆานสัมมผัสสชาเวทนา
            <br />
            ชิวหาสัมผัสสชาเวทนา
            <br />
            กายสัมผัสสชาเวทนา
            <br />
            มโนสัมผัสสชาเวทนา
            <br />
            นี้เรียกว่าเวทนา
            <br />
            <br />
            ก็ผัสสะเป็นไฉน
            <br />
            ผัสสะ 6 หมวดเหล่านี้คือ
            <br />
            จักขุสัมผัส
            <br />
            โสตะสัมผัส
            <br />
            ฆานสัมผัส
            <br />
            ชิวหาสัมผัส
            <br />
            กายสัมผัส
            <br />
            มโนสัมผัส
            <br />
            นี้เรียกว่าผัสสะ
            <br />
            <br />
            ก็สฬายตนะเป็นไฉน
            <br />
            สฬายตนะคือ
            <br />
            ตา หู จมูก
            <br />
            ลิ้น กาย ใจ
            <br />
            นี้เรียกว่าสฬายตนะ
            <br />
            <br />
            ก็นามรูปเป็นไฉน
            <br />
            เวทนา สัญญา เจตนา
            <br />
            ผัสสะ มนสิการ
            <br />
            นี้เรียกว่านาม
            <br />
            มหาภูตรูป 4<br />
            และรูปที่อาศัยมหาภูตรูป 4<br />
            นี้เรียกว่ารูป
            <br />
            นามและรูปดังพรรณนามาฉะนี้
            <br />
            เรียกว่านามรูป
            <br />
            <br />
            ก็วิญญาณเป็นไฉน
            <br />
            วิญญาณ 6 หมวดเหล่านี้คือ
            <br />
            จักขุวิญญาณ
            <br />
            โสตะวิญญาณ
            <br />
            ฆานวิญญาณ
            <br />
            ชิวหาวิญญาณ
            <br />
            กายวิญญาณ
            <br />
            มโนวิญญาณ
            <br />
            นี้เรียกว่าวิญญาณ
            <br />
            <br />
            ก็สังขารเป็นไฉน
            <br />
            สังขาร 3 เหล่านี้คือ
            <br />
            กายสังขาร
            <br />
            วจีสังขาร
            <br />
            จิตสังขาร
            <br />
            นี้เรียกว่าสังขาร
            <br />
            ก็อวิชชาเป็นไฉน
            <br />
            ความไม่รู้ในทุกข์
            <br />
            ความไม่รู้ในเหตุเกิดแห่งทุกข์
            <br />
            ความไม่รู้ในความดับทุกข์
            <br />
            ความไม่รู้ในปฏิปทา
            <br />
            ที่จะให้ถึงความดับทุกข์
            <br />
            นี้เรียกว่าอวิชา
            <br />
            <br />
            ดูกรภิกษุทั้งหลาย
            <br />
            เพราะอวิชชาเป็นปัจจัยจึงมีสังขาร
            <br />
            เพราะสังขารเป็นปัจจัยจึงมีวิญญาณ
            <br />
            ดังพรรณนามาฉะนี้
            <br />
            ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้
            <br />
            ย่อมมีด้วยประการอย่างนี้
            <br />
            ก็เพราะอวิชชานั่นแหละ
            <br />
            ดับด้วยการสำรอกโดยไม่เหลือ
            <br />
            สังขารจึงดับ
            <br />
            เพราะสังขารดับวิญญาณจึงดับ
            <br />
            ความดับแห่งกองทุกข์ทั้งมวลนี้
            <br />
            ย่อมมีด้วยประการอย่างนี้
            <br />
            <br />
            <hr />
            <br />
          </h4>
          <a href='/fifth/lesson0508'>
            <button
              type='button'
              className='btn btn-primary me-5'
            >
              <i className='bi bi-arrow-right-square' /> &nbsp; อาหารสูตร
            </button>
          </a>
        </div>
      </section>
    </div>
  );
};

export default Lesson0507;
