import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0504 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ภาวนาเสมอด้วยธาตุ 5^500\nดูกรราหุล^500\nเธอจงเจริญภาวนา^500\nเสมอด้วยแผ่นดินเถิด^500\nเพราะเมื่อเธอเจริญภาวนา^500\nเสมอด้วยแผ่นดินอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้^500\nดูกรราหุล^500\nเปรียบเหมือนคนทั้งหลาย^500\nทิ้งของสะอาดบ้างไม่สะอาดบ้าง^500\nคูถบ้าง มูตรบ้าง^500\nน้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง^500\nลงที่แผ่นดิน แผ่นดินจะอึดอัด^500\nหรือระอาหรือเกลียดของนั้นก็หาไม่ฉันใด^500\nเธอจงเจริญภาวนา^500\nเสมอด้วยแผ่นดินฉันนั้นแล^500\nเพราะเมื่อเธอเจริญภาวนา^500\nเสมอด้วยแผ่นดินอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'ดูกรราหุล^500\nเธอจงเจริญภาวนาเสมอด้วยน้ำเถิด^500\nเพราะเมื่อเธอเจริญภาวนา^500\nเสมอด้วยน้ำอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้^500\nดูกรราหุล^500\nเปรียบเหมือนคนทั้งหลาย^500\nล้างของสะอาดบ้างของไม่สะอาดบ้าง^500\nคูถบ้าง มูตรบ้าน^500\nน้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง^500\nลงในน้ำ น้ำจะอึดอัดหรือระอา^500\nหรือเกลียดของนั้นก็หาไม่ฉันใด^500\nเธอจงเจริญภาวนา^500\nเสมอด้วยน้ำฉันนั้นแล^500\nเพราะเมื่อเธอเจริญภาวนา^500\nเสมอด้วยน้ำอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'ดูกรราหุล^500\nเธอจงเจริญภาวนาเสมอด้วยไฟเถิด^500\nเพราะเมื่อเธอเจริญภาวนาเสมอด้วยไฟอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจะไม่ครอบงำจิตได้^500\nลูกรราหุล^500\nเปรียบเหมือนไฟ^500\nที่เผาของสะอาดบ้านของไม่สะอาดบ้าง^500\nคูถบ้าง มูตรบ้าง^500\nน้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง^500\nไฟจะอึดอัดหรือระอา^500\nหรือเกลียดของนั้นก็หาไม่ฉันใด^500\nเธอจงเจริญภาวนา^500\nเสมอด้วยไฟฉันนั้นแล^500\nเพราะเมื่อเธอเจริญภาวนา^500\nเสมอด้วยไฟอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'ดูกรราหุล^500\nเธอจงเจริญภาวนาเสมอด้วยลมเถิด^500\nเพราะเมื่อเธอเจริญภาวนาเสมอด้วยลมอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตของเธอได้^500\nดูกรราหุล^500\nเปรียบเหมือนลมย่อมพัดต้อง^500\nของสะอาดบ้างของไม่สะอาดบ้าง^500\nคูถบ้าง มูตรบ้าง^500\nน้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง^500\nลมจะอึดอัดหรือระอา^500\nหรือเกลียดของนั้นก็หาไม่ฉันใด^500\nเธอจงเจริญภาวนา^500\nเสมอด้วยลมฉันนั้น^500\nก็เมื่อเธอเจริญภาวนา^500\nเสมอด้วยลมอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'ดูกรราหุล^500\nเธอจงเจริญภาวนาเสมอด้วยอากาศเถิด^500\nเพราะเมื่อเธอเจริญภาวนา^500\nเสมอด้วยอากาศอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้^500\nดูกรราหุล^500\nเปรียบเหมือนอากาศ^500\nไม่ตั้งอยู่ในที่ไหนฉันใด^500\nเธอจงเจริญภาวนา^500\nเสมอด้วยอากาศฉันนั้นแล^500\nเพราะเมื่อเธอเจริญภาวนา^500\nเสมอด้วยอากาศอยู่^500\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ^500\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'การเจริญภาวนาธรรม 6 อย่าง^500\nดูกรราหุล^500\nเธอจงเจริญเมตตาภาวนาเถิด^500\nเพราะเมื่อเธอเจริญเมตตาภาวนาอยู่^500\nจักละพยาบาทได้^500\nเธอจงเจริญกรุณาภาวนาเถิด^500\nเพราะเมื่อเธอเจริญกรุณาภาวนาอยู่^500\nจักละวิหิงสาได้^500\nเธอจงเจริญมุทิตาภาวนาเถิด^500\nเพราะเมื่อเธอเจริญมุทิตาภาวนาอยู่^500\nจักละอรติได้^500\nเธอจงเจริญอุเบกขาภาวนาเถิด^500\nก็เมื่อเธอเจริญอุเบกขาภาวนาอยู่^500\nจักละปฏิฆะได้^500\nเธอจงเจริญอสุภภาวนาเถิด^500\nเพราะเมื่อเธอเจริญอสุภภาวนาอยู่^500\nจักละราคาได้^500\nเธอจงเจริญอนิจจสัญญาภาวนาเถิด^500\nเพราะเมื่อเธอเจริญอนิจจสัญญาภาวนาอยู่^500\nจักละอัสมิมานะได้'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i className="bi bi-x-lg" />
            </button>
            <a href="/lesson0505">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" />
              </button>
            </a>
            <h2 style={{display: 'inline-block'}}>ภาวนาเสมอด้วยธาตุ 5</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0504;