import React from 'react';

const Lesson0503 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>มหาราหุโลวาทสูตร</h2>
          </div>
            <h4>
            มหาราหุโลวาทสูตร<br />
            เรื่องพระราหุล<br />
            ข้าพเจ้าได้สดับมาอย่างนี้ สมัยหนึ่งพระผู้มีพระภาค<br />
            ประทับอยู่ ณ พระวิหารเชตวัน อารามของท่านอนาถบิณฑิกเศรษฐี เขตพระนครสาวัตถี<br />
            ครั้งนั้นเวลาเช้า พระผู้มีพระภาค ครองอันตรวาสก แล้วถือบาตรและจีวร<br />
            เสด็จเข้าไปบิณฑบาต ยังนครสาวัตถีเวลาเช้า<br />
            แม้ท่านพระราหุล ก็ครองอันตรวาสก แล้วถือบาตรและจีวร ตามพระผู้มีพระภาคไป<br />
            ณ เบื้องพระปฤษฎางค์<br />
            ครั้งนั้นพระผู้มีพระภาค ทรงผินพระพักตร์ ไปรับสั่งกะท่านพระราหุลว่า<br /><br />

            ดูกรราหุล<br />
            รูปอย่างใดอย่างหนึ่ง ที่เป็นอดีตเป็นอนาคต และเป็นปัจจุบัน<br />
            เป็นภายในก็ดีเป็นภายนอกก็ดี หยาบก็ดีละเอียดก็ดี เลวก็ดีประณีตก็ดี อยู่ในที่ไกลก็ดีอยู่ในที่ใกล้ก็ดี<br />
            รูปทั้งปวงนี้เธอพึงเห็นด้วยปัญญา อันชอบตามเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา เราไม่เป็นนั่น นั่นไม่ใช่ตัวตนของเราดังนี้<br /><br />

            พระราหุลทูลถามว่า<br />
            ข้าแต่พระผู้มีพระภาค รูปเท่านั้นหรือ ข้าแต่พระสุคตรูปเท่านั้นหรือ<br />
            พระพุทธเจ้าตรัสตอบว่า<br />
            ดูกรราหุลทั้งรูป ทั้งเวทนา ทั้งสัญญา ทั้งสังขาร ทั้งวิญญาณ<br />
            ครั้งนั้นท่านพระราหุลคิดว่า วันนี้ใครหนออันพระผู้มีพระภาค ทรงโอวาทด้วย<br />
            โอวาทในที่เฉพาะพระพักตร์ แล้วจักเข้าบ้านเพื่อบิณฑบาตเล่า<br />
            ดังนี้แล้วกลับจากที่นั้นแล้ว นั่งคู้บัลลังก์ตั้งกายตรง<br />
            ดำรงสติไว้เฉพาะหน้า ณ โคนต้นไม้แห่งหนึ่ง<br />
            ท่านพระสารีบุตรได้เห็นท่านพระราหุล <br />
            ดำรงสติไว้เฉพาะหน้า ณ โคนต้นไม้แห่งหนึ่ง<br />
            แล้วบอกกะท่านพระราหุลว่า<br /><br />

            ดูกรราหุล<br />
            ท่านจงเจริญอานาปานสติเถิด<br />
            ด้วยว่าอานาปานสติภาวนา ที่บุคคลเจริญแล้วทำให้มากแล้ว ย่อมมีผลมากมีอานิสงส์มาก<br />
            ดังนั้นเวลาเย็น ท่านพระราหุลออกจากที่เร้น แล้วเข้าไปเฝ้าพระผู้มีพระภาค<br />
            ถึงที่ประทับถวายบังคมพระผู้มีพระภาค แล้วนั่ง ณ ที่ควรส่วนข้างหนึ่ง<br />
            แล้วได้ทูลพระผู้มีพระภาคว่า ข้าแต่พระองค์ผู้เจริญอานาปานสติ<br />
            อันบุคคลเจริญแล้วอย่างไร ทำให้มากแล้วอย่างไร จึงจะมีผลมีอานิสงส์<br /><br /><hr /><br />
            </h4>
            <h3>ธาตุ 5</h3>
            <h4>
            ดูกรราหุล<br />
            รูปอย่างใดอย่างหนึ่ง เป็นภายในอาศัยตน เป็นของหยาบมีลักษณะแข้นแข็ง<br />
            อันกรรมและกิเลสเข้าไปยึดมั่น คือ ผม ขน เล็บ ฟัน หนัง<br />
            เนื้อ เอ็น กระดูก เยื่อในกระดูก ม้าม หัวใจ<br />
            ตับ พังผืด ไต ปอด ไส้ใหญ่ ไส้น้อย อาหารใหม่ อาหารเก่า<br />
            หรือสิ่งใดสิ่งหนึ่งอย่างอื่น เป็นภายในอาศัยตน เป็นของหยาบมีลักษณะแข้นแข็ง<br />
            อันกรรมและกิเลสเข้าไปยึดมั่น นี้เราเรียกว่าปฐวีธาตุเป็นภายใน<br />
            ก็ปฐวีธาตุเป็นภายในก็ดี เป็นภายนอกก็ดี<br />
            อันใดปฐวีธาตุนั้น เป็นปฐวีธาตุเหมือนกัน<br />
            ปฐวีธาตุนั้นเธอพึงเห็นด้วยปัญญา อันชอบตามเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา เราไม่เป็นนั่น นั่นไม่ใช่ตนของเราดังนี้<br />
            เพราะบุคคลเห็นปฐวีธาตุนั้น ด้วยปัญญาอันชอบ ตามเป็นจริงอย่างนี้แล้ว<br />
            ย่อมเบื่อหน่ายในปฐวีธาตุ จิตย่อมคลายกำหนัดในปฐวีธาตุ<br /><br />

            ดูกรราหุลก็อาโปธาตุเป็นไฉน อาโปธาตุเป็นภายในก็มี เป็นภายนอกก็มี<br />
            ก็อาโปธาตุที่เป็นภายในเป็นไฉน สิ่งใดเป็นภายในอาศัยตน<br />
            เป็นอาโปมีลักษณะเอิบอาบ อันกรรมและกิเลสเข้าไปยึดมั่น<br />
            คือ ดี เสลด หนอง เลือด เหงื่อ มันข้น น้ำตา เปลวมัน น้ำลาย<br />
            น้ำมูก ไขข้อ มูตร หรือสิ่งใดสิ่งหนึ่งอย่างอื่น เป็นภายในอาศัยตน<br />
            เป็นอาโปมีลักษณะเอิบอาบ อันกรรมและกิเลสเข้าไปยึดมั่น<br />
            นี้เราเรียกว่าอาโปธาตุเป็นภายใน<br />
            ก็อาโปธาตุเป็นภายในก็ดี เป็นภายนอกก็ดี<br />
            อันใดอาโปธาตุนั้น เป็นอาโปธาตุเหมือนกัน<br />
            อาโปธาตุนั้นเธอพึงเห็นด้วยปัญญา<br />
            อันชอบตามเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา เราไม่เป็นนั่น นั่นไม่ใช่ตนของเราดังนี้<br />
            เพราะบุคคลเห็นอาโปธาตุนั้น ด้วยปัญญาอันชอบ ตามเป็นจริงอย่างนี้แล้ว<br />
            ย่อมเบื่อหน่ายในอาโปธาตุ จิตย่อมคลายกำหนัดในอาโปธาตุ<br /><br />

            ดูกรราหุล<br />
            ก็เตโชธาตุเป็นไฉน เตโชธาตุเป็นภายในก็มี เป็นภายนอกก็มี<br />
            ก็เตโชธาตุที่เป็นภายในเป็นไฉน สิ่งใดเป็นภายในอาศัยตน<br />
            เป็นเตโชมีลักษณะร้อน อันกรรมและกิเลสเข้าไปยึดมั่น<br />
            คือไฟที่ยังกายให้อบอุ่น ไฟที่ยังกายให้ทรุดโทรม<br />
            ไฟที่ยังกายให้กระวนกระวาย และไฟที่เผาอาหาร<br />
            ที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม ให้ย่อยไปโดยชอบ<br />
            หรือสิ่งใดสิ่งหนึ่งอย่างอื่น เป็นภายในอาศัยตน<br />
            เป็นเตโชมีลักษณะร้อน อันกรรมและกิเลสเข้าไปยึดมั่น<br />
            นี้เราเรียกว่าเตโชธาตุเป็นภายใน<br />
            ก็เตโชธาตุเป็นภายในก็ดี เป็นภายนอกก็ดี<br />
            อันใดเตโชธาตุนั้น เป็นเตโชธาตุเหมือนกัน<br />
            เตโชธาตุนั้นเธอพึงเห็นด้วยปัญญา<br />
            อันชอบตามเป็นจริงวันนี้ว่า<br />
            นั่นไม่ใช่ของเรา เราไม่เป็นนั่น นั่นไม่ใช่ตัวตนของเราดังนี้<br />
            เพราะบุคคล เห็นเตโชธาตุนั้นด้วยปัญญา อันชอบตามเป็นจริงอย่างนี้แล้ว<br />
            ย่อมเบื่อหน่ายในเตโชธาตุ จิตย่อมคลายกำหนัดในเตโชธาตุ<br /><br />

            ดูกรราหุล<br />
            วาโยธาตุเป็นไฉน วาโยธาตุเป็นภายในก็มี เป็นภายนอกก็มี<br />
            ก็วาโยธาตุเป็นภายในเป็นไฉน สิ่งใดเป็นภายในอาศัยตน<br />
            เป็นวาโยมีลักษณะพัดไปมา อันกรรมและกิเลสเข้าไปยึดมั่น<br />
            คือลมพัดขึ้นเบื้องบนลมพัดลงเบื้องต่ำ ลมในท้องลมในไส้<br />
            ลมแล่นไปตามอวัยวะน้อยใหญ่ ลมหายใจหรือสิ่งใดสิ่งหนึ่งอย่างอื่น<br />
            เป็นภายในอาศัยตน เป็นวาโยพัดไปมา อันกรรมและกิเลสเข้าไปยึดมั่น<br />
            นี้เราเรียกว่าวาโยธาตุเป็นภายใน<br />
            ก็วาโยธาตุเป็นภายในก็ดี เป็นภายนอกก็ดี<br />
            อันใดวาโยธาตุนั้น เป็นวาโยธาตุเหมือนกัน<br />
            วาโยธาตุนั้นเธอพึงเห็นด้วยปัญญา<br />
            อันชอบตามเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา เราไม่เป็นนั่น นั่นไม่ใช่ตนของเราดังนี้<br />
            เพราะบุคคลเห็นวาโยธาตุนั้น ด้วยปัญญาอันชอบ ตามเป็นจริงอย่างนี้แล้ว<br />
            ย่อมเบื่อหน่ายในวาโยธาตุ จิตย่อมคลายกำหนัดในวาโยธาตุ<br /><br />

            ดูกรราหุล<br />
            ก็อากาศธาตุเป็นไฉน อากาศธาตุเป็นภายในก็มี เป็นภายนอกก็มี<br />
            อากาศธาตุที่เป็นภายในเป็นไฉน สิ่งใดเป็นภายในอาศัยตน<br />
            เป็นอากาศมีลักษณะว่าง อันกรรมและกิเลสเข้าไปยึดมั่น<br />
            คือช่องหูช่องจมูกช่องปาก ช่องคอสำหรับกลืนอาหาร<br />
            ที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม และช่องสำหรับถ่ายอาหาร<br />
            ที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม ออกเบื้องล่าง<br />
            หรือสิ่งใดสิ่งหนึ่งอย่างอื่น เป็นภายในอาศัยตน<br />
            เป็นอากาศมีลักษณะว่างไม่ทึบ มีลักษณะไม่ทึบเป็นช่อง<br />
            มีลักษณะเป็นช่อง อันเนื้อและเลือดไม่ถูกต้องเป็นภายใน<br />
            อันกรรมและกิเลสเข้าไปยึดมั่น นี้เราเรียกว่าอากาศธาตุเป็นภายใน<br />
            ก็อากาศธาตุเป็นภายในก็ดี เป็นภายนอกก็ดี<br />
            อันใดอากาศธาตุนั้น เป็นอากาศธาตุเหมือนกัน<br />
            อากาศธาตุนั้นเธอพึงเห็นด้วยปัญญา อันชอบตามเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเราเราไม่เป็นนั่น นั่นไม่ใช่ตนของเราดังนี้<br />
            ก็บุคคลเห็นอากาศธาตุนั้นด้วยปัญญา อันชอบตามเป็นจริงอย่างนี้แล้ว<br />
            ย่อมเบื่อหน่ายในอากาศธาตุ จิตย่อมคลายกำหนัดในอากาศธาตุ<br /><br /><hr /><br />
            </h4>
            <a href="/fifth/lesson0504">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ภาวนาเสมอด้วยธาตุ 5
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0503;