import React from 'react';

const Lesson0509 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ติมพรุกขสูตร</h2>
          </div>
            <h4>
            ติมพรุกขสูตร<br />
            ว่าด้วยสุขและทุกข์<br />
            พระผู้มีพระภาค ประทับอยู่ ณ พระเชตวัน<br />
            อารามของท่านอนาถบิณฑิกเศรษฐี เขตพระนครสาวัตถี<br />
            ครั้งนั้นแลปริพาชกชื่อว่าติมพรุกขะ เข้าไปเฝ้าพระผู้มีพระภาคถึงที่ประทับ<br />
            ครั้นแล้วได้ปราศรัยกับพระผู้มีพระภาค<br />
            ครั้นผ่านการปราศรัย พอให้ระลึกถึงกันไปแล้ว จึงนั่งณที่ควรส่วนข้างหนึ่ง<br />
            ครั้นแล้วติมพรุกขปริพาชก ได้ทูลถามพระผู้มีพระภาคว่า<br /><br />

            ติมพรุกขะทูลถามพระผู้มีพระภาคว่า<br />
            ข้าแต่ท่านพระโคดม สุขและพวกตนกระทำเองหรือ<br />
            พระผู้มีพระภาคตรัสตอบว่า อย่ากล่าวอย่างนั้นติมพรุกขะ<br /><br />

            ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า<br />
            สุขและทุกข์ผู้อื่นกระทำให้หรือท่านพระโคดม<br />
            พระผู้มีพระภาคตรัสตอบว่า อย่ากล่าวอย่างนั้นติมพรุกขะ<br /><br />

            ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า<br />
            สุขและทุกข์ตนกระทำเองด้วย<br />
            ผู้อื่นกระทำให้ด้วยหรือท่านพระโคดม<br />
            พระผู้มีพระภาคตรัสตอบว่า อย่ากล่าวอย่างนั้นติมพรุกขะ<br /><br />

            ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า<br />
            สุขและทุกข์บังเกิดขึ้น เพราะอาศัยการที่มิใช่ตนเองกระทำ<br />
            มิใช่ผู้อื่นกระทำให้หรือท่านพระโคดม<br />
            พระผู้มีพระภาคตรัสตอบว่า อย่ากล่าวอย่างนั้นติมพรุกขะ<br /><br />

            ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า<br />
            สุขและทุกข์ไม่มีหรือท่านพระโคดม<br />
            พระผู้มีพระภาคตรัสตอบว่า สุขและทุกข์ไม่มีหาไม่ได้ สุขและทุกข์มีอยู่ติมพรุกขะ<br />
            ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า<br />
            ถ้าอย่างนั้นท่านพระโคดม ย่อมไม่รู้ไม่เห็นสุขและทุกข์<br />
            พระผู้มีพระภาคตรัสตอบว่า เราย่อมไม่รู้ไม่เห็นสุขและทุกข์หาไม่ได้<br />
            เรารู้เห็นสุขและทุกข์อยู่ติมพรุกขะ<br /><br />

            เมื่อข้าพเจ้าถามว่า ข้าแต่ท่านพระโคดมสุขและทุกข์ ตนกระทำเองหรือ<br />
            ท่านตรัสว่าอย่ากล่าวอย่างนั้นติมพรุกขะ<br />
            เมื่อข้าพเจ้าถามว่า สุขและทุกข์ผู้อื่นกระทำให้หรือ<br />
            ท่านพระโคดม ท่านตรัสว่า อย่ากล่าวอย่างนั้นติมพรุกขะ<br />
            เมื่อข้าพเจ้าถามว่า สุขและทุกข์ตนกระทำเองด้วย<br />
            ผู้อื่นกระทำให้ด้วยหรือท่านพระโคดม<br />
            ท่านตรัสว่าอย่ากล่าวอย่างนั้นติมพรุกขะ<br />
            เมื่อข้าพเจ้าถามว่าสุขและทุกข์บังเกิดขึ้น<br />
            เพราะอาศัยการที่ไม่ใช่ตนเองกระทำ<br />
            ไม่ใช่ผู้อื่นกระทำให้หรือท่านพระโคดม<br />
            ท่านตรัสว่าอย่ากล่าวอย่างนั้นติมพรุกขะ<br />
            เมื่อข้าพเจ้าถามว่าสุขและทุกข์ไม่มีหรือ<br />
            ท่านตรัสว่าสุขและทุกข์ไม่มีหาไม่ได้<br />
            สุขและทุกข์มีอยู่ติมพรุกขะ<br />
            เมื่อข้าพเจ้าถามว่า<br />
            ถ้าอย่างนั้นท่านพระโคดม<br />
            ย่อมไม่รู้ไม่เห็นสุขและทุกข์<br />
            ท่านตรัสว่า เราย่อมไม่รู้ไม่เห็นสุขและทุกข์หาไม่ได้<br />
            เราเห็นสุขและทุกข์อยู่ติมพรุกขะ<br />
            ท่านพระโคดมจงตรัสบอกสุขและทุกข์<br />
            แก่ข้าพเจ้าขอท่านพระโคดม<br />
            จงทรงแสดงสุขและทุกข์แก่ข้าพเจ้า<br /><br />

            พระผู้มีพระภาคตรัสว่า<br />
            ดูกรติมพรุกขะ<br />
            เมื่อบุคคลถืออยู่ว่านั่นเวทนา นั่นผู้เสวยดังนี้<br />
            แต่เราไม่กล่าวอย่างนี้ว่า สุขและทุกข์ตนกระทำเอง<br />
            เมื่อบุคคลถูกเวทนาทิ่มแทงอยู่ว่า<br />
            เวทนาอย่างหนึ่งผู้เสวยเป็นอีกคนหนึ่งดังนี้<br />
            แต่เราไม่กล่าวอย่างนี้ว่า สุขและทุกข์ผู้อื่นกระทำให้<br />
            ดูกรติมพรุกขะตถาคตแสดงธรรม โดยสายกลาง<br />
            ไม่เข้าไปใกล้ส่วนสุดทั้งสองนั้นว่า<br />
            เพราะอวิชชาเป็นปัจจัยจึงมีสังขาร เพราะสังขารเป็นปัจจัยจึงมีวิญญาณ<br />
            ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้ ย่อมมีด้วยประการอย่างนี้<br />
            เพราะอวิชชานั่นแหละดับ ด้วยสำรอกโดยไม่เหลือ สังขารจึงดับ<br />
            เพราะสังขารดับวิญญาณจึงดับ<br />
            ความดับแห่งกองทุกข์ทั้งมวลนี้ ย่อมมีด้วยประการอย่างนี้<br /><br />

            พระผู้มีพระภาคตรัสอย่างนี้แล้ว<br />
            ติมพรุกขะปริพาชก ได้กราบทูลพระผู้มีพระภาคว่า<br />
            ข้าแต่ท่านพระโคดม ภาษิตของพระองค์แจ่มแจ้งนัก<br />
            ข้าแต่ท่านพระโคดม ภาษิตของพระองค์แจ่มแจ้งนัก<br />
            พระผู้มีพระภาค ทรงประกาศธรรมโดยอเนกปริยาย<br />
            เปรียบเหมือนบุคคล หงายของที่คว่ำเปิดของที่ปิด<br />
            บอกทางแก่คนหลงทาง หรือตามประทีปในที่มืด<br />
            ด้วยประสงค์ว่าผู้มีจักษุ จักเห็นรูปฉะนั้น<br />
            ข้าพระองค์ขอถึงท่านพระโคดม กับทั้งพระธรรมและพระภิกษุสงฆ์ เป็นสรณะ<br />
            ขอท่านพระโคดม จงทรงจำข้าพระองค์<br />
            ว่าเป็นอุบาสกถึงผู้ถึงสรณะ จนตลอดชีวิตจำเดิมแต่วันนี้เป็นต้นไป<br /><br /><hr /><br />
            </h4>
            <a href="/fifth/lesson0510">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ปริวีมังสนสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0509;