import React from 'react';

const Lesson0510 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>อนาคตสูตรที่ 2</h2>
          </div>
            <h4>
            อนาคตสูตรที่ 2<br />
            ว่าด้วยภัยในอนาคต 5 ประการ<br />
            ดูกรภิกษุทั้งหลาย<br />
            ภิกษุผู้เห็นภัย ในอนาคต 5 ประการนี้ ก็ควรเป็นผู้ไม่ประมาท<br />
            มีความเพียรมีใจเด็ดเดี่ยว เพื่อถึงธรรมที่ยังไม่ถึง<br />
            เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ เพื่อทำให้แจ้งธรรม ที่ยังไม่ได้ทำให้แจ้ง<br />
            ภัย 5 ประการเป็นไฉนคือ<br />
            ภิกษุในธรรมวินัยนี้ ย่อมพิจารณาเห็นดังนี้ว่า<br />
            บัดนี้เรายังเป็นหนุ่มแน่น มีผมดำสนิท<br />
            ประกอบด้วยความเป็นหนุ่ม อันเจริญตั้งอยู่ในปฐมวัย<br />
            ถึงกระนั้นก็มีสมัยที่ชรา ย่อมจะถูกต้องกายนี้ได้<br />
            ก็ผู้ที่แก่แล้วถูกชราครอบงำแล้ว<br />
            จะมนสิการคำสั่งสอนของพระพุทธเจ้า ไม่ใช่ทำได้ง่าย<br />
            จะเสพเสนาสนะอันสงัด คือป่า และป่าชัฏก็ไม่ใช่ทำได้ง่าย<br />
            ก่อนที่ธรรมอันไม่น่าปรารถนา ไม่น่าใคร่ไม่น่าพอใจนั้นจะมาถึงเรา<br />
            เราจะรีบปรารภความเพียร เพื่อถึงธรรมที่ยังไม่ถึง<br />
            เพื่อทำให้แจ้งธรรม ที่ยังไม่ได้ทำให้แจ้งเสียก่อนทีเดียว<br />
            ซึ่งเราประกอบแล้วแม้แก่ก็จักอยู่สบาย<br />
            ดูกรภิกษุทั้งหลาย<br />
            ภิกษุผู้เห็นภัยในอนาคตข้อที่ 1 นี้ ควรเป็นผู้ไม่ประมาท<br />
            มีความเพียรมีใจเด็ดเดี่ยวอยู่ เพื่อถึงธรรมที่ยังไม่ถึง<br />
            เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ เพื่อทำให้แจ้งทำที่ยังไม่ได้ทำให้แจ้ง<br /><br />

            อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า<br />
            บัดนี้เรามีอาพาธน้อยมีโรคเบาบาง<br />
            ประกอบด้วยไฟธาตุ สำหรับย่อยอาหารสม่ำเสมอ<br />
            ไม่เย็นนะไม่ร้อนนักขนาดกลาง ควรแก่การบำเพ็ญเพียร<br />
            แต่ย่อมมีสมัยที่พยาธิจะถูกต้องกายนี้ ก็ผู้ที่ป่วยไข้อันความป่วยไข้ครอบงำแล้ว<br />
            จะมนสิการคำสั่งสอนของพระพุทธเจ้า ไม่ใช่ทำได้ง่าย<br />
            ซึ่งเราประกอบแล้วแม้ป่วยไข้ ก็จะอยู่สบาย<br />
            ภิกษุเห็นภัยในอนาคตข้อที่ 2 นี้ ควรเป็นผู้ไม่ประมาท<br /><br />

            อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า<br />
            บัดนี้แลข้าวกล้าดีบิณฑบาตก็หาได้ง่าย สะดวกแก่การแสวงหาเลี้ยงชีพ<br />
            แต่ก็ย่อมมีสมัยที่มีข้าวแพง ข้าวกล้าไม่ดีบิณฑบาตหาได้ยาก<br />
            ไม่สะดวกแก่การแสวงหาเลี้ยงชีพ<br />
            อนึ่งในสมัยข้าวแพง พวกมนุษย์ย่อมหลั่งไหลไปในที่ที่มีอาหารดี<br />
            ในที่นั้นย่อมมีการอยู่คลุกคลีด้วยหมู่คณะ มีการอยู่พลุกพล่านกัน<br />
            เมื่อมีการอยู่คลุกคลีด้วยหมู่คณะ อยู่พลุกพล่านกัน<br />
            จะมนสิการคำสั่งสอนของพระพุทธเจ้า ไม่ใช่ทำได้ง่าย<br />
            ซึ่งเราประกอบแล้วก็จักอยู่สบาย แม้ในเวลาทุพภิกขภัย<br />
            ภิกษุผู้เห็นภัยในอนาคตข้อที่ 3 นี้ ควรเป็นผู้ไม่ประมาท<br /><br />

            อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า<br />
            บัดนี้แลมนุษย์ทั้งหลายย่อมเป็นผู้พร้อมเพรียงกัน<br />
            ชื่นชมต่อกันไม่วิวาทกัน เป็นดังน้ำนมกับน้ำ <br />
            มองดูกันด้วยนัยน์ตาแสดงความรักอยู่<br />
            แต่ย่อมมีสมัยที่มีภัยมีความปั่นป่วน ในดงประชาชนวุ่นวาย<br />
            และเมื่อมีภัยพวกมนุษย์ย่อมหลั่งไหล ไปในที่ที่ปลอดภัย<br />
            ในที่นั้นย่อมมีการอยู่คลุกคลีด้วยหมู่คณะ มีการอยู่พลุกพล่านกัน<br />
            เมื่อมีการอยู่คลุกคลีด้วยหมู่คณะ อยู่พลุกพล่าน<br />
            จะมนสิการคำสั่งสอนของพระพุทธเจ้า ไม่ใช่ทำได้ง่าย<br />
            ซึ่งเราประกอบแล้วก็จักอยู่สบาย แม้ในสมัยที่มีภัย<br />
            ภิกษุผู้เห็นภัยในอนาคตข้อที่ 4 นี้<br />
            ควรเป็นผู้ไม่ประมาท<br /><br />

            อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า<br />
            บัดนี้แลสงฆ์เป็นผู้พร้อมเพรียงกัน ชื่นชมต่อกันไม่วิวาทกัน<br />
            มีอุเทศร่วมกันอยู่ผาสุข แต่ก็ย่อมมีสมัยที่สงฆ์แตกกัน<br />
            ก็เมื่อสงฆ์แตกกันแล้ว จะมมสิการคำสั่งสอนของพระพุทธเจ้า ไม่ใช่ทำได้ง่าย<br />
            จะเสพเสนาสนะอันสงัดคือป่า และป่าชัฏก็ไม่ใช่ทำได้ง่าย<br />
            ก่อนที่ธรรมอันไม่น่าปรารถนา ไม่น่าใคร่ไม่น่าพอใจนั้นจะมาถึงเรา<br />
            เราจะรีบปรารภความเพียร เพื่อถึงธรรมที่ยังไม่ถึง<br />
            เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ เพื่อทำให้แจ้งธรรมที่ยังไม่ได้ทำให้แจ้ง<br />
            ซึ่งเราประกอบแล้วก็จะอยู่สบาย แม้ในเมื่อสงฆ์แตกกัน<br />
            ดูกรภิกษุทั้งหลาย<br />
            ภิกษุผู้เห็นภัยในอนาคตข้อที่ 5 นี้แล ควรเป็นผู้ไม่ประมาท<br />
            มีความเพียรมีใจเด็ดเดี่ยว อยู่เพื่อถึงธรรมที่ยังไม่ถึง<br />
            เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ เพื่อทำให้แจ้งทำที่ยังไม่ได้ทำให้แจ้ง<br />
            ดูกรภิกษุทั้งหลาย<br />
            ภิกษุผู้เห็นภัยในอนาคต 5 ประการนี้ ควรเป็นผู้ไม่ประมาท<br />
            มีความเพียรมีใจเด็ดเดี่ยว อยู่เพื่อถึงธรรมที่ยังไม่ถึง<br />
            เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ เพื่อทำให้แจ้งทำที่ยังไม่ได้ทำให้แจ้ง<br /><br /><hr /><br />
            </h4>
            <a href="/sixth/lesson0601">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                นกุลปิตาสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0510;