import React from 'react';

const Lesson0604 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ยมกสูตร</h2>
          </div>
            <h4>
              สมัยหนึ่ง ท่านพระสารีบุตร<br />
              อยู่ที่พระวิหารเชตวัน อารามของท่านอนาถบิณฑิกเศรษฐี<br />
              ใกล้พระนครสาวัตถี<br />
              ก็โดยสมัยนั้นแล ยมกภิกษุเกิดทิฏฐิอันชั่วช้า<br />
              เห็นปานนี้ว่า<br />
              เราย่อมรู้ทั่วถึงธรรม ตามที่พระผู้มีพระภาค ทรงแสดงแล้วว่า<br />
              พระขีณาสพเมื่อตายไปแล้ว ย่อมขาดสูญ<br />
              ย่อมพินาศ<br />
              ย่อมไม่เกิดอีก<br />
              ภิกษุหลายรูป<br />
              ได้ฟังแล้วว่า<br />
              ได้ยินว่า ยมกภิกษุเกิดทิฏฐิอันชั่วช้า เป็นปานนี้ว่า<br />
              เรารู้ทั่วถึงธรรม<br />
              ตามที่พระผู้มีพระภาค<br />
              ทรงแสดงแล้วว่า<br />
              พระขีณาสพเมื่อตายไปแล้ว<br />
              ย่อมขาดสูญ<br />
              ย่อมพินาศ<br />
              ย่อมไม่เกิดอีก<br />
              ครั้งนั้น ภิกษุเหล่านั้น<br />
              จึงพากันเข้าไปหา ท่านยมกภิกษุถึงที่อยู่<br />
              ได้สนทนาปราศรัย กับท่านยมกภิกษุ<br />
              ครั้นผ่านการสนทนาปราศรัย ชวนให้ระลึกถึงกันไปแล้ว<br />
              จึงนั่ง ณ ที่ควรส่วนข้างหนึ่ง<br />
              ครั้นแล้ว จึงถามท่านยมกภิกษุว่า<br />
              ดูกรท่านยมกะ ทราบว่า ท่านเกิดทิฏฐิอันชั่วช้า เห็นปานนี้ว่า<br />
              เรารู้ว่าทั่วถึงธรรม<br />
              ตามที่พระผู้มีพระภาค<br />
              ทรงแสดงแล้วว่า<br />
              พระขีณาสพเมื่อตายไปแล้ว ย่อมขาดสูญ<br />
              ย่อมพินาศ<br />
              ย่อมไม่เกิดอีกจริงหรือ?<br />
              ท่านยมกะกล่าวว่า อย่างนั้น อาวุโส<br />
              ภิ ดูกรอาวุโสยมกะ<br />
              ท่านอย่าได้พูดอย่างนั้น<br />
              อย่าได้กล่าวตู่พระผู้มีพระภาค<br />
              เพราะการกล่าวตู่พระผู้มีพระภาค ไม่ดีเลย<br />
              เพราะพระผู้มีพระภาค ไม่พึงตรัสอย่างนี้ว่า<br />
              พระขีณาสพเมื่อตายไปแล้ว ย่อมขาดสูญ<br />
              ย่อมพินาศ<br />
              ย่อมไม่เกิดอีก<br />
              ท่านยมกะ<br />
              เมื่อถูกภิกษุเหล่านั้น กล่าวแม้อย่างนี้<br />
              ยังขืนกล่าวถือทิฏฐิอันชั่วช้านั้น อย่างหนักแน่นอย่างนั้นว่า<br />
              เรารู้ทั่วถึงธรรม ตามที่พระผู้มีพระภาค<br />
              ทรงแสดงแล้วว่า<br />
              พระขีณาสพเมื่อตายไปแล้ว ย่อมขาดสูญ<br />
              ย่อมพินาศ<br />
              ย่อมไม่เกิดอีก<br />
              ภิกษุเหล่านั้น ย่อมไม่อาจเพื่อจะยังท่านยมกะ<br />
              ให้ถอนทิฏฐิอันชั่วช้านั้นได้<br />
              จึงลุกจากอาสนะ<br />
              เข้าไปหาท่านพระสารีบุตร จนถึงที่อยู่<br /><br />

              ครั้นแล้ว จึงกล่าวกะท่านพระสารีบุตรว่า<br />
              ข้าแต่ท่านสารีบุตร<br />
              ยมกภิกษุเกิดทิฏฐิอันชั่วช้า เห็นปานนี้ว่า<br />
              เรารู้ทั่วถึงธรรม ตามที่พระผู้มีพระภาค ทรงแสดงแล้วว่า<br />
              พระขีณาสพเมื่อตายไปแล้ว ย่อมขาดสูญ ย่อมพินาศ ย่อมไม่เกิดอีก<br />
              ขอโอกาสนิมนต์ท่านพระสารีบุตร ไปหายมกภิกษุถึงที่อยู่<br />
              เพื่ออนุเคราะห์เถิด<br />
              ท่านพระสารีบุตรรับนิมนต์ โดยดุษณีภาพ<br />
              ครั้งนั้น เวลาเย็น ท่านพระสารีบุตร<br />
              ออกจากที่พักผ่อนแล้ว<br />
              เข้าไปหาท่านยมกะถึงที่อยู่<br />
              ได้สนทนาปราศรัยกับท่านยมกะ<br />
              ครั้นผ่านการสนทนาปราศรัย<br />
              พอให้ระลึกถึงกันไปแล้ว<br />
              จึงนั่ง ณ ที่ควรส่วนข้างหนึ่งแล้ว<br />
              ได้ถามท่านยมกะว่า<br />
              ดูกรอาวุโสยมกะ<br />
              ทราบว่า ท่านเกิดทิฏฐิอันชั่วช้า เห็นปานนี้ว่า<br />
              เรารู้ทั่วถึงธรรม<br />
              ตามที่พระผู้มีพระภาค ทรงแสดงแล้วว่า<br />
              พระขีณาสพ เมื่อตายไปแล้ว ย่อมขาดสูญ ย่อมพินาศ ย่อมไม่เกิดอีก<br />
              ดังนี้จริงหรือ?<br />
              ท่านยมกะตอบว่า อย่างนั้นแล ท่านสารีบุตร<br /><br />

              สา ดูกรท่านยมกะ<br />
              ท่านจะสำคัญความข้อนั้นเป็นไฉน<br />
              รูปเที่ยงหรือไม่เที่ยง?<br />
              ย ไม่เที่ยง ท่าน ฯลฯ<br />
              สา เวทนา สัญญา สังขาร วิญญาณ เที่ยงหรือไม่เที่ยง?<br />
              ย ไม่เที่ยง ท่าน ฯลฯ<br />
              สา เพราะเหตุนี้นั้นแล ยมกะ<br />
              พระอริยสาวกผู้ใดสดับแล้ว<br />
              เห็นอยู่อย่างนี้ ฯลฯ<br />
              รู้ชัดว่า ฯลฯ<br />
              กิจอื่นเพื่อความเป็นอย่างนี้มิได้มีอีก<br />
              สา ดูกรท่านยมกะ<br />
              ท่านจะสำคัญความข้อนั้นเป็นไฉน<br />
              ท่านเห็นรูปว่าเป็น สัตว์เป็นบุคคลหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นเวทนาว่า เป็นสัตว์เป็นบุคคลหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นสัญญาว่า เป็นสัตว์เป็นบุคคลหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นสังขารว่า เป็นสัตว์เป็นบุคคลหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นวิญญาณว่า เป็นสัตว์เป็นบุคคลหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ดูกรท่านยมกะ<br />
              ท่านจะสำคัญความข้อนั้นเป็นไฉน<br />
              ท่านเห็นว่าสัตว์บุคคล มีในรูปหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นว่า สัตว์บุคคลอื่นจากรูปหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นว่า สัตว์บุคคลมีในเวทนาหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นว่า สัตว์บุคคลอื่นจากเวทนาหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นว่า สัตว์บุคคลมีในสัญญาหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นว่า สัตว์บุคคลมีในสังขารหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นว่า สัตว์บุคคลอื่นจากสังขารหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นว่า สัตว์บุคคลมีในวิญญาณหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ท่านเห็นว่า สัตว์บุคคลอื่นจากวิญญาณหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ดูกรยมกะ<br />
              ท่านจะสำคัญ<br />
              ความข้อนั้นเป็นไฉน<br />
              ท่านเห็นรูป เวทนา สัญญา สังขาร วิญญาณ ว่าเป็นสัตว์บุคคลหรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ดูกรท่านยมกะ<br />
              ท่านจะสำคัญ ความข้อนั้นเป็นไฉน<br />
              ท่านเห็นว่า สัตว์บุคคลนี้นั้นไม่มีรูป ไม่มีเวทนา ไม่มีสัญญา ไม่มีสังขาร ไม่มีวิญญาณ หรือ?<br />
              ย ไม่ใช่อย่างนั้น ท่าน<br />
              สา ดูกรท่านยมกะ<br />
              ก็โดยที่จริง โดยที่แท้<br />
              ท่านจะค้นหาสัตว์บุคคล ในขันธ์ ๕ เหล่านี้ ในปัจจุบันไม่ได้เลย<br />
              ควรแลหรือที่ท่านจะยืนยันว่า เรารู้ทั่วถึงธรรม<br />
              ตามที่พระผู้มีพระภาค ทรงแสดงแล้วว่า<br />
              พระขีณาสพเมื่อตายไปแล้ว ย่อมขาดสูญ ย่อมพินาศ ย่อมไม่เกิดอีก<br />
              ย ข้าแต่ท่านพระสารีบุตร<br />
              เมื่อก่อนผมไม่รู้อย่างนี้ จึงได้เกิดทิฏฐิอันชั่วช้าอย่างนั้น<br />
              แต่เดี๋ยวนี้<br />
              ผมละทิฏฐิอันชั่วช้านั้นได้แล้ว<br />
              และผมก็ได้บรรลุธรรมแล้ว<br />
              เพราะฟังธรรมเทศนานี้<br />
              ของท่านพระสารีบุตร<br /><br />

              สา ดูกรท่านยมกะ<br />
              ถ้าชนทั้งหลาย พึงถามท่านอย่างนี้ว่า<br />
              ท่านยมกะภิกษุ<br />
              ผู้ที่เป็นพระอรหันตขีณาสพ<br />
              เมื่อตายไปแล้ว ย่อมเป็นอะไร<br />
              ท่านถูกถามอย่างนั้น<br />
              จะพึงกล่าวแก้ว่าอย่างไร?<br />
              ย ข้าแต่ท่านสารีบุตร<br />
              ถ้าเขาถามอย่างนั้น<br />
              ผมพึงกล่าวแก้อย่างนี้ว่า<br />
              รูปแลไม่เที่ยง<br />
              สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์<br />
              สิ่งใดเป็นทุกข์ สิ่งนั้นดับไปแล้ว<br />
              ถึงแล้วซึ่งการตั้งอยู่ไม่ได้<br />
              เวทนา สัญญา สังขาร วิญญาณไม่เที่ยง<br />
              สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์<br />
              สิ่งใดเป็นทุกข์ สิ่งนั้นดับไปแล้ว<br />
              ถึงแล้วซึ่งการตั้งอยู่ไม่ได้<br />
              ข้าแต่ท่านสารีบุตร<br />
              ผมถูกเขาถามอย่างนั้น<br />
              พึงกล่าวแก้อย่างนี้<br />
              สา ดีละๆ ยมกะ<br />
              ถ้าอย่างนั้น เราจักอุปมาให้ท่านฟัง<br />
              เพื่อหยั่งรู้ความข้อนั้นให้ยิ่งๆขึ้น<br /><br />

              ดูกรท่านยมกะ<br />
              เปรียบเหมือนคฤหบดี<br />
              หรือบุตรของคฤหบดีผู้มั่งคั่ง<br />
              มีทรัพย์มาก มีโภคะมาก<br />
              และเขารักษาตัวกวดขัน<br />
              เกิดมีบุรุษคนหนึ่ง<br />
              ประสงค์ความพินาศ<br />
              ประสงค์ความไม่เป็นประโยชน์<br />
              ประสงค์ความไม่ปลอดภัย<br />
              อยากจะปลงชีวิตเขาเสีย<br />
              เขาพึงมีความคิดอย่างนี้ว่า<br />
              คฤหบดีและบุตรคฤหบดีนี้<br />
              เป็นคนมั่งคั่ง มีทรัพย์มาก มีโภคะมาก<br />
              และเขามีการรักษาอย่างกวดขัน<br />
              การที่จะอุกอาจปลงชีวิตนี้<br />
              ไม่ใช่เป็นการทำได้ง่ายเลย<br />
              อย่ากระนั้นเลย<br />
              เราพึงใช้อุบายปลงชีวิต บุรุษนั้น<br />
              พึงเข้าไปหาคฤหบดี<br />
              หรือบุตรคฤหบดีนั้นแล้ว<br />
              พึงกล่าวอย่างนี้ว่า<br />
              ผมขอเป็นคนรับใช้ท่าน<br />
              คฤหบดีหรือบุตรคฤหบดีนั้น<br />
              พึงรับบุรุษนั้นไว้ใช้<br />
              เขาพึงรับใช้เรียบร้อยดีทุกประการ<br />
              คือ มีปรกติตื่นก่อน นอนภายหลัง<br />
              คอยฟังคำสั่ง ประพฤติให้เป็นที่พอใจ<br />
              กล่าวแต่วาจาเป็นที่รักใคร่<br />
              คฤหบดีหรือบุตรคฤหบดีนั้น เชื่อเขาโดยความเป็นมิตร โดยความเป็นสหาย<br />
              และถึงความไว้วางใจในเขา<br />
              เมื่อใด บุรุษนั้นพึงคิดว่า<br />
              คฤหบดีหรือบุตรคฤหบดี ไว้ใจเราดีแล้ว<br />
              เมื่อนั้น บุรุษนั้นรู้ว่า<br />
              คฤหบดีหรือบุตรคฤหบดีอยู่ในที่ลับ<br />
              พึงปลงชีวิตเสียด้วยศาตราอันคม<br />
              ท่านยมกะ<br />
              ท่านจะสำคัญความข้อนั้นเป็นไฉน<br />
              ในกาลใด บุรุษนั้นเข้าไปหา คฤหบดีหรือบุตรคฤหบดีโน้นแล้ว<br />
              กล่าวอย่างนี้ว่า<br />
              ผมขอรับใช้ท่านแม้ในกาลนั้น<br />
              เขาก็ชื่อว่าเป็นผู้ฆ่าอยู่แล้ว<br />
              ก็แต่คฤหบดีหรือบุตรคฤหบดีนั้น<br />
              หารู้จักบุรุษผู้ฆ่าว่า เป็นผู้ฆ่าเราไม่<br />
              ในกาลใด บุรุษนั้นตื่นก่อน นอนภายหลัง<br />
              คอยฟังคำสั่ง ประพฤติให้เป็นที่พอใจ<br />
              กล่าวแต่วาจาเป็นที่รักใคร่<br />
              แม้ในกาลนั้น<br />
              เขาก็ชื่อว่าเป็นผู้ฆ่าอยู่แล้ว<br />
              ก็แต่คฤหบดีหรือบุตรคฤหบดีนั้น<br />
              หารู้จักบุรุษผู้ฆ่านั้นว่า เป็นผู้ฆ่าเราไม่<br />
              และในกาลใด<br />
              บุรุษนั้นรู้ว่า<br />
              คฤหบดีหรือบุตรคฤหบดี นั้นอยู่ในที่ลับ<br />
              จึงปลงชีวิตเสีย ด้วยศาตราอันคม<br />
              แม้ในกาลนั้น เขาเป็นผู้ฆ่านั่นเอง<br />
              ก็แต่คฤหบดีหรือบุตรคฤหบดีนั้น<br />
              หารู้จักบุรุษนั้นว่าเป็นผู้ฆ่าเราไม่<br />
              ย อย่างนั้น ท่าน<br /><br />

              สา ดูกรท่านยมกะ<br />
              ข้ออุปมานี้ฉันใด<br />
              ปุถุชนผู้มิได้สดับ ไม่ได้เห็นพระอริยะทั้งหลาย<br />
              ไม่ฉลาดในอริยธรรม<br />
              ไม่ได้รับแนะนำในอริยธรรม<br />
              ไม่ได้เห็นสัตบุรุษทั้งหลาย<br />
              ไม่ฉลาดในสัปปุริสธรรม<br />
              ไม่ได้รับแนะนำ ในสัปปุริสธรรม<br />
              ก็ฉันนั้นเหมือนกัน<br />
              ย่อมเห็นรูป โดยความเป็นตน ย่อมเห็นตนมีรูป ย่อมเห็นรูปในตน หรือย่อมเห็นตนในรูป<br />
              ย่อมเห็นเวทนา โดยความเป็นตน ฯลฯ<br />
              ย่อมเห็นสัญญา โดยความเป็นตน ฯลฯ<br />
              ย่อมเห็นสังขาร โดยความเป็นตน ฯลฯ<br />
              ย่อมเห็นวิญญาณ โดยความเป็นตน ย่อมเห็นตนมีวิญญาณ ย่อมเห็นวิญญาณในตน หรือย่อมเห็นตนในวิญญาณ<br />
              เขาย่อมไม่รู้ชัด ตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ<br />
              อันไม่เที่ยงว่า ไม่เที่ยง<br />
              ย่อมไม่รู้ชัด ตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ<br />
              อันเป็นทุกข์ว่า เป็นทุกข์<br />
              ย่อมไม่รู้ชัด ตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ<br />
              อันเป็นอนัตตา ว่าเป็นอนัตตา<br />
              ย่อมไม่รู้ชัด ตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ<br />
              อันปัจจัยปรุงแต่งว่า อันปัจจัยแต่ง<br />
              ย่อมไม่รู้ชัด ตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ<br />
              อันเป็นผู้ฆ่า ว่าเป็นผู้ฆ่า<br />
              เขาย่อมเข้าไปถือมั่น ยึดมั่น ซึ่งรูป เวทนา สัญญา สังขาร วิญญาณว่า เป็นตัวตนของเรา<br />
              อุปาทานขันธ์ ๕ เหล่านี้<br />
              อันปุถุชนนั้นเข้าไปถือมั่น ยึดมั่นแล้ว<br />
              ย่อมเป็นไป เพื่อสิ่งมิใช่ประโยชน์เกื้อกูล<br />
              เพื่อทุกข์ตลอดกาลนาน<br /><br />

              ดูกรท่านยมกะ<br />
              ส่วนพระอริยสาวกผู้สดับแล้ว<br />
              ได้เห็นพระอริยะทั้งหลาย<br />
              ฉลาดในอริยธรรม ได้รับแนะนำ ในอริยธรรมดีแล้ว<br />
              ได้เห็นสัตบุรุษทั้งหลาย<br />
              ฉลาดในสัปปุริสธรรม<br />
              ได้รับแนะนำ ในสัปปุริสธรรมดีแล้ว <br />
              ย่อมไม่เห็นรูป โดยความเป็นตน ย่อมไม่เห็นตนมีรูป ย่อมไม่เห็นรูปในตน หรือย่อมไม่เห็นตนในรูป<br />
              ย่อมไม่เห็นเวทนา โดยความเป็นตน ฯลฯ<br />
              ย่อมไม่เห็นสัญญา โดยความเป็นตน ฯลฯ<br />
              ย่อมไม่เห็นสังขาร โดยความเป็นตน ฯลฯ<br />
              ย่อมไม่เห็นวิญญาณ โดยความเป็นตน<br />
              ย่อมไม่เห็นตนมีวิญญาณ ย่อมไม่เห็นวิญญาณในตน หรือย่อมไม่เห็นตนในวิญญาณ<br />
              เขาย่อมรู้ชัดตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ<br />
              อันไม่เที่ยงว่าไม่เที่ยง<br />
              ย่อมรู้ชัดตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ<br />
              อันเป็นทุกข์ว่าเป็นทุกข์<br />
              ย่อมรู้ชัด ตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ อันเป็นอนัตตาว่าเป็นอนัตตา<br />
              ย่อมรู้ชัด ตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ อันปัจจัยปรุงแต่ง ว่าปัจจัยปรุงแต่ง<br />
              ย่อมรู้ชัด ตามความเป็นจริงซึ่ง รูป เวทนา สัญญา สังขาร วิญญาณ อันเป็นผู้ฆ่า ว่าเป็นผู้ฆ่า<br />
              เขาย่อมไม่เข้าไปถือมั่น ยึดมั่น ซึ่งรูป เวทนา สัญญา สังขาร วิญญาณว่า เป็นตัวตนของเรา<br />
              อุปาทานขันธ์ ๕ เหล่านี้<br />
              อันอริยสาวกนั้น ไม่เข้าไปถือมั่น ยึดมั่นแล้ว ย่อมเป็นไป<br />
              เพื่อประโยชน์เกื้อกูล<br />
              เพื่อสุขตลอดกาลนาน<br />
              ย ข้าแต่ท่านสารีบุตร<br />
              ข้อที่เพื่อนพรหมจรรย์ทั้งหลาย<br />
              ของท่านผู้มีอายุทั้งหลาย<br />
              ผู้เช่นนั้น เป็นผู้อนุเคราะห์<br />
              ใคร่ประโยชน์<br />
              เป็นผู้ว่ากล่าวพร่ำสอน<br />
              ย่อมเป็นอย่างนั้นแท้<br />
              ก็แลจิตของผมหลุดพ้นแล้ว<br />
              จากอาสวะทั้งหลาย ไม่ถือมั่น<br />
              เพราะได้ฟังธรรมเทศนานี้ ของท่านสารีบุตร<br /><br /><hr /><br />
            </h4>
            <a href="/sixth/lesson0605">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                อนุราธสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0604;