import React from 'react';

const Lesson0603 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>อุปาทิยสูตร</h2>
          </div>
            
            <h4>
            ข้าพเจ้าได้สดับมาแล้วอย่างนี้<br />
            สมัยหนึ่ง พระผู้มีพระภาคประทับอยู่ ณ พระวิหารเชตวัน<br />
            อารามของท่านอนาถบิณฑิกเศรษฐี<br />
            ใกล้พระนครสาวัตถี<br />
            ครั้งนั้นแล ภิกษุรูปหนึ่ง<br />
            เข้าไปเฝ้าพระผู้มีพระภาค ถึงที่ประทับ<br />
            ถวายอภิวาท แล้วนั่ง ณ ที่ควรส่วนข้างหนึ่ง<br />
            ครั้นแล้ว ได้กราบทูลว่า ข้าแต่พระองค์ผู้เจริญ<br />
            ขอพระผู้มีพระภาค โปรดประทานพระวโรกาส<br />
            แสดงพระธรรมเทศนา โดยสังเขป แก่ข้าพระองค์<br />
            ที่ข้าพระองค์ได้สดับแล้ว เป็นผู้ๆเดียว<br />
            หลีกออกจากหมู่ ไม่ประมาท<br />
            มีความเพียร มีใจมั่นคงอยู่เถิด<br />
            พระผู้มีพระภาคตรัสว่า<br />
            ดูกรภิกษุ เมื่อบุคคลยังยึดมั่น ก็ต้องถูกมารมัดไว้<br />
            เมื่อไม่ยึดมั่น จึงหลุดพ้นจากมาร<br />
            ภิ. ข้าแต่พระผู้มีพระภาค ข้าพระองค์ทราบแล้ว<br />
            ข้าแต่พระสุคต ข้าพระองค์ทราบแล้ว.<br />
            พ. ดูกรภิกษุ<br />
            ก็เธอรู้ซึ้งถึงอรรถแห่งคำ ที่กล่าวแล้วอย่างย่อ<br />
            โดยพิสดารได้อย่างไรเล่า?<br />
            ภิ. ข้าแต่พระองค์ผู้เจริญ<br />
            เมื่อบุคคลยังยึด รูป เวทนา สัญญา สังขาร และวิญญาณมั่นอยู่<br />
            ก็ต้องถูกมารมัดไว้<br />
            เมื่อไม่ยึดมั่นจึงหลุดพ้นจากมาร<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            ข้าพระองค์รู้ซึ้งถึงอรรถ แห่งพระดำรัส<br />
            ที่พระผู้มีพระภาคตรัสแล้วอย่างย่อ<br />
            โดยพิสดารอย่างนี้แล<br />
            พ. ดีแล้วๆ ภิกษุ<br />
            เธอรู้ซึ้งถึงอรรถแห่งคำ ที่เรากล่าวแล้วอย่างย่อ<br />
            โดยพิสดารอย่างดีแล้ว<br />
            ดูกรภิกษุ<br />
            บุคคลยังยึด รูป เวทนา สัญญา สังขาร และวิญญาณมั่นอยู่<br />
            ก็ต้องถูกมารมัดไว้<br />
            เมื่อไม่ยึดมั่น จึงหลุดพ้นจากมาร<br />
            เธอพึงทราบอรรถแห่งคำนี้<br />
            ที่เรากล่าวแล้วอย่างย่อ<br />
            โดยพิสดารอย่างนี้เถิด<br />
            ครั้งนั้นแล<br />
            ภิกษุรูปนั้นเพลิดเพลิน อนุโมทนาพระภาษิต ของพระผู้มีพระภาค<br />
            ลุกจากอาสนะ ถวายบังคม<br />
            กระทำประทักษิณแล้วหลีกไป<br />
            ครั้งนั้นแล<br />
            เธอเป็นผู้ๆเดียว หลีกออกจากหมู่ ไม่ประมาท<br />
            มีความเพียร มีใจมั่นคงอยู่<br />
            ไม่นานเท่าไร ก็ทำให้แจ้งซึ่งที่สุด แห่งพรหมจรรย์อันยอดเยี่ยม<br />
            ที่กุลบุตรทั้งหลาย ออกบวชเป็นบรรพชิต<br />
            โดยชอบต้องการนั้น<br />
            ด้วยปัญญาอันยิ่งด้วยตนเอง<br />
            ในปัจจุบันเข้าถึงอยู่<br />
            รู้ชัดว่าชาติสิ้นแล้ว พรหมจรรย์อยู่จบแล้ว<br />
            กิจที่ควรทำ ทำเสร็จแล้ว<br />
            กิจอื่นเพื่อความเป็นอย่างนี้มิได้มี<br />
            ก็ภิกษุรูปนั้น ได้เป็นพระอรหันต์องค์หนึ่ง<br />
            ในจำนวนพระอรหันต์ทั้งหลาย<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>ปุณณมสูตร</h2>
          </div>
            <h4>
            สมัยหนึ่ง พระผู้มีพระภาค ประทับอยู่ ณ มิคารมาตุปราสาท<br />
            ในพระวิหารบุพพาราม<br />
            ใกล้พระนครสาวัตถี<br />
            พร้อมด้วยพระภิกษุสงฆ์ เป็นอันมาก<br />
            ก็ในสมัยนั้นแล<br />
            ในคืนวันอุโบสถขึ้น ๑๕ ค่ำ<br />
            เป็นวันเพ็ญ มีพระจันทร์เต็มดวง<br />
            พระผู้มีพระภาค อันภิกษุสงฆ์ห้อมล้อมแล้ว<br />
            ประทับนั่งอยู่ในที่แจ้ง<br />
            ครั้งนั้น<br />
            ภิกษุรูปหนึ่งลุกจากอาสนะ<br />
            ทำผ้าอุตตราสงฆ์ เฉวียงบ่าข้างหนึ่งแล้ว<br />
            ประนมมือ ไปทางพระผู้มีพระภาคเจ้า<br />
            ได้กราบทูลพระผู้มีพระภาคว่า<br />
            ข้าแต่พระองค์ผู้เจริญ ข้าพระองค์จะพึงทูลถาม เหตุประการหนึ่ง กะพระผู้มีพระภาค<br />
            ถ้าพระผู้มีพระภาค ทรงประทานโอกาส<br />
            ที่จะพยากรณ์ปัญหา แก่ข้าพระองค์<br />
            พระผู้มีพระภาคตรัสตอบว่า<br />
            ดูกรภิกษุ<br />
            ถ้าเช่นนั้นเธอจงนั่ง ณ อาสนะของตน<br />
            แล้วถามปัญหา ที่เธอมุ่งจำนงเถิด<br />
            ภิกษุนั้น รับพระดำรัส ของพระผู้มีพระภาค<br />
            แล้วนั่ง ณ อาสนะของตน<br />
            ทูลถามปัญหาพระผู้มีพระภาคว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            อุปาทานขันธ์ ๕<br />
            ได้แก่อุปาทานขันธ์คือรูป<br />
            อุปาทานขันธ์คือเวทนา<br />
            อุปาทานขันธ์คือสัญญา<br />
            อุปาทานขันธ์คือสังขาร<br />
            อุปาทานขันธ์คือวิญญาณ<br />
            เหล่านี้ ใช่ไหม พระเจ้าข้า?<br />
            พ. ดูกรภิกษุ<br />
            อุปาทานขันธ์ ๕ ได้แก่อุปาทานขันธ์<br />
            คือ รูป เวทนา สัญญา สังขาร วิญญาณ เหล่านี้แหละภิกษุ',
                        (ว่าด้วยมูลแห่งอุปาทานขันธ์ ๕)<br />
            ภิกษุนั้น ชื่นชมอนุโมทนาภาษิต ของพระผู้มีพระภาคว่า ดีแล้วพระเจ้าข้า<br />
            แล้วได้ทูลถามปัญหาที่ยิ่งขึ้นไปว่า<br />
            อุปาทานขันธ์ ๕ เหล่านี้แล<br />
            มีอะไรเป็นมูลเหตุ พระเจ้าข้า?<br />
            พ. ดูกรภิกษุ<br />
            อุปาทานขันธ์ ๕ เหล่านี้แล<br />
            มีฉันทะเป็นมูลเหตุ ฯลฯ<br />
            ภิ. อุปาทานก็อันนั้น และอุปาทานขันธ์ ๕ ก็อันนั้น<br />
            หรือว่าอุปาทานอื่น จากอุปาทานขันธ์ ๕ พระเจ้าข้า?<br />
            พ. ดูกรภิกษุ<br />
            อุปาทานก็อันนั้น และอุปาทานขันธ์ ๕ ก็อันนั้น หามิได้<br />
            และอุปาทานอื่นจากอุปาทานขันธ์ ๕ ก็หามิได้<br />
            แต่ฉันทราคะ ในอุปาทานขันธ์ ๕ เหล่านั้น เป็นตัวอุปาทาน<br />
            ว่าด้วยฉันทราคะในอุปาทานขันธ์ ๕<br />
            ภิกษุนั้น ชื่นชมอนุโมทนาภาษิต<br />
            ของพระผู้มีพระภาคว่า ดีแล้วพระเจ้าข้า<br />
            แล้วได้ทูลถามปัญหาที่ยิ่งขึ้นไปว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            ก็ฉันทราคะในอุปาทานขันธ์ ๕ แตกต่างกันหรือ?<br />
            พระผู้มีพระภาคตรัสตอบว่า ต่างกันภิกษุ<br />
            ดังนี้แล้ว ได้ตรัสต่อไปว่า<br />
            ดูกรภิกษุ บุคคลบางคนในโลกนี้<br />
            มีความปรารถนาอย่างนี้ว่า<br />
            ในอนาคตกาล<br />
            ขอเราพึงมีรูปเช่นนี้<br />
            พึงมีเวทนาเช่นนี้<br />
            พึงมีสัญญาเช่นนี้<br />
            พึงมีสังขารเช่นนี้<br />
            พึงมีวิญญาณเช่นนี้<br />
            ดูกรภิกษุ ฉันทราคะ ในอุปาทานขันธ์ ๕<br />
            ต่างกันด้วยประการฉะนี้แล<br /><br />

            (ว่าด้วยเหตุที่เรียกว่าขันธ์)<br />
            ภิกษุนั้น<br />
            ชื่นชมอนุโมทนาภาษิต<br />
            ของพระผู้มีพระภาคว่า ดีแล้วพระเจ้าข้า<br />
            แล้วได้ทูลถามปัญหาที่ยิ่งขึ้นไปว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            ด้วยเหตุเพียงเท่าไรหนอ<br />
            ขันธ์ จึงชื่อว่าขันธ์?<br />
            พ. ดูกรภิกษุ<br />
            รูปอย่างใดอย่างหนึ่ง<br />
            ทั้งที่เป็นอดีต อนาคต และปัจจุบัน<br />
            เป็นภายในก็ดี ภายนอกก็ดี<br />
            หยาบก็ดี ละเอียดก็ดี<br />
            เลวก็ดี ประณีตก็ดี<br />
            มีในที่ไกลก็ดี ในที่ใกล้ก็ดี<br />
            นี้เรียกว่ารูปขันธ์<br />
            เวทนาอย่างใดอย่างหนึ่ง ฯลฯ<br />
            นี้เรียกว่าเวทนาขันธ์<br />
            สัญญาอย่างใดอย่างหนึ่ง ฯลฯ<br />
            นี้เรียกว่าสัญญาขันธ์<br />
            สังขารอย่างใดอย่างหนึ่ง ฯลฯ<br />
            นี้เรียกว่าสังขารขันธ์<br />
            วิญญาณอย่างใดอย่างหนึ่ง<br />
            ทั้งที่เป็นอดีต อนาคต และปัจจุบัน<br />
            เป็นภายในก็ดี ภายนอกก็ดี<br />
            หยาบก็ดี ละเอียดก็ดี<br />
            เลวก็ดี ประณีตก็ดี<br />
            มีในที่ไกลก็ดี ในที่ใกล้ก็ดี<br />
            นี้เรียกว่าวิญญาณขันธ์<br />
            ดูกรภิกษุ<br />
            ด้วยเหตุมีประมาณเท่านี้แล<br />
            ขันธ์จึงชื่อว่าขันธ์.<br /><br />

            (ว่าด้วยเหตุปัจจัยแห่งขันธ์ ๕)<br />
            ภิกษุนั้น ชื่นชมอนุโมทนาภาษิต<br />
            ของพระผู้มีพระภาคว่า ดีแล้วพระเจ้าข้า<br />
            แล้วได้ทูลถามปัญหาที่ยิ่งขึ้นไปว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            อะไรหนอ เป็นเหตุเป็นปัจจัย<br />
            ทำให้รูปขันธ์ เวทนาขันธ์ สัญญาขันธ์ สังขารขันธ์ วิญญาณขันธ์ ปรากฏ?<br />
            พ. ดูกรภิกษุ<br />
            มหาภูตรูป ๔ แล เป็นเหตุเป็นปัจจัย ทำให้รูปขันธ์ปรากฏ<br />
            ผัสสะ เป็นเหตุเป็นปัจจัย ทำให้เวทนาขันธ์ปรากฏ<br />
            ผัสสะ เป็นเหตุเป็นปัจจัย ทำให้สัญญาขันธ์ปรากฏ<br />
            ผัสสะ เป็นเหตุเป็นปัจจัย ทำให้สังขารขันธ์ปรากฏ<br />
            นามรูป เป็นเหตุเป็นปัจจัย ทำให้วิญญาณขันธ์ปรากฏ<br /><br />

            (ว่าด้วยเหตุเกิดสักกายทิฏฐิ)<br />
            ภิกษุนั้น<br />
            ชื่นชมอนุโมทนาภาษิต<br />
            ของพระผู้มีพระภาคว่า ดีแล้วพระเจ้าข้า<br />
            แล้วได้ทูลถามปัญหาที่ยิ่งขึ้นไปว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            สักกายทิฏฐิมีได้อย่างใดหนอ?<br />
            พ. ดูกรภิกษุ ปุถุชนในโลกนี้<br />
            ผู้ยังมิได้สดับ<br />
            เป็นผู้ไม่ได้เห็นพระอริยเจ้า<br />
            ไม่ฉลาดในอริยธรรม<br />
            ไม่ได้รับแนะนำในอริยธรรม<br />
            เป็นผู้ไม่ได้เห็นสัตบุรุษ<br />
            ไม่ฉลาดในสัปปุริสธรรม<br />
            ไม่ได้รับแนะนำในสัปปุริสธรรม<br />
            ย่อมเห็นรูป โดยความเป็นตน ย่อมเห็นตนมีรูป ย่อมเห็นรูปในตน ย่อมเห็นตนในรูป<br />
            ย่อมเห็นเวทนา โดยความเป็นตน ย่อมเห็นตนมีเวทนา ย่อมเห็นเวทนาในตน ย่อมเห็นตนในเวทนา<br />
            ย่อมเห็นสัญญา โดยความเป็นตน ย่อมเห็นตนมีสัญญา ย่อมเห็นสัญญาในตน ย่อมเห็นตนในสัญญา<br />
            ย่อมเห็นสังขาร โดยความเป็นตน ย่อมเห็นตนมีสังขาร ย่อมเห็นสังขารในตน ย่อมเห็นตนในสังขาร<br />
            ย่อมเห็นวิญญาณ โดยความเป็นตน ย่อมเห็นตนมีวิญญาณ ย่อมเห็นวิญญาณในตน ย่อมเห็นตนในวิญญาณ.<br />
            ดูกรภิกษุ<br />
            สักกายทิฏฐิมีได้ด้วยอาการเช่นนี้แล<br /><br />

            (ว่าด้วยเหตุจะไม่มีสักกายทิฏฐิ)<br />
            ภิกษุนั้น ชื่นชมอนุโมทนาภาษิต<br />
            ของพระผู้มีพระภาคว่า ดีแล้วพระเจ้าข้า<br />
            แล้วได้ทูลถามปัญหาที่ยิ่งขึ้นไปว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            สักกายทิฏฐิย่อมไม่มีได้อย่างไร?<br />
            พ. ดูกรภิกษุ<br />
            อริยสาวกในธรรมวินัยนี้<br />
            ผู้ได้สดับแล้ว<br />
            เป็นผู้ได้เห็นพระอริยเจ้า<br />
            ฉลาดในอริยธรรม<br />
            ได้รับแนะนำแล้วเป็นอย่างดี ในอริยธรรม<br />
            เป็นผู้ได้เห็นสัตบุรุษ<br />
            ฉลาดในสัปปุริสธรรม<br />
            ได้รับแนะนำแล้ว เป็นอย่างดีในสัปปุริสธรรม<br />
            ย่อมไม่เห็นรูป โดยความเป็นตน ไม่เห็นตนมีรูป ไม่เห็นรูปในตน หรือไม่เห็นตนในรูป<br />
            ย่อมไม่เห็นเวทนา โดยความเป็นตน ไม่เห็นตนมีเวทนา ไม่เห็นเวทนาในตน หรือไม่เห็นตนในเวทนา<br />
            ย่อมไม่เห็นสัญญา โดยความเป็นตน ไม่เห็นตนมีสัญญา ไม่เห็นสัญญาในตน หรือไม่เห็นตนในสัญญา<br />
            ย่อมไม่เห็นสังขาร โดยความเป็นตน ไม่เห็นตนมีสังขาร ไม่เห็นสังขารมีในตน หรือไม่เห็นตนในสังขาร<br />
            ย่อมไม่เห็นวิญญาณ โดยความเป็นตน ไม่เห็นตนมีวิญญาณ ไม่เห็นวิญญาณในตน หรือไม่เห็นตนในวิญญาณ<br />
            ดูกรภิกษุ<br />
            สักกายทิฏฐิ ย่อมไม่มีด้วยอาการเช่นนี้แล<br /><br />

            (ว่าด้วยคุณโทษและอุบาย สลัดออกแห่งอุปาทานขันธ์)<br />
            ภิกษุนั้น ชื่นชมอนุโมทนาภาษิต<br />
            ของพระผู้มีพระภาคว่า ดีแล้วพระเจ้าข้า<br />
            แล้วได้ทูลถามปัญหาที่ยิ่งขึ้นไปว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            อะไรหนอ เป็นคุณ เป็นโทษ<br />
            เป็นเครื่องสลัดออก แห่งรูป แห่งเวทนา แห่งสัญญา แห่งสังขาร แห่งวิญญาณ?<br />
            พ. ดูกรภิกษุ<br />
            สุขโสมนัส อาศัยรูปเกิดขึ้น<br />
            นี้เป็นคุณแห่งรูป<br />
            รูปไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            นี้เป็นโทษแห่งรูป<br />
            การกำจัดฉันทราคะ<br />
            การละฉันทราคะในรูปเสียได้<br />
            นี้เป็นเครื่องสลัดออกแห่งรูป<br />
            สุขโสมนัส อาศัยเวทนาเกิดขึ้น ฯลฯ<br />
            อาศัยสัญญาเกิดขึ้น ฯลฯ<br />
            อาศัยสังขารเกิดขึ้น<br />
            อาศัยวิญญาณเกิดขึ้น<br />
            นี้เป็นคุณแห่งวิญญาณ<br />
            วิญญาณไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            นี้เป็นโทษแห่งวิญญาณ<br />
            การกำจัดฉันทราคะ<br />
            การละฉันทราคะในวิญญาณเสียได้<br />
            นี้เป็นเครื่องสลัดออกแห่งวิญญาณ.<br /><br />

            (ว่าด้วยการไม่มีอหังการ มมังการและมานานุสัย)<br />
            ภิกษุนั้น ชื่นชมอนุโมทนาภาษิต<br />
            ของพระผู้มีพระภาคว่า ดีแล้วพระเจ้าข้า<br />
            แล้วได้ทูลถามปัญหาที่ยิ่งขึ้นไปอีกว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            เมื่อบุคคลรู้อยู่อย่างไร<br />
            เห็นอยู่อย่างไร<br />
            จึงจะไม่มีอหังการ มมังการ และมานานุสัย<br />
            ในกายที่มีวิญญาณนี้<br />
            และในสรรพนิมิตภายนอก?<br />
            พ. ดูกรภิกษุ<br />
            รูปอย่างใดอย่างหนึ่ง ทั้งที่เป็นอดีต อนาคต และปัจจุบัน<br />
            เป็นภายในก็ดี ภายนอกก็ดี<br />
            หยาบก็ดี ละเอียดก็ดี<br />
            เลวก็ดี ประณีตก็ดี<br />
            มีในที่ไกลก็ดี ในที่ใกล้ก็ดี<br />
            อริยสาวกย่อมพิจารณา เห็นรูปทั้งหมดนั้น<br />
            ด้วยปัญญาอันชอบ ตามความเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา นั่นไม่เป็นเรา นั่นไม่ใช่ตัวตนของเรา<br />
            เวทนาอย่างใดอย่างหนึ่ง<br />
            สัญญาอย่างใดอย่างหนึ่ง<br />
            สังขารอย่างใดอย่างหนึ่ง<br />
            วิญญาณอย่างใดอย่างหนึ่ง<br />
            ทั้งที่เป็นอดีต อนาคต และปัจจุบัน<br />
            เป็นภายในก็ดี ภายนอกก็ดี<br />
            หยาบก็ดี ละเอียดก็ดี<br />
            เลวก็ดี ประณีตก็ดี<br />
            มีในที่ไกลก็ดี ในที่ใกล้ก็ดี<br />
            อริยสาวกย่อมพิจารณา เห็นวิญญาณทั้งหมดนั้น<br />
            ด้วยปัญญาอันชอบ ตามความเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา นั่นไม่เป็นเรา นั่นไม่ใช่ตัวตนของเรา<br />
            ดูกรภิกษุ<br />
            เมื่อบุคคลรู้อยู่อย่างนี้<br />
            เห็นอยู่อย่างนี้แล<br />
            จึงจะไม่มีอหังการ มมังการ และมานานุสัย<br />
            ในกายที่มีวิญญาณนี้<br />
            และสรรพนิมิตภายนอก<br /><br />

            (ว่าด้วยกรรมที่อนัตตากระทำจะถูกต้องอัตตา)<br />
            ก็โดยสมัยนั้นแล<br />
            ภิกษุรูปหนึ่ง<br />
            ได้เกิดความปริวิตกแห่งใจขึ้นว่า<br />
            ท่านผู้เจริญทั้งหลาย ได้ยินว่า<br />
            ด้วยประการดังนี้แล<br />
            รูปเป็นอนัตตา เวทนา สัญญา สังขาร วิญญาณ เป็นอนัตตา<br />
            กรรมที่อนัตตากระทำ<br />
            จักถูกต้องอัตตา<br />
            คือกรรมได้อย่างไร?<br />
            ครั้งนั้นแล พระผู้มีพระภาค ทรงทราบความปริวิตกแห่งใจ<br />
            ของภิกษุนั้นด้วยพระทัยแล้ว<br />
            ได้ตรัสเรียกภิกษุทั้งหลาย มาตรัสว่า<br />
            ดูกรภิกษุทั้งหลาย<br />
            ข้อที่โมฆบุรุษบางคน ในธรรมวินัยนี้<br />
            เป็นผู้ตกอยู่ในอำนาจอวิชชา<br />
            มีใจถูกตัณหาครอบงำ<br />
            จะพึงสำคัญสัตถุศาสน์<br />
            ว่าเป็นคำสอนที่ควรคิด<br />
            ให้ตระหนักว่า ท่านผู้เจริญทั้งหลาย<br />
            ได้ยินว่า ด้วยประการดังนี้แล<br />
            รูปเป็นอนัตตา เวทนา สัญญา สังขาร วิญญาณ เป็นอนัตตา<br />
            กรรมที่อนัตตากระทำ<br />
            จักถูกต้องอัตตา<br />
            คือกรรมได้อย่างไร?<br />
            นี้เป็นฐานะที่จะมีได้<br />
            ดูกรภิกษุทั้งหลาย<br />
            เธอทั้งหลาย อันเราได้แนะนำไว้แล้ว<br />
            ด้วยการทวนถามในธรรมนั้นๆ<br />
            ในบาลีประเทศนั้นๆ<br />
            จะสำคัญความข้อนั้นเป็นไฉน<br />
            รูปเที่ยงหรือไม่เที่ยง?<br />
            ภิกษุเหล่านั้นกราบทูลว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br />
            พ. เวทนา สัญญา สังขาร วิญญาณ เที่ยงหรือไม่เที่ยง?<br />
            ภิ. ไม่เที่ยง พระเจ้าข้า.<br />
            พ. ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า?<br />
            ภิ. เป็นทุกข์ พระเจ้าข้า.<br />
            พ. ก็สิ่งใดไม่เที่ยง เป็นทุกข์<br />
            มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตาม เห็นสิ่งนั้นว่า นั่นของเรา นั่นเป็นเรา นั่นเป็นตัวตนของเรา?<br />
            ภิ. ไม่ควรเห็นอย่างนั้น พระเจ้าข้า.<br />
            พ. เพราะเหตุนั้นแล ฯลฯ<br />
            อริยสาวกผู้ได้สดับแล้ว เห็นอยู่อย่างนี้ ฯลฯ<br />
            ย่อมทราบชัดว่า ฯลฯ<br />
            กิจอื่นเพื่อความเป็นอย่างนี้มิได้มี ฉะนี้แล.<br /><br /><hr /><br />
            </h4>
            <a href="/sixth/lesson0604">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ยมกสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0603;