import React from 'react';

const Lesson0606 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>สมุทยธัมมสูตรที่ ๑</h2>
          </div>
            <h4>
            พระนครสาวัตถี<br />
            ครั้งนั้นแล ภิกษุรูปหนึ่ง<br />
            เข้าไปเฝ้าพระผู้มีพระภาค ถึงที่ประทับ ฯลฯ<br />
            ครั้นแล้ว<br />
            ได้ทูลถามพระผู้มีพระภาคว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            ที่เรียกว่า อวิชชา อวิชชา ดังนี้<br />
            อวิชชาเป็นไฉนหนอแล<br />
            และบุคคลเป็นผู้ประกอบ ด้วยอวิชชาด้วยเหตุเพียงเท่าไร?<br />
            พระผู้มีพระภาคตรัสตอบว่า<br />
            ดูกรภิกษุ<br />
            ปุถุชนผู้ไม่ได้สดับแล้วในโลกนี้ ย่อมไม่รู้ชัด ตามความเป็นจริง<br />
            ซึ่งรูปอันมีความเกิดขึ้น เป็นธรรมดาว่า รูปมีความเกิดขึ้นเป็นธรรมดา<br />
            ย่อมไม่รู้ชัด ตามความเป็นจริง ซึ่งรูปอันมีความเสื่อมไป เป็นธรรมดาว่า<br />
            รูปมีความเสื่อมไปเป็นธรรมดา<br />
            ย่อมไม่รู้ชัด ตามความเป็นจริง ซึ่งรูปอันมีความเกิดขึ้น และความเสื่อมไป เป็นธรรมดาว่า<br />
            รูปมีความเกิดขึ้น และความเสื่อมไปเป็นธรรมดา<br />
            ย่อมไม่รู้ชัด ตามความเป็นจริง ซึ่งเวทนา<br />
            ย่อมไม่รู้ชัดตาม ความเป็นจริง ซึ่งสัญญา<br />
            ย่อมไม่รู้ชัด ตามความเป็นจริง ซึ่งสังขาร<br />
            ย่อมไม่รู้ชัด ตามความเป็นจริง ซึ่งวิญญาณ อันมีความเกิดขึ้น เป็นธรรมดาว่า<br />
            วิญญาณมีความเกิดขึ้น เป็นธรรมดา<br />
            ย่อมไม่รู้ชัด ตามความเป็นจริง ซึ่งวิญญาณ<br />
            อันมีความเสื่อมไป เป็นธรรมดาว่า<br />
            วิญญาณมีความเสื่อมไป เป็นธรรมดา<br />
            ย่อมไม่รู้ชัด ตามความเป็นจริง ซึ่งวิญญาณ<br />
            อันมีความเกิดขึ้น และความเสื่อมไป เป็นธรรมดาว่า<br />
            วิญญาณมีความเกิดขึ้น และความเสื่อมไป เป็นธรรมดา<br />
            ดูกรภิกษุ นี้เรียกว่า อวิชชา และบุคคล เป็นผู้ประกอบด้วยอวิชชา<br />
            ด้วยเหตุเพียงเท่านี้<br /><br />

            เมื่อพระผู้มีพระภาค ตรัสอย่างนี้แล้ว<br />
            ภิกษุนั้นทูลถามว่า<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            ที่เรียกว่า วิชชา วิชชา ดังนี้<br />
            วิชชาเป็นไฉนหนอแล<br />
            และบุคคล เป็นผู้ประกอบด้วยวิชชา<br />
            ด้วยเหตุเพียงเท่าไร?<br />
            พระผู้มีพระภาคตรัสตอบว่า<br />
            ดูกรภิกษุ<br />
            อริยสาวกผู้ได้สดับแล้ว ในธรรมวินัยนี้<br />
            ย่อมรู้ชัดตามความเป็นจริง ซึ่งรูป อันมีความเกิดขึ้น เป็นธรรมดาว่า<br />
            รูปมีความเกิดขึ้น เป็นธรรมดา<br />
            ย่อมรู้ชัดตามความเป็นจริง ซึ่งรูป อันมีความเสื่อมไป เป็นธรรมดาว่า<br />
            รูปมีความเสื่อมไป เป็นธรรมดา<br />
            ย่อมรู้ชัดตามความเป็นจริง ซึ่งรูป อันมีความเกิดขึ้น และความเสื่อมไป เป็นธรรมดาว่า<br />
            รูปมีความเกิดขึ้น และความเสื่อมไป เป็นธรรมดา<br />
            ย่อมรู้ชัดตามความเป็นจริง ซึ่งเวทนา<br />
            ย่อมรู้ชัดตามความเป็นจริง ซึ่งสัญญา<br />
            ย่อมรู้ชัดตามความเป็นจริง ซึ่งสังขาร<br />
            ย่อมรู้ชัดตามความเป็นจริง ซึ่งวิญญาณ<br />
            อันมีความเกิดขึ้น เป็นธรรมดาว่า<br />
            วิญญาณมีความเกิดขึ้น เป็นธรรมดา<br />
            ย่อมรู้ชัดตามความเป็นจริง ซึ่งวิญญาณ<br />
            อันมีความเสื่อมไป เป็นธรรมดาว่า<br />
            วิญญาณมีความเสื่อมไป เป็นธรรมดา<br />
            ย่อมรู้ชัดตามความเป็นจริง ซึ่งวิญญาณ<br />
            อันมีความเกิดขึ้น และความเสื่อมไป เป็นธรรมดาว่า<br />
            วิญญาณมีความ เกิดขึ้นและเสื่อมไป เป็นธรรมดา<br />
            ดูกรภิกษุ นี้เรียกว่า วิชชา<br />
            และบุคคลเป็นผู้ประกอบด้วยวิชชา<br />
            ด้วยเหตุเพียงเท่านี้แล<br /><br /><hr /><br />
            </h4>
        </div>
      </section>
    </div>
  )
}

export default Lesson0606;