import React from 'react';

const Lesson0601 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>นกุลปิตาสูตร</h2>
          </div>
            <h4>
            ข้าพเจ้าได้สดับมาแล้วอย่างนี้<br />
            สมัยหนึ่ง พระผู้มีพระภาคประทับอยู่ ณ เภสกฬาวัน<br />
            อันเป็นสถานที่ให้อภัยแก่หมู่มฤค<br />
            ใกล้เมืองสุงสุมารคิระ<br />
            ในภัคคชนบท ฯลฯ<br />
            ครั้งนั้นแล คฤหบดีชื่อนกุลบิดา<br />
            เข้าไปเฝ้าพระผู้มีพระภาค<br />
            ถวายอภิวาทแล้ว นั่ง ณ ที่ควร<br />
            ส่วนข้างหนึ่งแล้ว<br />
            ได้กราบทูลพระผู้มีพระภาคว่า<br />
            พระพุทธเจ้าข้า<br />
            ข้าพระองค์เป็นผู้แก่เฒ่า เป็นผู้ใหญ่<br />
            ล่วงกาลผ่านวัยแล้วโดยลำดับ<br />
            มีกายกระสับกระส่าย<br />
            เจ็บป่วยเนืองๆ พระพุทธเจ้าข้า<br />
            ก็ข้าพระองค์มิได้เห็น พระผู้มีพระภาคและภิกษุทั้งหลาย<br />
            ผู้ให้เจริญใจอยู่เป็นนิตย์<br />
            ขอพระผู้มีพระภาค โปรดสั่งสอนข้าพระองค์<br />
            ขอพระผู้มีพระภาค<br />
            โปรดพร่ำสอนข้าพระองค์<br />
            ด้วยธรรมที่เป็นไปเพื่อประโยชน์<br />
            เพื่อความสุขแก่ข้าพระองค์ ตลอดกาลนานเถิด<br /><br />

            พระผู้มีพระภาคตรัสว่า<br />
            นั่นถูกแล้วๆ คฤหบดี<br />
            อันที่จริง กายนี้กระสับกระส่าย<br />
            เป็นดังว่าฟองไข่<br />
            อันผิวหนังหุ้มไว้<br />
            ดูกรคฤหบดี<br />
            ก็บุคคลผู้บริหารกายนี้อยู่<br />
            พึงรับรองความเป็นผู้ไม่มีโรคได้<br />
            แม้เพียงครู่เดียว จะมีอะไรเล่า<br />
            นอกจากความเป็นคนเขลา<br />
            ดูกรคฤหบดี เพราะเหตุนั้นแหละ<br />
            ท่านพึงศึกษาอย่างนี้ว่า<br />
            เมื่อเรามีกายกระสับกระส่ายอยู่<br />
            จิตของเราจักไม่กระสับกระส่าย<br />
            ดูกรคฤหบดี<br />
            ท่านพึงศึกษาอย่างนี้แล<br />
            ครั้งนั้นแล<br />
            คฤหบดีชื่อนกุลบิดา<br />
            ชื่นชมยินดีพระภาษิต<br />
            ของพระผู้มีพระภาค<br />
            ลุกจากอาสนะ<br />
            ถวายอภิวาทพระผู้มีพระภาค<br />
            ทำประทักษิณแล้ว<br /><br />

            เข้าไปหาท่านพระสารีบุตร<br />
            อภิวาทแล้ว<br />
            นั่งอยู่ ณ ที่ควรส่วนข้างหนึ่ง<br />
            ท่านพระสารีบุตร ได้กล่าวกะนกุลปิตคฤหบดีว่า<br />
            คฤหบดี อินทรีย์ของท่านผ่องใสนัก<br />
            สีหน้าของท่านบริสุทธิ์ เปล่งปลั่ง<br />
            วันนี้ ท่านได้ฟังธรรมีกถา<br />
            ในที่เฉพาะพระพักตร์ พระผู้มีพระภาคหรือ?<br />
            นกุลปิตคฤหบดีตอบว่า<br />
            ข้าแต่ท่านผู้เจริญ<br />
            ไฉนจะไม่เป็นอย่างนี้เล่า<br />
            พระผู้มีพระภาค ทรงหลั่งอมฤตธรรม รดข้าพเจ้าด้วยธรรมีกถา.<br />
            ส. ดูกรคฤหบดี<br />
            พระผู้มีพระภาคทรงหลั่งอมฤตธรรม รดท่านด้วยธรรมีกถาอย่างไรเล่า?<br />
            น. ข้าแต่ท่านผู้เจริญ<br />
            ข้าพเจ้าเข้าไปเฝ้าพระผู้มีพระภาค<br />
            ถวายอภิวาทแล้ว<br />
            นั่งอยู่ ณ ที่ควรส่วนข้างหนึ่งแล้ว<br />
            ได้กราบทูลพระผู้มีพระภาคว่า พระพุทธเจ้าข้า<br />
            ข้าพระองค์เป็นผู้แก่เฒ่า เป็นผู้ใหญ่<br />
            ล่วงกาลผ่านวัยแล้วโดยลำดับ<br />
            มีกายกระสับกระส่ายเจ็บป่วยเนืองๆ พระพุทธเจ้าข้า<br />
            ก็ข้าพระองค์ มิได้เห็นพระผู้มีพระภาค<br />
            และภิกษุทั้งหลาย<br />
            ผู้ให้เจริญใจอยู่เป็นนิตย์<br />
            ขอพระผู้มีพระภาค โปรดสั่งสอนข้าพระองค์<br />
            ขอพระผู้มีพระภาค โปรดพร่ำสอนข้าพระองค์<br />
            ด้วยธรรมที่เป็นไปเพื่อประโยชน์<br />
            เพื่อความสุขแก่ข้าพระองค์ ตลอดกาลนานเถิด<br />
            เมื่อข้าพเจ้ากราบทูลอย่างนี้แล้ว<br />
            พระผู้มีพระภาคตรัสว่า นั่นถูกแล้วๆ คฤหบดี<br />
            อันที่จริงกายนี้กระสับกระส่าย<br />
            เป็นดังว่าฟองไข่ อันผิวหนังหุ้มไว้<br />
            ดูกรคฤหบดี ก็บุคคลผู้บริหารกายนี้อยู่<br />
            พึงรับรองความเป็นผู้ไม่มีโรค ได้แม้เพียงครู่เดียว<br />
            จะมีอะไรเล่า นอกจากความเป็นคนเขลา<br />
            ดูกรคฤหบดี เพราะเหตุนั้นแหละ<br />
            ท่านพึงศึกษาอย่างนี้ว่า<br />
            เมื่อเรามีกายกระสับกระส่ายอยู่<br />
            จิตของเราจักไม่กระสับกระส่าย<br />
            ดูกรคฤหบดี ท่านพึงศึกษาอย่างนี้แล<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            พระผู้มีพระภาคทรงหลั่งอมฤตธรรม<br />
            รดข้าพเจ้าด้วยธรรมีกถาอย่างนี้แล.<br />
            ส. ดูกรคฤหบดี<br />
            ก็ท่านมิได้ทูลสอบถาม<br />
            พระผู้มีพระภาคต่อไปว่า พระพุทธเจ้าข้า ด้วยเหตุเท่าไรหนอ?<br />
            บุคคลจึงชื่อว่า เป็นผู้มีกายกระสับกระส่าย<br />
            และเป็นผู้มีจิตกระสับกระส่าย<br />
            และก็ด้วยเหตุเท่าไรหนอ?<br />
            บุคคลแม้เป็นผู้มีกายกระสับกระส่าย<br />
            แต่หาเป็นผู้มีจิตกระสับกระส่ายไม่<br />
            น. ข้าแต่ท่านผู้เจริญ<br />
            ข้าพเจ้ามาแม้แต่ที่ไกล<br />
            เพื่อจะทราบเนื้อความแห่งภาษิตนั้น<br />
            ในสำนักท่านพระสารีบุตร ดีละหนอ<br />
            ขอเนื้อความแห่งภาษิตนั้นจงแจ่มแจ้ง<br />
            กะท่านพระสารีบุตรเถิด.<br /><br />

            ส. ดูกรคฤหบดี ถ้าเช่นนั้น<br />
            ท่านจงฟัง จงใส่ใจให้ดี เราจักกล่าว.<br />
            นกุลปิตคฤหบดี<br />
            รับคำท่านพระสารีบุตรแล้ว<br />
            ท่านพระสารีบุตรจึงได้กล่าวว่า<br />
            (สักกายทิฏฐิ ๒๐)<br />
            ดูกรคฤหบดี ก็อย่างไรเล่า?<br />
            บุคคลจึงชื่อว่า เป็นผู้มีกายกระสับกระส่ายด้วย<br />
            จึงชื่อว่าเป็นผู้มีจิตกระสับกระส่ายด้วย<br />
            ดูกรคฤหบดี<br />
            คือปุถุชนผู้มิได้สดับแล้วในโลกนี้<br />
            มิได้เห็นพระอริยะทั้งหลาย<br />
            ไม่ฉลาดในธรรมของพระอริยะ<br />
            มิได้รับแนะนำในอริยธรรม<br />
            มิได้เห็นสัตบุรุษทั้งหลาย<br />
            ไม่ฉลาดในธรรมของสัตบุรุษ<br />
            มิได้รับแนะนำในสัปปุริสธรรม<br />
            ย่อมเห็นรูปโดย ความเป็นตน ๑<br />
            ย่อมเห็นตนมีรูป ๑<br />
            ย่อมเห็นรูปในตน ๑<br />
            ย่อมเห็นตนในรูป ๑<br />
            เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นรูป รูปของเรา<br />
            เมื่อเขาตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นรูป รูปของเรา<br />
            รูปนั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะรูปแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส<br />
            และอุปายาสจึงเกิดขึ้น<br />
            ย่อมเห็นเวทนาโดยความเป็นตน ๑<br />
            ย่อมเห็นตนมีเวทนา ๑<br />
            ย่อมเห็นเวทนาในตน ๑<br />
            ย่อมเห็นตนในเวทนา ๑<br />
            เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นเวทนา เวทนาของเรา<br />
            เมื่อเขาตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นเวทนา เวทนาของเรา<br />
            เวทนานั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะเวทนาแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์โทมนัส<br />
            และอุปายาสจึงเกิดขึ้น<br />
            ย่อมเห็นสัญญาโดยความเป็นตน ๑<br />
            ย่อมเห็นตนมีสัญญา ๑<br />
            ย่อมเห็นสัญญาในตน ๑<br />
            ย่อมเห็นตนในสัญญา ๑<br />
            เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นสัญญา สัญญาของเรา<br />
            เมื่อเขาตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นสัญญา สัญญาของเรา<br />
            สัญญานั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะสัญญาแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส<br />
            และอุปายาสจึงเกิดขึ้น.<br />
            ย่อมเห็นสังขารโดยความเป็นตน ๑<br />
            ย่อมเห็นตนมีสังขาร ๑<br />
            ย่อมเห็นสังขารในตน ๑<br />
            ย่อมเห็นตนในสังขาร ๑<br />
            เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นสังขาร สังขารของเรา<br />
            เมื่อเขาตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นสังขาร สังขารของเรา<br />
            สังขารนั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะสังขารแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส<br />
            และอุปายาสจึงเกิดขึ้น<br />
            ย่อมเห็นวิญญาณโดยความเป็นตน ๑<br />
            ย่อมเห็นตนมีวิญญาณ ๑<br />
            ย่อมเห็นวิญญาณในตน ๑<br />
            ย่อมเห็นตนในวิญญาณ ๑<br />
            เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นวิญญาณ วิญญาณของเรา<br />
            เมื่อเขาตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นวิญญาณ วิญญาณของเรา<br />
            วิญญาณนั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะวิญญาณแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส<br />
            และอุปายาสจึงเกิดขึ้น<br />
            ดูกรคฤหบดี  ด้วยเหตุอย่างนี้แล<br />
            บุคคลจึงชื่อว่าเป็นผู้มีกายกระสับกระส่าย<br />
            และเป็นผู้มีจิตกระสับกระส่าย<br /><br />

            ดูกรคฤหบดี ก็อย่างไรเล่า?<br />
            บุคคลแม้เป็นผู้มีกายกระสับกระส่าย<br />
            แต่หาเป็นผู้มีจิตกระสับกระส่ายไม่<br />
            ดูกรคฤหบดี คือ อริยสาวกผู้ได้สดับแล้ว<br />
            ในธรรมวินัยนี้ ผู้เห็นพระอริยะทั้งหลาย<br />
            ผู้ฉลาดในธรรมของพระอริยะ<br />
            ผู้ได้รับแนะนำดีแล้วในอริยธรรม<br />
            ผู้เห็นสัตบุรุษทั้งหลาย<br />
            ผู้ฉลาดในธรรมของสัตบุรุษ<br />
            ผู้ได้รับแนะนำดีแล้วในสัปปุริสธรรม<br />
            ย่อมไม่เห็นรูปโดยความเป็นตน ๑<br />
            ย่อมไม่เห็นตนมีรูป ๑<br />
            ย่อมไม่เห็นรูปในตน ๑<br />
            ย่อมไม่เห็นตนในรูป ๑<br />
            ไม่เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นรูป รูปของเรา<br />
            เมื่ออริยสาวกนั้น ไม่ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นรูป รูปของเรา<br />
            รูปนั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะรูปแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส<br />
            และอุปายาสจึงไม่เกิดขึ้น<br />
            ย่อมไม่เห็นเวทนาโดยความเป็นตน ๑<br />
            ย่อมไม่เห็นตนมีเวทนา ๑<br />
            ย่อมไม่เห็นเวทนาในตน ๑<br />
            ย่อมไม่เห็นตนในเวทนา ๑<br />
            ไม่เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นเวทนา เวทนาของเรา<br />
            เมื่ออริยสาวกนั้น ไม่ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นเวทนา เวทนาของเรา<br />
            เวทนานั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะเวทนาแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส<br />
            และอุปายาสจึงไม่เกิดขึ้น<br />
            ย่อมไม่เห็นสัญญาโดยความเป็นตน ๑<br />
            ย่อมไม่เห็นตนมีสัญญา ๑<br />
            ย่อมไม่เห็นสัญญาในตน ๑<br />
            ย่อมไม่เห็นตนในสัญญา ๑<br />
            ไม่เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นสัญญา สัญญาของเรา<br />
            เมื่ออริยสาวกนั้น ไม่ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นสัญญา สัญญาของเรา<br />
            สัญญานั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะสัญญาแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส<br />
            และอุปายาสจึงไม่เกิดขึ้น<br />
            ย่อมไม่เห็นสังขารโดยความเป็นตน ๑<br />
            ย่อมไม่เห็นตนมีสังขาร ๑<br />
            ย่อมไม่เห็นสังขารในตน ๑<br />
            ย่อมไม่เห็นตนในสังขาร ๑<br />
            ไม่เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นสังขารสังขารของเรา<br />
            เมื่ออริยสาวกนั้น ไม่ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นสังขาร สังขารของเรา<br />
            สังขารนั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะสังขารแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส<br />
            และอุปายาสจึงไม่เกิดขึ้น<br />
            ย่อมไม่เห็นวิญญาณโดยความเป็นตน ๑<br />
            ย่อมไม่เห็นตนมีวิญญาณ ๑<br />
            ย่อมไม่เห็นวิญญาณในตน ๑<br />
            ย่อมไม่เห็นตนในวิญญาณ ๑<br />
            ไม่เป็นผู้ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นวิญญาณ วิญญาณของเรา<br />
            เมื่ออริยสาวกนั้น ไม่ตั้งอยู่ด้วยความยึดมั่นว่า<br />
            เราเป็นวิญญาณ วิญญาณของเรา<br />
            วิญญาณนั้นย่อมแปรปรวนเป็นอย่างอื่นไป<br />
            เพราะวิญญาณแปรปรวนเป็นอย่างอื่นไป<br />
            โสกะ ปริเทวะ ทุกข์  โทมนัส<br />
            และอุปายาสจึงไม่เกิดขึ้น<br />
            ดูกรคฤหบดี อย่างนี้แล<br />
            บุคคลแม้มีกายกระสับกระส่าย<br />
            แต่หาเป็นผู้มีจิตกระสับกระส่ายไม่<br />
            ท่านพระสารีบุตรได้กล่าวคำเช่นนี้แล้ว<br />
            นกุลปิตคฤหบดี ชื่นชมยินดีภาษิตของท่าน<br />
            พระสารีบุตร ฉะนี้แล<br /><br /><hr /><br />
            </h4>
            <a href="/sixth/lesson0602">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                เทวทหสูตร ภารสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0601;