import React from 'react';

const Lesson0605 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>อนุราธสูตร</h2>
          </div>
            <h4>
            สมัยหนึ่งพระผู้มีพระภาค ประทับอยู่ ณ กูฏาคารศาลา ป่ามหาวัน<br />
            ใกล้พระนครเวสาลี<br />
            ก็สมัยนั้น<br />
            ท่านพระอนุราธะ อยู่ที่กระท่อมในป่า<br />
            ไม่ไกลพระผู้มีพระภาค<br />
            ครั้งนั้น<br />
            อัญญเดียรถีย์ปริพาชก พากันเข้าไปหา ท่านพระอนุราธะจนถึงที่อยู่<br />
            ได้สนทนาปราศรัย กับท่านพระอนุราธะ<br />
            ครั้นผ่านการสนทนาปราศรัย พอให้ระลึกถึงกันแล้ว<br />
            จึงนั่ง ณ ที่ควรส่วนข้างหนึ่งแล้ว<br />
            จึงได้กล่าวกะท่านอนุราธะว่า<br />
            ดูกรท่านอนุราธะ<br />
            พระตถาคตเป็นอุดมบุรุษ เป็นยอดบุรุษ<br />
            ทรงถึงความบรรลุชั้นเยี่ยม<br />
            เมื่อจะทรงบัญญัติ<br />
            ย่อมทรงบัญญัติ<br />
            ในฐานะ ๔ นี้ คือสัตว์เบื้องหน้าแต่ตายแล้ว<br />
            ย่อมเกิดอีก ๑ ย่อมไม่เกิดอีก ๑ ย่อมเกิดอีกก็มี ย่อมไม่เกิดอีกก็มี ๑ ย่อมไม่เกิดอีก ก็หามิได้ ๑<br />
            เมื่อพวกปริพาชก กล่าวอย่างนั้นแล้ว<br />
            ท่านพระอนุราธะ ได้กล่าวกะอัญญเดียรถีย์ ปริพาชกเหล่านั้นว่า<br />
            ดูกรท่านทั้งหลาย<br />
            พระตถาคตทรงเป็นอุดมบุรุษ ทรงเป็นยอดบุรุษ<br />
            ทรงถึงความบรรลุชั้นเยี่ยม<br />
            เมื่อจะทรงบัญญัติ ย่อมทรงบัญญัติ<br />
            นอกจากฐานะ ๔ เหล่านี้<br />
            คือ สัตว์เบื้องหน้าแต่ตายแล้ว<br />
            ย่อมเกิดอีก ๑ ย่อมไม่เกิดอีก ๑ ย่อมเกิดอีกก็มี ย่อมไม่เกิดก็มี ๑ ย่อมเกิดอีกก็หามิได้ ย่อมไม่เกิดก็หามิได้ ย่อมไม่เกิดอีกก็หามิได้ ๑<br />
            เมื่อท่านพระอนุราธะ กล่าวอย่างนั้นแล้ว<br />
            อัญญเดียรถีย์ปริพาชก เหล่านั้นได้กล่าว กะท่านพระอนุราธะว่า<br />
            ภิกษุนี้จักเป็นภิกษุใหม่ บวชแล้วไม่นาน<br />
            ก็หรือว่าเป็นภิกษุเถระ<br />
            แต่โง่เขลาไม่ฉลาด<br />
            ครั้งนั้น พวกอัญญเดียรถีย์ปริพาชกกล่าว รุกรานท่านพระอนุราธะ<br />
            ด้วยวาทะว่าเป็นภิกษุใหม่ และเป็นผู้โง่เขลาแล้ว<br />
            พากันลุกจากอาสนะหลีกไป<br /><br />

            เมื่ออัญญเดียรถีย์ ปริพาชกเหล่านั้น หลีกไปแล้วไม่นาน<br />
            ท่านพระอนุราธะได้มี ความคิดว่า<br />
            ถ้าอัญญเดียรถีย์ ปริพาชกเหล่านั้น<br />
            พึงถามเราต่อไป เมื่อเราพยากรณ์อย่างไร<br />
            จึงจะชื่อว่า ไม่เป็นผู้กล่าว ตามที่อัญญเดียรถีย์ปริพาชก เหล่านั้นกล่าวแล้ว<br />
            และชื่อว่าเป็นผู้กล่าวตาม ที่พระผู้มีพระภาคตรัสแล้ว<br />
            ไม่พึงกล่าวตู่พระผู้มีพระภาค ด้วยคำอันไม่จริง<br />
            และพึงพยากรณ์ธรรม สมควรแก่ธรรม<br />
            ทั้งการคล้อยตามวาทะที่ถูกไรๆ<br />
            จะไม่พึงถึงฐานะ อันวิญญูชนจะติเตียนได้<br /><br />

            ลำดับนั้น ท่านพระอนุราธะ จึงเข้าไปเฝ้าพระผู้มีพระภาค จนถึงที่ประทับ ฯลฯ<br />
            แล้วกราบทูลพระผู้มีพระภาคว่า ข้าแต่พระองค์ผู้เจริญ<br />
            ขอประทานพระวโรกาส<br />
            ข้าพระองค์อยู่ที่กระท่อมในป่า ไม่ไกลพระผู้มีพระภาค<br />
            ครั้งนั้น พวกอัญญเดียรถีย์ ปริพาชกเป็นอันมาก<br />
            พากันเข้าไปหาข้าพระองค์ถึงที่อยู่ ฯลฯ<br />
            กล่าวกะข้าพระองค์ว่า ดูกรท่านพระอนุราธะ<br />
            พระตถาคตทรงเป็นอุดมบุรุษ ทรงเป็นยอดบุรุษ<br />
            ทรงถึงความบรรลุชั้นเยี่ยม<br />
            เมื่อจะทรงบัญญัติ ในฐานะ ๔ เหล่านี้<br />
            คือ สัตว์เบื้องหน้าแต่ตายแล้ว<br />
            ย่อมเกิดอีก ๑ ย่อมไม่เกิดอีก ๑ ย่อมเกิดอีกก็มี ย่อมไม่เกิดอีกก็มี ๑ ย่อมเกิดก็หามิได้ ย่อมไม่เกิดก็หามิได้ ๑<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            เมื่อพวกอัญญเดียรถีย์ ปริพาชกกล่าวอย่างนี้แล้ว<br />
            ข้าพระองค์จึงได้กล่าว กะพวกเขาว่า<br />
            ดูกรท่านทั้งหลาย<br />
            พระตถาคตทรงเป็นอุดมบุรุษ ทรงเป็นยอดบุรุษ<br />
            ทรงถึงความบรรลุชั้นเยี่ยม<br />
            เมื่อจะทรงบัญญัติ ย่อมทรงบัญญัติ<br />
            นอกจากฐานะ ๔ เหล่านี้ คือ สัตว์เบื้องหน้าแต่ตายแล้ว<br />
            ย่อมเกิดอีก ๑ ย่อมไม่เกิดอีก ๑ ย่อมเกิดอีกก็มี ย่อมไม่เกิดอีกก็มี ๑ ย่อมเกิดอีกก็หามิได้ ย่อมไม่เกิดอีกก็หามิได้ ๑<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            เมื่อข้าพระองค์ กล่าวอย่างนั้นแล้ว<br />
            อัญญเดียรถีย์ปริพาชกเหล่านั้น ได้กล่าวกะข้าพระองค์ว่า<br />
            ภิกษุนี้จักเป็นภิกษุใหม่ บวชไม่นาน<br />
            ก็หรือว่าเป็นเถระ แต่โง่เขลาไม่ฉลาด<br />
            ข้าแต่พระองค์ผู้เจริญ<br />
            อัญญเดียรถีย์ปริพาชกเหล่านั้น รุกรานข้าพระองค์ด้วยวาทะว่า เป็นผู้ใหม่<br />
            เป็นผู้เขลาแล้ว<br />
            ลุกจากอาสนะหลีกไป<br />
            เมื่ออัญญเดียรถีย์ ปริพาชกเหล่านั้น หลีกไปแล้วไม่นาน<br />
            ข้าพระองค์เกิดความคิดว่า ถ้าอัญญเดียรถีย์ ปริพาชกเหล่านั้น<br />
            พึงถามเราต่อไป<br />
            เมื่อเราพยากรณ์อย่างไร^ จึงจะชื่อว่าไม่เป็นผู้กล่าว<br />
            ตามที่อัญญเดียรถีย์ปริพาชก เหล่านั้นกล่าวแล้ว<br />
            และชื่อว่าเป็นผู้กล่าว ตามที่พระผู้มีพระภาคตรัสแล้ว<br />
            ไม่พึงกล่าวตู่พระผู้มีพระภาค ด้วยคำอันไม่จริง<br />
            และพยากรณ์ธรรมสมควรแก่ธรรม<br />
            ทั้งการคล้อยตามวาทะที่ถูกไรๆ จะไม่พึงถึงฐานะ อันวิญญูชนจะติเตียนได้<br /><br />

            พระผู้มีพระภาคตรัสถามว่า<br />
            ดูกรอนุราธะ เธอจะสำคัญความข้อนั้นเป็นไฉน<br />
            รูปเที่ยงหรือไม่เที่ยง?<br />
            อ ไม่เที่ยง พระเจ้าข้า<br />
            พ ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า?<br />
            อ เป็นทุกข์ พระเจ้าข้า<br />
            พ ก็สิ่งใดไม่เที่ยง เป็นทุกข์<br />
            มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้นว่า นั่นของเรา นั่นเป็นเรา นั่นเป็นตัวตนของเรา?<br />
            อ ไม่ควรเห็นอย่างนั้น พระเจ้าข้า<br />
            พ เวทนา สัญญา สังขาร วิญญาณ เที่ยงหรือไม่เที่ยง?<br />
            อ ไม่เที่ยง พระเจ้าข้า<br />
            พ เพราะเหตุนี้แล ฯลฯ<br />
            อริยสาวกผู้ได้สดับแล้ว เห็นอยู่อย่างนี้ ฯลฯ<br />
            ย่อมรู้ชัดว่า ฯลฯ<br />
            กิจอื่นเพื่อความเป็นอย่างนี้มิได้มี<br />
            พ ดูกรอนุราธะ<br />
            เธอจะสำคัญความข้อนั้นเป็นไฉน<br />
            เธอย่อมเห็นรูป ว่าเป็นสัตว์บุคคลหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นเวทนา สัญญา สังขาร วิญญาณว่า เป็นสัตว์บุคคลหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ ดูกรอนุราธะ<br />
            เธอจะสำคัญความข้อนั้นเป็นไฉน<br />
            เธอย่อมเห็นว่า สัตว์บุคคลในรูปหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นว่า สัตว์บุคคลอื่นจากรูปหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นว่า สัตว์บุคคลในเวทนาหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นว่า สัตว์บุคคลอื่นจากเวทนาหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นว่า สัตว์บุคคลในสัญญาหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นว่า สัตว์บุคคลอื่นจากสัญญาหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นว่า สัตว์บุคคลในสังขารหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นว่า สัตว์บุคคลอื่นจากสังขารหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นว่า สัตว์บุคคลในวิญญาณหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ เธอย่อมเห็นว่า สัตว์บุคคลอื่นจากวิญญาณหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ ดูกรอนุราธะ<br />
            เธอจะสำคัญความข้อนั้นเป็นไฉน<br />
            เธอย่อมเห็นว่า สัตว์บุคคล มีรูป มีเวทนา มีสัญญา มีสังขาร มีวิญญาณ อย่างนั้นหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br />
            พ ดูกรอนุราธะ<br />
            เธอจะสำคัญความข้อนั้นเป็นไฉน<br />
            เธอย่อมเห็นว่า สัตว์บุคคลนี้ไม่มีรูป ไม่มีเวทนา ไม่มีสัญญา ไม่มีสังขาร ไม่มีวิญญาณ อย่างนั้นหรือ?<br />
            อ ไม่ใช่อย่างนั้น พระเจ้าข้า<br /><br />

            พ ดูกรอนุราธะ<br />
            ก็โดยที่จริง โดยที่แท้ เธอค้นหาสัตว์บุคคล ในขันธ์ ๕ เหล่านี้ ในปัจจุบันไม่ได้เลย<br />
            ควรแลหรือที่เธอจะพยากรณ์ว่า<br />
            พระตถาคตเป็นอุดมบุรุษ เป็นยอดบุรุษ<br />
            ถึงความบรรลุชั้นเยี่ยม<br />
            เมื่อจะบัญญัติ ย่อมบัญญัติ<br />
            เว้นจากฐานะ ๔ เหล่านี้<br />
            คือ สัตว์เบื้องหน้าแต่ตายแล้ว<br />
            ย่อมเกิดอีก ๑ ย่อมไม่เกิดอีก ๑ ย่อมเกิดอีกก็มี ย่อมไม่เกิดอีกก็มี ๑ ย่อมเกิดอีกก็หามิได้ ย่อมไม่เกิดอีกก็หามิได้ ๑?<br />
            อ ข้อนั้นไม่ควรเลย พระเจ้าข้า<br />
            พ ถูกละๆ อนุราธะ<br />
            ทั้งเมื่อก่อนและทั้งบัดนี้<br />
            เราย่อมบัญญัติทุกข์ และความดับทุกข์<br /><br /><hr /><br />
            </h4>
            <a href="/sixth/lesson0606">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                สมุทยธัมมสูตรที่ ๑
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0605;