import React from 'react';

const Lesson0602 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>เทวทหสูตร</h2>
          </div>
            <h4>
            ข้าพเจ้าได้สดับมาแล้วอย่างนี้<br />
            สมัยหนึ่งพระผู้มีพระภาค ประทับอยู่ ณ นิคมเทวทหะ<br />
            ของศากยะทั้งหลายในสักกชนบท<br />
            ครั้งนั้นแล ภิกษุมากรูปด้วยกัน<br />
            ปรารถนาจะไปสู่ปัจฉาภูมชนบท<br />
            เข้าไปเฝ้าพระผู้มีพระภาค<br />
            ถวายอภิวาทพระผู้มีพระภาคแล้ว<br />
            นั่งอยู่ ณ ที่ควรส่วนข้างหนึ่งแล้ว<br />
            ได้กราบทูลพระผู้มีพระภาคว่า พระพุทธเจ้าข้า<br />
            พวกข้าพระองค์ปรารถนา จะไปสู่ปัจฉาภูมชนบท<br />
            เพื่อสำเร็จการอยู่อาศัย ในปัจฉาภูมชนบท<br />
            พระผู้มีพระภาคตรัสถามว่า<br />
            ดูกรภิกษุทั้งหลาย<br />
            ก็เธอทั้งหลายลาสารีบุตรแล้วหรือ?<br />
            ภิกษุเหล่านั้นกราบทูลว่า พระพุทธเจ้าข้า<br />
            พวกข้าพระองค์ ยังมิได้ลาท่านพระสารีบุตร<br />
            พระผู้มีพระภาคตรัสว่า<br />
            ดูกรภิกษุทั้งหลาย<br />
            เธอทั้งหลายจงไปลาสารีบุตรเถิด<br />
            สารีบุตรเป็นบัณฑิตอนุเคราะห์ เพื่อนพรหมจารี<br />
            ภิกษุเหล่านั้นทูลรับ พระผู้มีพระภาคว่าอย่างนั้น พระพุทธเจ้าข้า<br />
            ก็สมัยนั้นแล<br />
            ท่านพระสารีบุตร<br />
            นั่งอยู่ในมณฑปเล็กๆแห่งหนึ่ง<br />
            ที่มุงด้วยตะใคร่น้ำ<br />
            ไม่ไกลพระผู้มีพระภาค<br />
            ครั้งนั้นแล ภิกษุเหล่านั้น<br />
            ชื่นชมยินดีพระภาษิต ของพระผู้มีพระภาค<br />
            ลุกจากอาสนะ ถวายอภิวาท<br />
            ทำประทักษิณพระผู้มีพระภาคแล้ว<br />
            พากันเข้าไปหาท่านพระสารีบุตร<br />
            กล่าวคำปราศรัย กับท่านพระสารีบุตร<br />
            ครั้นผ่านการปราศรัย พอให้ระลึกถึงกันไปแล้ว<br />
            จึงนั่งอยู่ ณ ที่ควรส่วนข้างหนึ่งแล้ว<br />
            ได้กล่าวกะท่านพระสารีบุตรว่า<br />
            ข้าแต่ท่านพระสารีบุตร<br />
            ข้าพเจ้าทั้งหลาย<br />
            ปรารถนาจะไปปัจฉาภูมชนบท<br />
            เพื่อสำเร็จการอยู่อาศัย ในปัจฉาภูมชนบท<br />
            ท่านพระสารีบุตรกล่าวว่า<br />
            ท่านทั้งหลาย กราบทูลลาพระศาสดาแล้วหรือ?<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            ก็กษัตริย์ผู้เป็นบัณฑิตบ้าง<br />
            พราหมณ์ผู้เป็นบัณฑิตบ้าง<br />
            คฤหบดีผู้เป็นบัณฑิตบ้าง<br />
            สมณะผู้เป็นบัณฑิตบ้าง<br />
            เป็นผู้ถามปัญหากะภิกษุ<br />
            ผู้ไปไพรัชชประเทศต่างๆมีอยู่<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            ก็พวกมนุษย์ที่เป็นบัณฑิต<br />
            ทดลองถามว่า พระศาสดาของพวกท่าน<br />
            มีวาทะอย่างไร?<br />
            ตรัสสอนอย่างไร?<br />
            ธรรมทั้งหลายพวกท่านฟังดีแล้ว<br />
            เรียบร้อยดีแล้ว<br />
            ใส่ใจดีแล้ว<br />
            ทรงจำดีแล้ว<br />
            แทงตลอดดีแล้ว<br />
            ด้วยปัญญาบ้างหรือ?<br />
            ท่านผู้มีอายุทั้งหลาย<br />
            เมื่อพยากรณ์อย่างไร?<br />
            จึงจะชื่อว่าเป็นผู้กล่าวตาม<br />
            ที่พระผู้มีพระภาคตรัสแล้ว<br />
            จะไม่กล่าวตู่พระผู้มีพระภาค<br />
            ด้วยคำไม่จริง<br />
            และพยากรณ์ธรรมสมควรแก่ธรรม<br />
            ทั้งการคล้อยตามวาทะ ที่ถูกไรๆ จะไม่พึงถึงฐานะ<br />
            อันวิญญูชนจะติเตียนได้<br />
            ภิ. ข้าแต่ท่านผู้มีอายุ<br />
            ข้าพเจ้าทั้งหลาย<br />
            มาแม้แต่ที่ไกล<br />
            เพื่อจะรู้เนื้อความแห่งภาษิตนั้น ในสำนักท่านพระสารีบุตร<br />
            ดีละหนอ<br />
            ขอเนื้อความแห่งภาษิตนั้น<br />
            จงแจ่มแจ้งกะท่านพระสารีบุตรเถิด<br />
            ส. ถ้าเช่นนั้น<br />
            ท่านทั้งหลายจงฟัง จงใส่ใจให้ดี เราจักกล่าว<br />
            ภิกษุเหล่านั้น<br />
            รับคำท่านพระสารีบุตรแล้ว<br />
            ท่านพระสารีบุตรได้กล่าวว่า<br />
            ท่านผู้มีอายุทั้งหลาย<br />
            ก็กษัตริย์เป็นบัณฑิตบ้าง<br />
            พราหมณ์เป็นบัณฑิตบ้าง<br />
            คฤหบดีเป็นบัณฑิตบ้าง<br />
            สมณะเป็นบัณฑิตบ้าง<br />
            เป็นผู้ถามปัญหากะภิกษุ<br />
            ผู้ไปไพรัชชประเทศต่างๆ มีอยู่<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            ก็มนุษย์ทั้งหลายที่เป็นบัณฑิต<br />
            จะทดลองถามว่า<br />
            พระศาสดาของท่านผู้มีอายุทั้งหลาย<br />
            มีวาทะว่าอย่างไร<br />
            ตรัสสอนอย่างไร?<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            ท่านทั้งหลายถูกถามอย่างนี้แล้ว<br />
            พึงพยากรณ์อย่างนี้ว่า<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            พระศาสดาของเราทั้งหลาย<br />
            ตรัสสอนให้กำจัดฉันทราคะ<br />
            เมื่อท่านทั้งหลาย พยากรณ์อย่างนี้แล้ว<br />
            กษัตริย์ผู้เป็นบัณฑิตบ้าง<br />
            พราหมณ์ผู้เป็นบัณฑิตบ้าง<br />
            คฤหบดีผู้เป็นบัณฑิตบ้าง<br />
            สมณะผู้เป็นบัณฑิตบ้าง<br />
            พึงถามปัญหายิ่งขึ้นไป<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            ก็มนุษย์ทั้งหลายที่เป็นบัณฑิต<br />
            จะทดลองถามว่า<br />
            ก็พระศาสดาของท่านผู้มีอายุทั้งหลาย<br />
            ตรัสสอนให้กำจัดฉันทราคะ ในสิ่งอะไร<br />
            ท่านทั้งหลายถูกถามอย่างนี้แล้ว<br />
            พึงพยากรณ์อย่างนี้ว่า<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            พระศาสดาตรัสสอน<br />
            ให้กำจัดฉันทราคะใน รูป เวทนา สัญญา สังขาร วิญญาณ<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            เมื่อท่านทั้งหลาย พยากรณ์อย่างนี้แล้ว<br />
            กษัตริย์ผู้เป็นบัณฑิตบ้าง<br />
            พราหมณ์ผู้เป็นบัณฑิตบ้าง<br />
            คฤหบดีผู้เป็นบัณฑิตบ้าง<br />
            สมณะผู้เป็นบัณฑิตบ้าง<br />
            พึงถามปัญหายิ่งขึ้นไป<br />
            ก็มนุษย์ทั้งหลายที่เป็นบัณฑิต<br />
            จะทดลองถามว่า<br />
            ก็พระศาสดาของท่านผู้มีอายุทั้งหลาย<br />
            ทรงเห็นโทษอะไร<br />
            จึงตรัสสอน ให้กำจัดฉันทราคะใน รูป เวทนา สัญญา สังขาร วิญญาณ?<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            ท่านทั้งหลายถูกถามอย่างนี้แล้ว<br />
            พึงพยากรณ์อย่างนี้ว่า<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            เมื่อบุคคลมีความกำหนัด<br />
            ความพอใจ ความรัก<br />
            ความกระหาย<br />
            ความกระวนกระวาย<br />
            ความทะยานอยากใน รูป เวทนา สัญญา สังขาร และวิญญาณ<br />
            ยังไม่ปราศจากไปแล้ว<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส และอุปายาสย่อมเกิดขึ้น<br />
            เพราะรูป เวทนา สัญญา สังขารและวิญญาณ แปรปรวนเป็นอย่างอื่นไป<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            พระศาสดาของเราทั้งหลาย<br />
            ทรงเห็นโทษนี้แล<br />
            จึงตรัสสอน ให้กำจัดฉันทราคะใน รูป เวทนา สัญญา สังขาร และวิญญาณ<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            แม้เมื่อท่านทั้งหลาย พยากรณ์อย่างนี้แล<br />
            กษัตริย์ผู้เป็นบัณฑิตบ้าง<br />
            พราหมณ์ผู้เป็นบัณฑิตบ้าง<br />
            คฤหบดีผู้เป็นบัณฑิตบ้าง<br />
            สมณะผู้เป็นบัณฑิตบ้าง<br />
            พึงถามปัญหายิ่งขึ้นไป<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            ก็มนุษย์ทั้งหลาย<br />
            ที่เป็นบัณฑิตจะทดลองถามว่า<br />
            ก็พระศาสดา<br />
            ของท่านผู้มีอายุทั้งหลาย<br />
            ทรงเห็นอานิสงส์อะไร?<br />
            จึงตรัสสอน<br />
            ให้กำจัดให้ฉันทราคะใน รูป เวทนา สัญญา สังขาร วิญญาณ<br />
            ท่านทั้งหลายถูกถามอย่างนี้แล้ว<br />
            พึงพยากรณ์อย่างนี้ว่า<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            เมื่อบุคคลมีความกำหนัด<br />
            ความพอใจ ความรัก<br />
            ความกระหาย<br />
            ความกระวนกระวาย<br />
            ความทะยานอยากใน รูป เวทนา สัญญา สังขาร และวิญญาณ ปราศจากไปแล้ว<br />
            โสกะ ปริเทวะ ทุกข์ โทมนัส และอุปายาสย่อมไม่เกิดขึ้น<br />
            เพราะรูป เวทนา สัญญา สังขารและวิญญาณ แปรปรวนเป็นอย่างอื่นไป<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            พระศาสดาของเราทั้งหลาย<br />
            ทรงเห็นอานิสงส์นี้แล<br />
            จึงตรัสสอนให้กำจัดฉันทราคะ ในรูป เวทนา สัญญา สังขาร และ วิญญาณ<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            ก็เมื่อบุคคล เข้าถึงอกุศลธรรมทั้งหลายอยู่<br />
            จักได้มีการอยู่สบาย<br />
            ไม่มีความลำบาก<br />
            ไม่มีความคับแค้น<br />
            ไม่มีความเดือดร้อน ในปัจจุบันนี้<br />
            และเมื่อตายไปแล้ว<br />
            ก็พึงหวังสุคติไซร้<br />
            พระผู้มีพระภาค<br />
            ก็จะไม่พึงทรงสรรเสริญ<br />
            การละอกุศลธรรมทั้งหลาย<br />
            ก็เพราะเมื่อบุคคล เข้าถึงอกุศลธรรมทั้งหลาย<br />
            ย่อมมีการอยู่เป็นทุกข์<br />
            มีความลำบาก<br />
            มีความคับแค้น<br />
            มีความเดือดร้อนในปัจจุบัน<br />
            และเมื่อตายไปแล้ว<br />
            ก็พึงหวังได้ทุคติ<br />
            ฉะนั้นพระผู้มีพระภาค<br />
            จึงทรงสรรเสริญ<br />
            การละอกุศลธรรมทั้งหลาย<br />
            ดูกรท่านผู้มีอายุทั้งหลาย<br />
            แต่เมื่อบุคคล เข้าถึงกุศลธรรมทั้งหลายอยู่<br />
            จักได้มีการอยู่เป็นทุกข์<br />
            มีความลำบาก<br />
            มีความคับแค้น<br />
            มีความเดือดร้อน ในปัจจุบันนี้<br />
            และเมื่อตายไปแล้ว<br />
            ก็พึงหวังได้ทุคติไซร้<br />
            พระผู้มีพระภาค<br />
            ก็จะไม่พึงทรงสรรเสริญ<br />
            การเข้าถึงกุศลธรรมทั้งหลาย<br />
            ก็เพราะเมื่อบุคคล<br />
            เข้าถึงกุศลธรรมทั้งหลายอยู่<br />
            มีการอยู่สบาย<br />
            ไม่มีความลำบาก<br />
            ไม่มีความคับแค้น<br />
            ไม่มีความเดือดร้อน ในปัจจุบันนี้<br />
            และเมื่อตายไปแล้ว<br />
            ก็พึงหวังได้สุคติ<br />
            ฉะนั้นพระผู้มีพระภาค<br />
            จึงทรงสรรเสริญ<br />
            การเข้าถึงกุศลธรรมทั้งหลาย<br />
            ท่านพระสารีบุตร ได้กล่าวคำนี้แล้ว<br />
            ภิกษุเหล่านั้น<br />
            ชื่นชมยินดีภาษิต<br />
            ของท่านพระสารีบุตรฉะนี้แล<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>ภารสูตร</h2>
            </div>
            <h4>
            พระนครสาวัตถี<br />
            ณ ที่นั้นแล ฯลฯ<br />
            ดูกรภิกษุทั้งหลาย<br />
            เราจักแสดงภาระ ผู้แบกภาระ เครื่องถือมั่นภาระ<br />
            และเครื่องวางภาระ แก่เธอทั้งหลาย<br />
            เธอทั้งหลายจงฟัง จงใส่ใจให้ดี เราจักกล่าว<br />
            ภิกษุเหล่านั้น ทูลรับสนองพระพุทธดำรัสแล้ว<br />
            พระผู้มีพระภาคได้ตรัสว่า<br />
            ดูกรภิกษุทั้งหลาย<br />
            ก็ภาระเป็นไฉน?<br />
            พึงกล่าวว่า ภาระ คืออุปาทานขันธ์  ๕<br />
            อุปาทานขันธ์ ๕ เป็นไฉน?<br />
            คือ อุปาทานขันธ์ คือรูป<br />
            อุปาทานขันธ์  คือเวทนา<br />
            อุปาทานขันธ์ คือสัญญา<br />
            อุปาทานขันธ์ คือสังขาร<br />
            และอุปาทานขันธ์ คือวิญญาณ<br />
            ดูกรภิกษุทั้งหลาย นี้เรียกว่าภาระ.<br />
            ดูกรภิกษุทั้งหลาย<br />
            ก็ผู้แบกภาระเป็นไฉน? พึงกล่าวว่าบุคคล<br />
            บุคคลนี้นั้น คือ ท่านผู้มีชื่ออย่างนี้ มีโคตรอย่างนี้<br />
            ดูกรภิกษุทั้งหลาย<br />
            นี้เรียกว่าผู้แบกภาระ.<br />
            ดูกรภิกษุทั้งหลาย<br />
            ก็เครื่องถือมั่นภาระเป็นไฉน?<br />
            ตัณหานี้ใด นำให้เกิดภพใหม่ ประกอบด้วยความกำหนัด<br />
            ด้วยอำนาจความเพลิดเพลิน มีปกติเพลิดเพลินยิ่ง<br />
            ในภพหรืออารมณ์นั้นๆ ได้แก่กามตัณหา ภวตัณหา วิภวตัณหา<br />
            ดูกรภิกษุทั้งหลาย<br />
            นี้เรียกว่าเครื่องถือมั่นภาระ<br />
            ดูกรภิกษุทั้งหลาย<br />
            ก็การวางภาระเป็นไฉน?<br />
            ความที่ตัณหานั่นแลดับไปด้วย สำรอกโดยไม่เหลือ<br />
            ความสละ ความสละคืน ความพ้น ความไม่อาลัย<br />
            ดูกรภิกษุทั้งหลาย<br />
            นี้เรียกว่าการวางภาระ<br />
            พระผู้มีพระภาค<br />
            ผู้พระสุคตศาสดา<br />
            ครั้นได้ตรัสไวยากรณ์ภาษิตนี้ จบลงแล้ว<br />
            จึงได้ตรัสคาถาประพันธ์<br />
            ต่อไปอีกในภายหลังว่า<br />
            ขันธ์ ๕ ชื่อว่าภาระแล และผู้แบกภาระคือบุคคล<br />
            เครื่องถือมั่นภาระ เป็นเหตุนำมาซึ่งความทุกข์ในโลก<br />
            การวางภาระเสียได้เป็นสุข<br />
            บุคคลวางภาระหนักเสียได้แล้ว ไม่ถือภาระอื่น<br />
            ถอนตัณหาพร้อม ทั้งมูลรากแล้ว<br />
            เป็นผู้หายหิวดับรอบแล้วดังนี้<br /><br /><hr /><br />
            </h4>
            <a href="/sixth/lesson0603">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                อุปาทิยสูตร ปุณณมสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0602;