import React from 'react';
import AutoScroll from '../../components/AutoScroll';

const Learning = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>กำหนดรู้ รู้ทันสิ่งที่มากระทบสัมผัส</h2>
          </div>
            <h4>
            ไม่เที่ยงเกิดดับ ตัวฉันเกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ตัวฉันคือ รูป เวทนา สัญญา สังขาร วิญญาณ เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ รูป เวทนา สัญญา สังขาร วิญญาณ คือกาย เวทนา จิต ธรรม เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กาย เวทนา จิต ธรรม คือโลกและชีวิต เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ผลต่อเนื่องของโลกและชีวิต คือวัตถุ สิ่งของ สัตว์ บุคคล เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ผลต่อเนื่องของ วัตถุ สิ่งของ สัตว์ บุคคล คือรูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์ เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ผลต่อเนื่องของรูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์ คือความพอใจ ไม่พอใจ เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ความพอใจ ไม่พอใจ คือความไม่รู้ เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ความไม่รู้ คืออวิชชา เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ผลต่อเนื่องของอวิชชา คือชีวิต เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ชีวิต คือตัวฉัน เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ตัวฉัน คือรูป เวทนา สัญญา สังขาร วิญญาณ เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ รูป เวทนา สัญญา สังขาร วิญญาณ คือกาย เวทนา จิต ธรรม เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กาย เวทนา จิต ธรรม คือโลกและชีวิต เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับโลกและชีวิต คือตัวฉัน เกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ โลกและชีวิต เคลื่อนไหวเกิดขึ้น ตั้งอยู่ ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ว่างเปล่าจากตนและของของตน<br />
            ไม่ควรไปยึดมั่นถือมั่นถือมั่นว่า โลกและชีวิตเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 1</h2>
            </div>
            <h4>
            ไม่เที่ยงเกิดดับ เหตุปัจจัยของตาเห็นรูปไม่เที่ยงเกิดดับ ตาเห็นรูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ผลต่อเนื่องของตาเห็นรูปไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เหตุปัจจัยของหูได้ยินเสียง ไม่เที่ยงเกิดดับ หูได้ยินเสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ผลต่อเนื่องของหูได้ยินเสียงไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เหตุปัจจัยของจมูกได้กลิ่น ไม่เที่ยงเกิดดับ จมูกได้กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ผลต่อเนื่องของจมูกได้กลิ่นไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เหตุปัจจัยของลิ้นได้รส ไม่เที่ยงเกิดดับ ลิ้นได้รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ผลต่อเนื่องของลิ้นได้รสไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เหตุปัจจัยของกายสัมผัส ไม่เที่ยงเกิดดับ กายสัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ผลต่อเนื่องของกายสัมผัสไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เหตุปัจจัยของใจคิดนึก ไม่เที่ยงเกิดดับ ใจคิดนึกไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ผลต่อเนื่องของใจคิดนึกไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เหตุปัจจัยของมโนกรรม ไม่เที่ยงเกิดดับ มโนกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ผลต่อเนื่องของมโนกรรมไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เหตุปัจจัยของวจีกรรม ไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ผลต่อเนื่องของวจีกรรมไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เหตุปัจจัยของกายกรรม ไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ผลต่อเนื่องของกายกรรมไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 2</h2>
            </div>
            <h4>
            ไม่เที่ยงเกิดดับ ตาฉันเห็นรูปคือตัวฉันเห็นรูป ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ หูฉันได้ยินเสียงคือตัวฉันได้ยินเสียง ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ จมูกฉันได้กลิ่นคือตัวฉันได้กลิ่น ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ลิ้นฉันได้รสคือตัวฉันได้รส ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กายฉันสัมผัสคือตัวฉันสัมผัส ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ใจฉันคิดนึกคือตัวฉันคิดนึก ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มโนกรรมฉันคิดคือตัวฉันคิด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ วจีกรรมฉันพูดคือตัวฉันพูด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กายกรรมฉันทำคือตัวฉันทำ ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มือฉันจับไม้กวาดคือตัวฉันจับไม้กวาด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มือฉันกวาดคือตัวฉันกวาด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มือฉันเคลื่อนไหวคือตัวฉันเคลื่อนไหว ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เท้าฉันเดินคือตัวฉันเดิน ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br /><hr />
            </h4>
            <div className="section-title">
              <h2>บทที่ 3</h2>
            </div>
            <h4>
            ไม่เที่ยงเกิดดับ ตาฉันเห็นรูปคือตัวฉันเห็นรูป ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ หูฉันได้ยินเสียงคือตัวฉันได้ยินเสียง ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ จมูกฉันได้กลิ่นคือตัวฉันได้กลิ่น ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ลิ้นฉันได้รสคือตัวฉันได้รส ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กายฉันสัมผัสคือตัวฉันสัมผัส ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ใจฉันคิดนึกคือตัวฉันคิดนึก ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มโนกรรมฉันคิดคือตัวฉันคิด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ วจีกรรมฉันพูดคือตัวฉันพูด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กายกรรมฉันทำคือตัวฉันทำ ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มือฉันจับไม้กวาดคือตัวฉันจับไม้กวาด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มือฉันกวาดคือตัวฉันกวาด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มือฉันเคลื่อนไหวคือตัวฉันเคลื่อนไหว ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ เท้าฉันเดินคือตัวฉันเดิน ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง<br />
            ไม่ว่า อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 4</h2>
            </div>
            <h4>
            ไม่เที่ยงเกิดดับ ตัวฉันผลต่อเนื่องของโลกและชีวิต เกิดขึ้นตั้งอยู่ดับไปไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ทุกสิ่งทุกอย่าง เป็นธรรมชาติ และกฎธรรมชาติ 2 กฎ ไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ สิ่งทั้งปวงโลกและชีวิตผลต่อเนื่อง เกิดขึ้นตั้งอยู่ดับไปไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มโนกรรมความคิด ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ วจีกรรมคำพูด ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กายกรรมการเคลื่อนไหว ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 5</h2>
            </div>
            <h3>ตัวอย่าง: เก้าอี้, โต๊ะ, พื้น</h3>
            <h4>
            ไม่เที่ยงเกิดดับ เก้าอี้ เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ<br />
            โต๊ะ เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ<br />
            พื้น เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ เก้าอี้ โต๊ะ พื้น เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับเหมือนกัน<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 6</h2>
            </div>
            <h3>ตัวอย่าง: เก้าอี้</h3>
            <h4>
            ไม่เที่ยงเกิดดับ ตัวฉันและเก้าอี้ เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลายไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ทุกสิ่งทุกอย่าง เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป<br />
            เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลายไม่เที่ยงเกิดดับเหมือนกัน<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 7</h2>
            </div>
            <h4>
            ไม่เที่ยงเกิดดับ ตาเห็นรูปเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไปเกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลายไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ หูได้ยินเสียง จมูกได้กลิ่น ลิ้นได้รส กายสัมผัส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ หูได้ยินเสียงเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลายไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ ตาเห็นรูป จมูกได้กลิ่น ลิ้นได้รส กายสัมผัส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ จมูกได้กลิ่นเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลายไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ ตาเห็นรูป หูได้ยินเสียง ลิ้นได้รส กายสัมผัส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ลิ้นได้รสเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลายไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ ตาเห็นรูป หูได้ยินเสียง จมูกได้กลิ่น กายสัมผัส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กายสัมผัสเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลายไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ ตาเห็นรูป หูได้ยินเสียง จมูกได้กลิ่น ลิ้นได้รส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ใจคิดนึกเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลายไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ ตาเห็นรูป หูได้ยินเสียง จมูกได้กลิ่น ลิ้นได้รส กายสัมผัส เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 8</h2>
            </div>
            <h4>
            ไม่เที่ยงเกิดดับ ตาเห็นรูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ หูได้ยินเสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ จมูกได้กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ลิ้นได้รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กายสัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ ใจคิดนึกไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ มโนกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
            ไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 9</h2>
            </div>
            <h4>
              ไม่เที่ยงเกิดดับ เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ<br />
              มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
              ไม่เที่ยงเกิดดับ เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ<br />
              มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
              ไม่เที่ยงเกิดดับ เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ<br />
              มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
              ไม่เที่ยงเกิดดับ เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ<br />
              มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br />
              ไม่เที่ยงเกิดดับ เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ<br />
              มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 10</h2>
            </div>
            <h4>
              (เอากฎธรรมชาติ 2 กฎไปลบชื่อ)<br />
              (เก้าอี้) ไม่เที่ยงเกิดดับ เก้าอี้ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              (แสงไฟ) ไม่เที่ยงเกิดดับ แสงไฟไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              (ศาลา) ไม่เที่ยงเกิดดับ ศาลาไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              (เสียงนก) ไม่เที่ยงเกิดดับ เสียงนกไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 11</h2>
            </div>
            <h3>(เอาไปทำซ้ำ และฝึกกำหนดรู้)</h3>
            <h4>
              ไม่เที่ยงเกิดดับ ชีวิตไม่เที่ยงเกิดดับ (กำหนดรู้ชีวิตคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br />
              ไม่เที่ยงเกิดดับ ชีวิตไม่เที่ยงเกิดดับ (กำหนดรู้ชีวิตคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br />
              ไม่เที่ยงเกิดดับ ชีวิตไม่เที่ยงเกิดดับ (กำหนดรู้ชีวิตคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br />
              ไม่เที่ยงเกิดดับ ชีวิตไม่เที่ยงเกิดดับ (กำหนดรู้ชีวิตคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br />
              ไม่เที่ยงเกิดดับ ชีวิตไม่เที่ยงเกิดดับ (กำหนดรู้ชีวิตคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br />
              ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ (กำหนดรู้ตัวฉันคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br />
              ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ (กำหนดรู้ตัวฉันคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br />
              ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ (กำหนดรู้ตัวฉันคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br />
              ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ (กำหนดรู้ตัวฉันคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br />
              ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ (กำหนดรู้ตัวฉันคือโลกและชีวิต ไม่เที่ยงเกิดดับ)<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 12</h2>
            </div>
            <h4>
              ไม่เที่ยงเกิดดับ ตัวฉันเกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ<br />
              ไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นของตนเอง ไม่เที่ยงเกิดดับ<br />
              ไม่เที่ยงเกิดดับ ตัวฉันว่างเปล่าจากตนและของของตน ไม่เที่ยงเกิดดับ<br />
              ไม่เที่ยงเกิดดับ ไม่ควรไปยึดมั่นถือมั่นว่า ตัวฉันเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 13</h2>
            </div>
            <h4>
              (เดิน) ไม่เที่ยงเกิดดับ เดินเป็นธรรมชาติ เดินเสร็จเป็นกฎธรรมชาติ 2 กฎ ไม่เที่ยงเกิดดับ<br />
              (นั่ง) ไม่เที่ยงเกิดดับ นั่งเป็นธรรมชาติ นั่งเสร็จเป็นกฎธรรมชาติ 2 กฎ ไม่เที่ยงเกิดดับ<br />
              (ยืน) ไม่เที่ยงเกิดดับ ยืนเป็นธรรมชาติ ยืนเสร็จเป็นกฎธรรมชาติ 2 กฎ ไม่เที่ยงเกิดดับ<br />
              (นอน) ไม่เที่ยงเกิดดับ นอนเป็นธรรมชาติ นอนเสร็จเป็นกฎธรรมชาติ 2 กฎ ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <div className="section-title">
              <h2>บทที่ 14</h2>
            </div>
            <h4>
              ไม่เที่ยงเกิดดับ ทุกข์คือความพอใจไม่พอใจ ความพอใจไม่พอใจคือทุกข์<br />
              ไม่เที่ยงเกิดดับคือสุข สุขคือไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
        </div>
      </section>
    </div>
  )
}

export default Learning;