import React from 'react';

const Lesson0405 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>โนอัสสาสูตรที่ 2</h2>
          </div>
            <h4>
            โนอัสสาสูตรที่ 2<br />
            ดูกรภิกษุทั้งหลาย ถ้าคุณแห่งรูปจักไม่มีแล้วไซร้<br />
            สัตว์ทั้งหลาย ก็จะไม่พึงกำหนัดในรูป<br />
            แต่เพราะคุณของรูปมีอยู่<br />
            ฉะนั้นสัตว์ทั้งหลาย จึงกำหนัดในรูป<br />
            ถ้าโทษแห่งรูปไม่มีแล้วไซร้<br />
            สัตว์ทั้งหลาย ก็จะไม่พึงเบื่อหน่ายในรูป<br />
            แต่เพราะโทษแห่งรูปมีอยู่<br />
            ฉะนั้นสัตว์ทั้งหลาย จึงเบื่อหน่ายในรูป<br />
            ถ้าความสลัดออกแห่งรูป จักไม่มีแล้วไซร้<br />
            สัตว์ทั้งหลาย ก็จะไม่พึงสลัดออกจากรูป<br />
            แต่เพราะความสลัดออกแห่งรูปมีอยู่<br />
            ฉะนั้นสัตว์ทั้งหลาย จึงสลัดออกแห่งรูป ฯลฯ<br />
            แห่งเสียง ฯลฯ แห่งกลิ่น ฯลฯ แห่งรส ฯลฯ แห่งโผฏฐัพพะ ฯลฯ<br /><br />
            ถ้าคุณแห่งธรรมารมณ์ จักไม่มีแล้วไซร้<br />
            สัตว์ทั้งหลาย ไม่พึงกำหนัดในธรรมารมณ์<br />
            แต่เพราะคุณแห่งธรรมารมณ์มีอยู่<br />
            ฉะนั้นสัตว์ทั้งหลาย พึงกำหนัดในธรรมารมณ์<br />
            ถ้าโทษแห่งธรรมารมณ์ จักไม่มีแล้วไซร้<br />
            สัตว์ทั้งหลาย ก็ไม่พึงเบื่อหน่ายในธรรมารมณ์<br />
            แต่เพราะโทษแห่งธรรมารมณ์มีอยู่<br />
            ฉะนั้นสัตว์ทั้งหลาย จึงเบื่อหน่ายในธรรมารมณ์<br />
            ถ้าความสลัดออก จากธรรมารมณ์จักไม่มีแล้วไซร้<br />
            สัตว์ทั้งหลาย ก็จะไม่พึงสลัดออกจากธรรมารมณ์<br />
            แต่เพราะความสลัดออก จากธรรมารมณ์มีอยู่<br />
            ฉะนั้นสัตว์ทั้งหลาย จึงสลัดออกจากธรรมารมณ์<br /><br />
            ดูกรภิกษุทั้งหลาย<br />
            สัตว์ทั้งหลาย ยังไม่รู้ตามความเป็นจริง<br />
            ซึ่งคุณแห่งอายตนะภายนอก 6 เหล่านี้ โดยเป็นคุณ<br />
            ซึ่งโทษโดยความเป็นโทษ ซึ่งความสลัดออก<br />
            โดยเป็นความสลัดออกเพียงใด<br />
            สัตว์ทั้งหลายก็ยังเป็นผู้ไม่ออกไป พรากไป หลุดพ้นจากโลก<br />
            พร้อมเทวโลก มารโลก พรหมโลก จากหมู่สัตว์<br />
            พร้อมทั้งสมณพราหมณ์เทวดาและมนุษย์<br />
            มีใจหาเขตแดนไม่ได้อยู่เพียงนั้น<br />
            แต่เมื่อใดสัตว์ทั้งหลายได้รู้ตามความเป็นจริง<br />
            ซึ่งคุณแห่งอายตนะ 6 เหล่านี้ โดยเป็นคุณ<br />
            ซึ่งโทษโดยความเป็นโทษ ซึ่งความสลัดออก โดยเป็นความสลัดออก<br />
            เมื่อนั้นสัตว์ทั้งหลายก็เป็นผู้ออกไป หลุดพ้นไปจากโลก<br />
            พร้อมทั้งเทวโลก มารโลก พรหมโลก จากหมู่สัตว์<br />
            พร้อมทั้งสมณพราหมณ์ เทวดาและมนุษย์<br />
            มีใจอันหาเขตแดนมิได้อยู่<br /><br /><hr /><br />
            </h4>
            <a href="/forth/lesson0406">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                อาฬวกสูตรที่ 12
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0405;