import React from 'react';

const Lesson0408 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>อาพาธสูตร</h2>
          </div>
            <h4>
            อาพาธสูตร ว่าด้วยหายอาพาธ ด้วยสัญญา 10 ประการ<br />
            สมัยหนึ่งพระผู้มีพระภาค ประทับอยู่ ณ พระวิหารเชตวัน<br />
            อารามของท่านอนาถบิณฑิกเศรษฐี ใกล้พระนครสาวัตถี<br />
            ก็สมัยนั้นแล ท่านพระคิริมานนท์อาพาธ ได้รับทุกข์เป็นไข้หนัก<br />
            ครั้งนั้นแลท่านพระอานนท์ เข้าไปเฝ้าพระผู้มีพระภาค ถึงที่ประทับ<br />
            ถวายบังคมพระผู้มีพระภาค แล้วนั่ง ณ ที่ควรส่วนข้างหนึ่ง<br />
            ครั้นแล้ว ได้กราบทูลพระผู้มีพระภาคว่า ข้าแต่พระองค์ผู้เจริญ<br />
            ท่านพระคิริมานนท์อาพาธ ได้รับทุกข์เป็นไข้หนัก<br />
            ขอประทานพระวโรกาส ขอพระผู้มีพระภาค ได้โปรดอนุเคราะห์<br />
            เสด็จเยี่ยมท่านพระคิริมานนท์ ยังที่อยู่เถิดพระเจ้าข้า<br /><br />
            พระผู้มีพระภาคตรัสว่า ดูกรอานนท์ถ้าเธอพึงเข้าไปหา<br />
            แล้วกล่าวสัญญา 10 ประการ แก่คิริมานนท์ภิกษุไซร้<br />
            ข้อที่อาพาธของคิริมานนท์ภิกษุ จะพึงสงบระงับโดยพลัน<br />
            เพราะได้ฟังสัญญา 10 ประการนั้น เป็นฐานะที่จะมีได้<br />
            สัญญา 10 ประการเป็นไฉน<br />
            คืออนิจจสัญญา 1<br />
            อนัตตสัญญา 1<br />
            อสุภสัญญา 1<br />
            อาทีนวสัญญา 1<br />
            ปหานสัญญา 1<br />
            วิราคสัญญา 1 <br />
            นิโรธสัญญา 1<br />
            สัพพโลเกอนภิรตสัญญา 1<br />
            สัพพสังขาเรสุอนิจจสัญญา 1<br />
            อานาปานสติ 1<br /><br />
            
            ก็อนิจจสัญญาเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ อยู่ในป่าก็ดี อยู่ที่โคนไม้ก็ดี อยู่ในเรือนว่างเปล่าก็ดี<br />
            ย่อมพิจารณาเห็นดังนี้ว่า รูปไม่เที่ยง เวทนาไม่เที่ยง สัญญาไม่เที่ยง<br />
            สังขารทั้งหลายไม่เที่ยง วิญญาณไม่เที่ยง<br />
            ย่อมพิจารณา เห็นโดยความเป็นของไม่เที่ยง ในอุปาทานขันธ์ 5 เหล่านี้<br />
            ด้วยประการอย่างนี้ ดูกรอานนท์นี้เรียกว่าอนิจจสัญญา<br /><br />

            ดูกรอานนท์ก็อนัตตสัญญาเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ อยู่ในป่าก็ดี อยู่ที่โคนไม้ก็ดี อยู่ในเรือนว่างเปล่าก็ดี<br />
            ย่อมพิจารณาเห็นดังนี้ว่า<br />
            จักษุเป็นอนัตตา รูปเป็นอนัตตา หูเป็นอนัตตา เสียงเป็นอนัตตา<br />
            จมูกเป็นอนัตตา กลิ่นเป็นอนัตตา ลิ้นเป็นอนัตตา รสเป็นอนัตตา<br />
            กายเป็นอนัตตา โผฏฐัพพะเป็นอนัตตา ใจเป็นอนัตตา ธรรมารมณ์เป็นอนัตตา<br />
            ย่อมพิจารณาเห็นโดยความเป็นอนัตตา<br />
            ในอายตนะทั้งหลาย ทั้งภายในและภายนอก <br />
            6 ประการเหล่านี้ด้วยประการอย่างนี้<br />
            ดูกรอานนท์นี้เรียกว่าอนัตตสัญญา<br /><br />

            ดูกรอานนท์ก็อสุภสัญญาเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ ย่อมพิจารณาเห็นกายนี้นั่นแล<br />
            เบื้องบนแต่พื้นเท้าขึ้นไป เบื้องต่ำแต่ปลายผมลงมา<br />
            มีหนังหุ้มอยู่โดยรอบ เต็มด้วยของไม่สะอาด<br />
            มีประการต่างๆว่า<br />
            ในกายนี้มีผม ขน เล็บ ฟัน หนัง<br />
            เนื้อ เอ็น กระดูก เยื่อในกระดูก <br />
            ม้าม เนื้อหัวใจ ตับ พังผืด<br />
            ไต ปอด ไส้ใหญ่ ไส้น้อย<br />
            อาหารใหม่ อาหารเก่า<br />
            ดี เสลด หนอง เลือด เหงื่อ<br />
            มันข้น น้ำตา เปลวมัน น้ำลาย<br />
            น้ำมูก ไขข้อ มูตร<br />
            ย่อมพิจารณาเห็นโดย ความเป็นของไม่งามในกายนี้ ด้วยประการดังนี้<br />
            ดูกรอานนท์นี้เรียกว่าอสุภสัญญา<br /><br />

            ดูกรอานนท์ก็อาทีนวสัญญาเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ อยู่ในป่าก็ดีอยู่ที่โคนไม้ก็ดี อยู่ในเรือนว่างเปล่าก็ดี<br />
            ย่อมพิจารณาเห็นดังนี้ว่า กายนี้มีทุกข์มาก มีโทษมาก<br />
            เพราะฉะนั้นอาพาธต่างๆ จึงเกิดขึ้นในกายนี้<br />
            คือโรคตา โรคหู โรคจมูก โรคลิ้น โรคกาย โรคศีรษะ<br />
            โรคที่ใบหู โรคปาก โรคฟัน โรคไต โรคหืด โรคไข้หวัด<br />
            โรคไข้พิษ โรคไข้เซื่องซึม โรคในท้อง โรคลมสลบ โลกบิด โรคจุกเสียด<br />
            โลกลงราก โลกเรื้อน โลกฝี โรคมองคล่อ โรคลมบ้าหมู<br />
            โรคหิดเปื่อย โรคหิดด้าน โรคคุดทะราด โรคละอองบวม<br />
            โรคอาเจียนโลหิต โรคดีเดือด โรคเบาหวาน โรคเริม<br />
            โรคพุพอง โรคริดสีดวง<br />
            อาพาธมีดีเป็นสมุฏฐาน อาพาธมีเสมหะเป็นสมุฏฐาน<br />
            อาพาธมีลมเป็นสมุฏฐาน อาพาธมีไข้สันนิบาต<br />
            อาพาธอันเกิดแต่ฤดูแปรปรวน อาพาธอันเกิดแต่การบริหารไม่สม่ำเสมอ<br />
            อาพาธอันเกิดแต่ความเพียรเกินกำลัง อาพาธอันเกิดแต่วิบากของกรรม<br />
            ความหนาว ความร้อน ความหิว ความกระหาย ปวดอุจจาระ ปวดปัสสาวะ<br />
            ย่อมพิจารณาเห็นโดยความเป็นโทษ<br />
            ในกายนี้ด้วยประการดังนี้<br />
            ดูกรอานนท์นี้เรียกว่าอาทีนวสัญญา<br /><br />

            ดูกรอานนท์ก็ปหานสัญญาเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ ย่อมไม่ยินดี ย่อมละ ย่อมบรรเทา<br />
            ย่อมทำให้หมดสิ้นไป ย่อมทำให้ถึงความไม่มี<br />
            ซึ่งพยาบาทวิตกอันเกิดขึ้นแล้ว ย่อมไม่ยินดี ย่อมละ ย่อมบรรเทา<br />
            ย่อมทำให้หมดสิ้นไป ย่อมทำให้ถึงความไม่มี<br />
            ซึ่งพยาบาทวิตกอันเกิดขึ้นแล้ว ย่อมไม่ยินดี ย่อมละ ย่อมบรรเทา<br />
            ย่อมทำให้หมดสิ้นไป ย่อมทำให้ถึงความไม่มี<br />
            ซึ่งวิหิงสาวิตกอันเกิดขึ้นแล้ว ย่อมไม่ยินดี ย่อมละ ย่อมบรรเทา<br />
            ย่อมทำให้หมดสิ้นไป ย่อมทำให้ถึงความไม่มี<br />
            ซึ่งอกุศลธรรมทั้งหลาย อันชั่วช้าอันเกิดขึ้นแล้วเกิดขึ้นแล้ว<br />
            ดูกรอานนท์นี้เรียกว่าปหานสัญญา<br /><br />

            ดูกรอานนท์ก็วิราคสัญญาเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ อยู่ในป่าก็ดีอยู่ที่โคนไม้ก็ดี อยู่ในเรือนว่างเปล่าก็ดี<br />
            ย่อมพิจารณาเห็นดังนี้ว่า ธรรมชาตินั่นสงบ<br />
            ธรรมชาตินั่นประณีต คือธรรมเป็นที่ระงับสังขารทั้งปวง<br />
            ธรรมเป็นที่สละคืนอุปธิทั้งปวง ธรรมเป็นที่สิ้นไปแห่งตัณหา<br />
            ธรรมเป็นที่สำรอกกิเลส ธรรมชาติเป็นที่ดับกิเลสและกองทุกข์<br />
            ดูกรอานนท์นี้เรียกว่าริราคสัญญา<br /><br />
                        
            ดูกรอานนท์นิโรธสัญญาเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ อยู่ในป่าก็ดี อยู่ที่โคนไม้ก็ดี อยู่ในเรือนว่างเปล่าก็ดี<br />
            ย่อมพิจารณาเห็นดังนี้ว่า ธรรมชาตินั่นสงบ<br />
            ธรรมชาตินั่นประณีต คือธรรมเป็นที่ระงับสังขารทั้งปวง<br />
            ธรรมเป็นที่สละคืนอุปธิทั้งปวง ธรรมเป็นที่สิ้นไปแห่งตัณหา<br />
            ธรรมเป็นที่ดับโดยไม่เหลือ ธรรมชาติเป็นที่ดับกิเลสและกองทุกข์<br />
            ดูกรอานนท์นี้เรียกว่านิโรธสัญญา<br /><br />

            ดูกรอานนท์ สัพพโลเกอนภิรตสัญญาเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ ละอุบายและอุปาทานในโลก อันเป็นเหตุตั้งมั่นถือมั่น<br />
            และเป็นอนุสัยแห่งจิต ย่อมงดเว้น ไม่ถือมั่น<br />
            ดูกรอานนท์นี้เรียกว่า สัพพโลเกอนภิรตสัญญา<br /><br />

            ดูกรอานนท์ สัพพสังขาเรสุอนิจจสัญญาเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ ย่อมอึดอัด ย่อมระอา<br />
            ย่อมเกลียดชังแต่สังขารทั้งปวง<br />
            ดูกรอานนท์นี้เรียกว่า สัพพสังขาเรสุอนิจจสัญญา<br /><br />

            ดูกรอานนท์อานาปานสติเป็นไฉน<br />
            ดูกรอานนท์ภิกษุในธรรมวินัยนี้ อยู่ในป่าก็ดี อยู่ที่โคนไม้ก็ดี อยู่ในเรือนว่างเปล่าก็ดี<br />
            นั่งคู้บัลลังก์ตั้งกายให้ตรง ดำรงสติไว้เฉพาะหน้า<br />
            เธอเป็นผู้มีสติหายใจออก เป็นผู้มีสติหายใจเข้า<br />
            เมื่อหายใจออกยาว ก็รู้ชัดว่าหายใจออกยาว<br />
            หรือเมื่อหายใจเข้ายาว ก็รู้ชัดว่าหายใจเข้ายาว<br />
            เมื่อหายใจออกสั้น ก็รู้ชัดว่าหายใจออกสั้น<br />
            หรือเมื่อหายใจเข้าสั้น ก็รู้ชัดว่าหายใจเข้าสั้น<br />
            ย่อมศึกษาว่าจักเป็นผู้กำหนดรู้ กายทั้งปวงหายใจออก<br />
            ย่อมศึกษาว่าจักเป็นผู้กำหนดรู้ กายทั้งปวงหายใจเข้า<br />
            ย่อมศึกษาว่าจักระงับ กายสังขารหายใจออก<br />
            ย่อมศึกษาว่าจักระงับ กายสังขารหายใจเข้า<br />
            ย่อมศึกษาว่าจักกำหนดรู้ ปิติหายใจออก<br />
            ย่อมศึกษาว่าจักกำหนดรู้ ปิติหายใจเข้า<br />
            ย่อมศึกษาว่าจักกำหนดรู้ สุขหายใจออก<br />
            ย่อมศึกษาว่าจักกำหนดรู้ สุขหายใจเข้า<br />
            ย่อมศึกษาว่าจักกำหนดรู้ จิตตสังขารหายใจออก<br />
            ย่อมศึกษาว่าจักกำหนดรู้ จิตตสังขารหายใจเข้า<br />
            ย่อมศึกษาว่าจักระงับจิตตสังขาร หายใจออก<br />
            ย่อมศึกษาว่าจักระงับจิตตสังขาร หายใจเข้า<br />
            ย่อมศึกษาว่าจักกำหนดรู้ จิตหายใจออก<br />
            ย่อมศึกษาว่าจักกำหนดรู้ จิตหายใจเข้า<br />
            ย่อมศึกษาว่าจักยังจิต ให้บันเทิงหายใจออก<br />
            ย่อมศึกษาว่าจักยังจิต ให้บันเทิงหายใจเข้า<br />
            ย่อมศึกษาว่าจักตั้งจิต ให้มั่นหายใจออก<br />
            ย่อมศึกษาว่าจักตั้งจิต ให้มั่นหายใจเข้า<br />
            ย่อมศึกษาว่าจักเปลื้องจิต หายใจออก<br />
            ย่อมศึกษาว่าจักเปลื้องจิต หายใจเข้า<br />
            ย่อมศึกษาว่าจักเป็นผู้พิจารณา เห็นโดยความเป็นของไม่เที่ยง หายใจออก<br />
            ย่อมศึกษาว่าจักเป็นผู้พิจารณา เห็นโดยความเป็นของไม่เที่ยง หายใจเข้า<br />
            ย่อมศึกษาว่าจักเป็นผู้พิจารณา เห็นโดยความคลายกำหนัดหายใจออก<br />
            ย่อมศึกษาว่าจักเป็นผู้พิจารณา โดยความคลายกำหนัดหายใจเข้า<br />
            ย่อมศึกษาว่าจักเป็นผู้พิจารณา เห็นโดยความดับสนิทหายใจออก<br />
            ย่อมศึกษาว่าจักเป็นผู้พิจารณา เห็นโดยความดับสนิทหายใจเข้า<br />
            ย่อมศึกษาว่าจักเป็นผู้พิจารณา เห็นโดยความสละคืนหายใจออก<br />
            ย่อมศึกษาว่าจักเป็นผู้พิจารณา เห็นโดยความสละคืนหายใจเข้า<br />
            ดูกรอานนท์นี้เรียกว่าอานาปานสติ<br /><br />

            ดูกรอานนท์ถ้าเธอพึงเข้าไปหา แล้วกล่าวสัญญา 10 ประการนี้<br />
            แก่คิริมานนท์ภิกษุไซร้<br />
            ข้อที่อาพาธของคิริมานนท์ภิกษุ ะพึงสงบระงับโดยพลัน<br />
            เพราะได้ฟังสัญญา 10 ประการนี้ เป็นฐานะที่จะมีได้<br /><br />

            ลำดับนั้นแลท่านพระอานนท์ ได้เรียนสัญญา 10 ประการนี้<br />
            ในสำนักของพระผู้มีพระภาคแล้ว<br />
            ได้เข้าไปหาท่านพระคิริมานนท์ยังที่อยู่<br />
            ครั้นแล้วได้กล่าวสัญญา 10 ประการ แก่ท่านพระคิริมานนท์<br />
            ครั้งนั้นแลอาพาธนั้น ของท่านพระคิริมานนท์สงบระงับโดยพลัน<br />
            เพราะได้ฟังสัญญา 10 ประการนี้<br />
            ท่านพระคิริมานนท์ หายจากอาพาธนั้นก็แล<br />
            อาพาธนั้น เป็นโรคอันพระคิริมานนท์ละได้แล้ว ด้วยประการนั้นแล<br /><br /><hr /><br />
            </h4>
            <a href="/forth/lesson0409">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ยมกวรรคที่ 2
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0408;