import React from 'react';

const Lesson0404 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>สัมโพธสูตรที่ 1</h2>
          </div>
            <h4>
            สัมโพธสูตรที่ 1<br />
            ดูกรภิกษุทั้งหลาย ก่อนการตรัสรู้<br />
            เมื่อเรายังเป็นโพธิสัตว์ ยังไม่ได้ตรัสรู้<br />
            ได้มีความคิดดังนี้ว่า อะไรเป็นคุณอะไรเป็นโทษ<br />
            อะไรเป็นความสลัดออกแห่งจักษุ ฯลฯ<br />
            แห่ง​หู ฯลฯ แห่งจมูก ฯลฯ แห่งลิ้น ฯลฯ แห่งกาย ฯลฯ<br />
            อะไรเป็นคุณอะไรเป็นโทษ อะไรเป็นความสลัดออกแห่งใจ<br />
            ดูกรภิกษุทั้งหลาย เราได้มีความคิดดังนี้ว่า<br />
            สุขโสมนัสเกิดขึ้นเพราะอาศัยจักษุ นี้เป็นคุณของจักษุ<br />
            จักษุเป็นของไม่เที่ยงเป็นทุกข์ มีความแปรปรวนเป็นธรรมดา นี้เป็นโทษของจักษุ<br />
            การกำจัดการละฉันทราคะในจักษุ นี้เป็นความสลัดออกแห่งจักษุ ฯลฯ<br />
            สุขโสมนัสที่เกิดขึ้นเพราะอาศัยใจ นี้เป็นคุณแห่งใจ<br />
            ใจมีสภาพไม่เที่ยงเป็นทุกข์ มีความแปรปรวนเป็นธรรมดา นี้เป็นโทษแห่งใจ<br />
            การกำจัดฉันทราคะในใจ นี้เป็นความสลัดออกแห่งใจ<br />
            ดูกรภิกษุทั้งหลาย เรายังไม่รู้ตามความเป็นจริง<br />
            ซึ่งคุณแห่งอายตนะภายใน 6 เหล่านี้ โดยเป็นคุณ<br />
            ซึ่งโทษโดยความเป็นโทษ และซึ่งความสลัดออก<br />
            โดยเป็นความสลัดออกอย่างนี้เพียงใด<br />
            เราก็ยังไม่ปฏิญาณว่าได้ตรัสรู้ ซึ่งอนุตรสัมมาสัมโพธิญาณในโลก<br />
            พร้อมเทวโลก มารโลก พรหมโลก ในหมู่สัตว์<br />
            พร้อมทั้งสมณพราหมณ์เทวดา และมนุษย์เพียงนั้น<br /><br />
            เมื่อใดเราได้รู้ตามความเป็นจริง ซึ่งคุณแห่งอายตนะภายใน 6 เหล่านี้ โดยเป็นคุณ<br />
            ซึ่งโทษโดยความเป็นโทษ<br />
            และซึ่งความสลัดออก โดยเป็นความสลัดออกอย่างนี้<br />
            เมื่อนั้นเราจึงปฏิญาณว่าได้ตรัสรู้ ซึ่งอนุตตรสัมมาสัมโพธิญาณในโลก<br />
            พร้อมเทวโลก มารโลก พรหมโลก ในหมู่สัตว์<br />
            พร้อมทั้งสมณพราหมณ์เทวดาและมนุษย์<br />
            ก็ญาณทัสนะเกิดขึ้นแล้วแก่เราว่า<br />
            ความหลุดพ้นของเราไม่กำเริบ<br />
            ชาตินี้มีในที่สุดบัดนี้ภพใหม่ไม่มี<br /><br /><hr /><br />
            </h4>
            <a href="/forth/lesson0405">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                โนอัสสาสูตรที่ 2
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0404;