import React from 'react';

const Lesson0403 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>พาหิรอนิจจาสูตร</h2>
          </div>
            <h4>
            พาหิรอนิจจาสูตร ว่าด้วยความเป็นอนิจจัง แห่งอายตนะภายนอกทั้งสามกาล<br />
            ดูกรภิกษุทั้งหลาย รูปที่เป็นอดีตและอนาคตเป็นของไม่เที่ยง<br />
            จะกล่าวไปใยถึงรูปที่เป็นปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้ ย่อมไม่มีเยื่อใยในรูปที่เป็นอดีต<br />
            ไม่เพลิดเพลินรูปที่เป็นอนาคต ย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด<br />
            เพื่อดับรูปที่เป็นปัจจุบัน<br />
            เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์<br />
            ที่เป็นอดีตและอนาคตเป็นของไม่เที่ยง<br />
            จะกล่าวไปใยถึงที่ปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้ ย่อมไม่มีเยื่อใยในธรรมารมณ์ที่เป็นอดีต<br />
            ไม่เพลิดเพลินในธรรมารมณ์ที่เป็นอนาคต ย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด<br />
            เพื่อดับซึ่งธรรมารณ์ที่เป็นปัจจุบัน<br /><br />
            ว่าด้วยความเป็นทุกข์ แห่งอายตนะภายนอกทั้งสามกาล<br />
            ดูกรภิกษุทั้งหลาย รูปที่เป็นอดีตและอนาคตเป็นทุกข์<br />
            จะกล่าวไปใยถึงรูปที่เป็นปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้ ย่อมไม่มีเยื่อใยในรูปที่เป็นอดีต<br />
            ไม่เพลิดเพลินรูปที่เป็นอนาคต ย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด<br />
            เพื่อดับรูปที่เป็นปัจจุบัน<br />
            เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์<br />
            ที่เป็นอดีตและอนาคตเป็นทุกข์<br />
            จะกล่าวไปใยถึงที่ปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้ ย่อมไม่มีเยื่อใยในธรรมารมณ์ที่เป็นอดีต<br />
            ไม่เพลิดเพลินในธรรมารมณ์ที่เป็นอนาคต ย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด<br />
            เพื่อดับซึ่งธรรมารณ์ที่เป็นปัจจุบัน<br /><br />
            ว่าด้วยความเป็นอนัตตา แห่งอายตนะภายนอกทั้งสามกาล<br />
            ดูกรภิกษุทั้งหลาย รูปที่เป็นอดีตและอนาคตเป็นอนัตตา<br />
            จะกล่าวไปใยถึงรูปที่เป็นปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้ ย่อมไม่มีเยื่อใยในรูปที่เป็นอดีต<br />
            ไม่เพลิดเพลินรูปที่เป็นอนาคต ย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด<br />
            เพื่อดับรูปที่เป็นปัจจุบัน<br />
            เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์<br />
            ที่เป็นอดีตและอนาคตเป็นอนัตตา<br />
            จะกล่าวไปใยถึงที่ปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้ ย่อมไม่มีเยื่อใยในธรรมารมณ์ที่เป็นอดีต<br />
            ไม่เพลิดเพลินในธรรมารมณ์ที่เป็นอนาคต ย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด<br />
            เพื่อดับซึ่งธรรมารณ์ที่เป็นปัจจุบัน<br /><br /><hr /><br />
            </h4>
            <a href="/forth/lesson0404">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                สัมโพธสูตรที่ 1
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0403;