import React from 'react';

const Lesson0407 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ขัตติยาธิปปายสูตร</h2>
          </div>
            <h4>
            ขัตติยาธิปปายสูตร ว่าด้วยความประสงค์ ของคน 6 จำพวก<br />
            ครั้งนั้นแลชานุสโสนิพราหมณ์ เข้าไปเฝ้าพระผู้มีพระภาค ถึงที่ประทับ<br />
            ได้ปราศรัยกับพระผู้มีพระภาค<br />
            ครั้นผ่านการปราศรัย พอให้ระลึกถึงกันไปแล้ว จึงนั่ง ณ ที่ควรส่วนข้างหนึ่ง<br />
            ครั้นแล้วได้ทูลถาม พระผู้มีพระภาคว่า<br /><br />
            ชานุสโสนิพราหมณ์ ถามพระพุทธเจ้าว่า<br />
            ข้าแต่พระโคดมผู้เจริญ กษัตริย์ทั้งหลาย ย่อมมีความประสงค์อะไร<br />
            นิยมอะไร มั่นใจอะไร ต้องการอะไร มีอะไรเป็นที่สุด<br /><br />
            พระผู้มีพระภาค ตรัสตอบว่า<br />
            ดูกรพราหมณ์ ธรรมดากษัตริย์ทั้งหลาย ย่อมประสงค์โภคทรัพย์<br />
            นิยมปัญญา มั่นใจในกำลังทหาร ต้องการในการได้แผ่นดิน<br />
            มีความเป็นใหญ่เป็นที่สุด<br /><br />
            ชานุสโสนิพราหมณ์ ถามพระพุทธเจ้าต่อไปว่า<br />
            ข้าแต่พระโคดมผู้เจริญ ก็พราหมณ์ทั้งหลาย ย่อมมีความประสงค์อะไร<br />
            นิยมอะไร มั่นใจอะไร ต้องการอะไร มีอะไรเป็นที่สุด<br /><br />
            พระผู้มีพระภาค ตรัสตอบว่า<br />
            ดูกรพราหมณ์ ธรรมดาพราหมณ์ทั้งหลาย ย่อมประสงค์โภคทรัพย์<br />
            นิยมปัญญา มั่นใจในมนต์ ต้องการบูชายัญ<br />
            มีพรหมโลกเป็นที่สุด<br /><br />
            ชานุสโสนิพราหมณ์ ถามพระพุทธเจ้าต่อไปว่า<br />
            ข้าแต่พระโคดมผู้เจริญ ก็คฤหบดีทั้งหลาย ย่อมมีความประสงค์อะไร<br />
            นิยมอะไร มั่นใจในอะไร ต้องการอะไร มีอะไรเป็นที่สุด<br /><br />
            พระผู้มีพระภาค ตรัสตอบว่า<br />
            ดูกรพราหมณ์ ธรรมดาคฤหบดีทั้งหลาย ย่อมประสงค์โภคทรัพย์<br />
            นิยมปัญญา มั่นใจในศิลปะ ต้องการการงาน<br />
            มีการงานที่สำเร็จแล้วเป็นที่สุด<br /><br />
            ชานุสโสนิพราหมณ์ ถามพระพุทธเจ้าต่อไปว่า<br />
            ข้าแต่พระโคดมผู้เจริญ ก็สตรีทั้งหลาย ย่อมประสงค์อะไร<br />
            นิยมอะไร มั่นใจในอะไร ต้องการอะไร มีอะไรเป็นที่สุด<br /><br />
            พระผู้มีพระภาค ตรัสตอบว่า<br />
            ดูกรพราหมณ์ ธรรมดาสตรีทั้งหลาย ย่อมประสงค์บุรุษ<br />
            นิยมเครื่องแต่งตัว มั่นใจในบุตร ต้องการไม่ให้สตรีอื่นร่วมสามี<br />
            มีความเป็นใหญ่ในบ้านเป็นที่สุด<br /><br />
            ชานุสโสนิพราหมณ์ ถามพระพุทธเจ้าต่อไปว่า<br />
            ข้าแต่พระโคดมผู้เจริญ ก็โจรทั้งหลาย ย่อมประสงค์อะไร<br />
            นิยมอะไร มั่นใจอะไร ต้องการอะไร มีอะไรเป็นที่สุด<br /><br />
            พระผู้มีพระภาค ตรัสตอบว่า<br />
            ดูกรพราหมณ์โจรทั้งหลาย ย่อมประสงค์ลักทรัพย์ของผู้อื่น<br />
            นิยมที่เร้นลับ มั่นใจในศาสตรา ต้องการที่มืด<br />
            มีการที่ผู้อื่นไม่เห็นเขาเป็นที่สุด<br /><br />
            ชานุสโสนิพราหมณ์ ถามพระพุทธเจ้าต่อไปว่า<br />
            ข้าแต่พระโคดมผู้เจริญ ก็สมณะทั้งหลาย ย่อมประสงค์อะไร<br />
            นิยมอะไร มั่นใจอะไร ต้องการอะไร มีอะไรเป็นที่สุด<br /><br />
            พระผู้มีพระภาค ตรัสตอบว่า<br />
            ดูกรพราหมณ์ ธรรมดาสมณะทั้งหลาย ย่อมประสงค์ขันติโสรัจจะ<br />
            นิยมปัญญา มั่นใจในศีล ต้องการความไม่มีห่วงใย<br />
            มีพระนิพพานเป็นที่สุด<br /><br />
            ข้าแต่พระโคดมผู้เจริญ อัศจรรย์เรื่องไม่เคยมีได้มีแล้ว<br />
            คือท่านพระโคดม ย่อมทรงทราบความประสงค์<br />
            ความนิยม ความมั่นใจ ความต้องการ และสิ่งที่เป็นที่สุด<br />
            แห่งกษัตริย์ทั้งหลายฯลฯ แห่งพราหมณ์ทั้งหลายฯลฯ<br />
            แห่งคฤหบดีทั้งหลายฯลฯ แม้แห่งสตรีทั้งหลายฯลฯ<br />
            แม้แห่งโจรทั้งหลายฯลฯ<br />
            ย่อมทรงทราบความประสงค์ ความนิยม ความมั่นใจ ความต้องการ<br />
            และสิ่งที่เป็นที่สุด แห่งสมณะทั้งหลาย<br /><br />
            ข้าแต่ท่านพระโคดมผู้เจริญ ภาษิตของพระองค์แจ่มแจ้งนัก<br />
            ข้าแต่ท่านพระโคดมผู้เจริญ ภาษิตของพระองค์แจ่มแจ้งนัก<br />
            ขอท่านพระโคดมทรงจำข้าพระองค์ ว่าเป็นอุบาสกผู้ถึงสรณะตลอดชีวิต<br />
            ตั้งแต่วันนี้เป็นต้นไป<br /><br /><hr /><br />
            </h4>
            <a href="/forth/lesson0408">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                อาพาธสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0407;