import React from 'react';

const Lesson0409 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ยมกวรรคที่ 2</h2>
          </div>
            <h4>
            ยมกวรรคที่ 2<br />
            อวิชชาสูตร ว่าด้วยอวิชชา มีนิวรณ์ 5 เป็นอาหาร<br />
            ดูกรภิกษุทั้งหลาย เงื่อนต้นแห่งอวิชชาย่อมไม่ปรากฏ<br />
            ในกาลก่อนแต่นี้อวิชชาไม่มี แต่ภายหลังจึงมี<br />
            เพราะเหตุนั้นเราจึงกล่าวคำนี้ อย่างนี้ว่าก็เมื่อเป็นเช่นนั้น<br />
            อวิชชามีข้อนี้เป็นปัจจัยจึงปรากฏ<br />
            ดูกรภิกษุทั้งหลาย เราย่อมกล่าว่าอวิชชาว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของอวิชชา ควรจะกล่าวว่านิวรณ์ 5<br />
            แม้นิวรณ์ 5 เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของนิวรณ์ 5 ควรกล่าวว่าทุจริต 3<br />
            แม้ทุจริต 3 เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของทุจริต 3 ควรกล่าวว่าการไม่สำรวมอินทรีย์<br />
            แม้การไม่สำรวมอินทรีย์ เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารแห่งการไม่สำรวมอินทรีย์ ควรกล่าวว่าความไม่มีสติสัมปชัญญะ<br />
            แม้ความไม่มีสติสัมปชัญญะ เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหาร ของความไม่มีสติสัมปชัญญะ<br />
            ควรกล่าวว่าการกระทำไว้ในใจ โดยไม่แยบคาย<br />
            แม้การทำไว้ในใจโดยไม่แยบคาย เราก็กะว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของการทำไว้ในใจ โดยไม่แยบคาย ควรกล่าวว่าความไม่มีศรัทธา<br />
            แม้ความไม่มีศรัทธา เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของความไม่มีศรัทธา ควรกล่าวว่าการไม่ฟังสัทธรรม<br />
            แม้การไม่ฟังสัทธรรม เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของการไม่ฟังสัทธรรม ควรกล่าวว่าการไม่คบสัปบุรุษ<br />
            ดูกรภิกษุทั้งหลายด้วยประการดังนี้<br />
            การไม่คบสัปบุรุษที่บริบูรณ์ ย่อมยังการไม่ฟังสัทธรรมให้บริบูรณ์<br />
            การไม่ฟังสัทธรรมที่บริบูรณ์ ย่อมยังความไม่มีศรัทธาให้บริบูรณ์<br />
            ความไม่มีสถานที่บริบูรณ์ ย่อมยังการทำไว้ในใจ โดยไม่แยบคายให้บริบูรณ์<br />
            การทำไว้ในใจ โดยไม่แยบคายที่บริบูรณ์ ย่อมยังความไม่มีสติสัมปชัญญะให้บริบูรณ์<br />
            ความไม่มีสติสัมปชัญญะที่บริบูรณ์ ย่อมยังการไม่สำรวมอินทรีย์ให้บริบูรณ์<br />
            การไม่สำรวมอินทรีย์ที่บริบูรณ์ ย่อมยังทุจริต 3 ให้บริบูรณ์<br />
            ทุจริต 3 ที่บริบูรณ์ ย่อมยังนิวรณ์ 5 ให้บริบูรณ์<br />
            นิวรณ์ 5 ที่บริบูรณ์ย่อมยังอวิชชาให้บริบูรณ์<br />
            อวิชชานี้มีอาหารอย่างนี้และบริบูรณ์อย่างนี้<br /><br />
            ดูกรภิกษุทั้งหลาย<br />
            เปรียบเหมือนเมื่อฝนเม็ดหยาบ ตกลงเบื้องบนภูเขา<br />
            เมื่อฝนตกหนักอยู่ น้ำนั้นไหลไปตามที่ลุ่ม<br />
            ย่อมยังซอกเขาลำธารและห้วยให้เต็ม<br />
            ซอกเขาลำธารและห้วยที่เต็ม ย่อมยังหนองให้เต็ม<br />
            หนองที่เต็มย่อมยังบึงให้เต็ม บึงที่เต็มย่อมยังแม่น้ำน้อยให้เต็ม<br />
            แม่น้ำน้อยที่เต็มย่อมยังแม่น้ำใหญ่ให้เต็ม<br />
            แม่น้ำใหญ่ที่เต็มย่อมยังมหาสมุทรสาครให้เต็ม<br />
            มหาสมุทรสาครนั้นมีอาหารอย่างนี้ และเต็มเปี่ยมอย่างนี้แม้ฉันใด<br />
            ดูกรภิกษุทั้งหลายการไม่คบสัปบุรุษที่บริบูรณ์<br />
            ย่อมยังการไม่ฟัสัทธรรมให้บริบูรณ์<br />
            นิวรณ์ 5 ที่บริบูรณ์ย่อมยังอวิขชาให้บริบูรณ์<br />
            อวิชชานี้มีอาหารอย่างนี้และบริบูรณ์อย่างนี้<br />
            ฉันนั้นเหมือนกันแล<br /><br />

            ว่าด้วยวิชชาและวิมุตติ มีโพชฌงค์ 7 เป็นอาหาร<br />
            ดูกรภิกษุทั้งหลาย<br />
            เรากล่าววิชาและวิมุตติว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของวิชาและวิมุต ควรกล่าวว่าโพชฌงค์ 7 <br />
            แม้โพชฌงค์ 7 เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของโพชฌงค์ 7 ควรกล่าวว่าสติปัฏฐาน 4 <br />
            แม้สติปัฏฐาน 4 เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของสติปัฏฐาน 4 ควรกล่าวว่าสุจริต 3 <br />
            แม้สุจริต 3 เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของสุจริต 3 ควรกล่าวว่าการสำรวมอินทรีย์<br />
            แม้การสำรวมอินทรีย์เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            อะไรเป็นอาหารของการสำรวมอินทรีย์ ควรกล่าวว่าสติสัมปชัญญะ<br />
            แม้สติสัมปชัญญะเราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            อะไรเป็นอาหารของสติสัมปชัญญะ ควรกล่าวว่าการทำไว้ในใจโดยแยบคาย<br />
            แม้การทำไว้ในใจโดยแยบคาย เราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของการกระทำไว้ในใจโดยแยบคาย ควรกล่าวว่าศรัทธา<br />
            แม้ศรัทธาเราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของศรัทธา ควรกล่าวว่าการฟังสัทธรรม<br />
            แม้การฟังสัทธรรมเราก็กล่าวว่ามีอาหาร มิได้กล่าวว่าไม่มีอาหาร<br />
            ก็อะไรเป็นอาหารของการฟังสัทธรรม ควรกล่าวว่าการคบสัปบุรุษ<br />
            ดูกรภิกษุทั้งหลายด้วยประการดังนี้<br />
            การคบสัปบุรุษที่บริบูรณ์ ย่อมยังการฟังการสัทธรรมให้บริบูรณ์<br />
            การฟังสัทธรรมที่บริบูรณ์ ย่อมยังศรัทธาให้บริบูรณ์<br />
            ศรัทธาที่บริบูรณ์ ย่อมยังการทำไว้ในใจ โดยแยบคายให้บริบูรณ์<br />
            การทำไว้ในใจ โดยแยบคายที่บริบูรณ์ ย่อมยังสติสัมปชัญญะ ให้บริบูรณ์<br />
            สติสัมปชัญญะที่บริบูรณ์ ย่อมยังการสำรวมอินทรีย์ ให้บริบูรณ์<br />
            การสำรวมอินทรีย์ที่บริบูรณ์ อมยังสุจริต 3 ให้บริบูรณ์<br />
            สุจริต 3 ที่บริบูรณ์ย่อมยังสติปัฏฐาน 4 ให้บริบูรณ์<br />
            สติปัฏฐาน 4 ที่บริบูรณ์ ย่อมยังโพชฌงค์ 7 ให้บริบูรณ์<br />
            โพชฌงค์ 7 ที่บริบูรณ์ ย่อมยังวิชชาและวิมุตติให้บริบูรณ์<br />
            วิชชาและวิมุตนี้มีอาหารอย่างนี้ และบริบูรณ์อย่างนี้<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            เปรียบเหมือนเมื่อฝนเม็ดหยาบ ตกลงเบื้องบนภูเขา<br />
            เมื่อฝนตกหนักอยู่ น้ำนั้นไหลไปตามที่ลุ่ม<br />
            ยังซอกเขาลำธารและห้วยให้เต็ม<br />
            ซอกเขาลำธารและห้วยที่เต็ม ย่อมยังหนองให้เต็ม<br />
            หนองที่เต็มย่อมยังบึงให้เต็ม<br />
            บึงที่เต็มย่อมยังแม่น้ำน้อยให้เต็ม<br />
            แม่น้ำน้อยที่เต็มย่อมยังแม่น้ำใหญ่ให้เต็ม<br />
            แม่น้ำใหญ่ที่เต็มย่อมยังมหาสมุทรสาครให้เต็ม<br />
            มหาสมุทรสาครนั้นมีอาหารอย่างนี้<br />
            และเต็มเปี่ยมอย่างนี้แม้ฉันใด<br /><br />
            ดูกรภิกษุทั้งหลาย<br />
            การคบสัปบุรุษที่บริบูรณ์ ย่อมยังการฟังสัทธรรมให้บริบูรณ์<br />
            โพชฌงค์ 7 ที่บริบูรณ์ ย่อมยังวิชชาและวิมุตติให้บริบูรณ์<br />
            วิชชาและวิมุตนี้มีอาหารอย่างนี้<br />
            และบริบูรณ์อย่างนี้ฉันนั้นเหมือนกันแล<br /><br /><hr /><br />
            </h4>
            <a href="/forth/lesson0410">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ฐานสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0409;