import React from 'react';

const Lesson0406 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>อาฬวกสูตรที่ 12</h2>
          </div>
            <h4>
            อาฬวกสูตรที่ 12<br />
            อาฬวกยักษ์ถามปัญหาพระพุทธเจ้า<br />
            อาฬวกยักษ์ทูลถามว่า อะไรหนอเป็นเครื่องปลื้มใจ<br />
            อันประเสริฐของคนในโลกนี้<br />
            อะไรหนอบุคคลประพฤติดี นำความสุขมาให้<br />
            อะไรหนอเป็นรสอันล้ำเลิศ กว่ารสทั้งหลาย<br />
            นักปราชญ์ทั้งหลายกล่าวชีวิต ของผู้ที่เป็นอยู่อย่างไรว่าประเสริฐสุดฯ<br /><br />
            พระผู้มีพระภาคตรัสตอบว่า ศรัทธาเป็นทรัพย์ อันประเสริฐของคนในโลกนี้<br />
            ธรรมอันบุคคลประพฤติดีแล้ว นำสุขมาให้<br />
            ความสัตย์แล เป็นรสอันล้ำเลิศกว่ารสทั้งหลาย<br />
            นักปราชญ์ทั้งหลาย กล่าวชีวิตของผู้ที่เป็นอยู่ ด้วยปัญญาว่าประเสริฐสุดฯ<br /><br />
            อาฬวกยักษ์ทูลถามต่อไปว่า คนข้ามโอฆะได้อย่างไรหนอ<br />
            ข้ามอรรณพได้อย่างไร ล่วงทุกข์ได้อย่างไร บริสุทธิ์ได้อย่างไร<br /><br />
            พระผู้มีพระภาคตรัสตอบว่า คนข้ามโอฆะได้ด้วยศรัทธา<br />
            ข้ามอรรณพได้ด้วยความไม่ประมาท<br />
            ล่วงทุกข์ได้ด้วยความเพียร บริสุทธิ์ได้ด้วยปัญญา<br /><br />
            อาฬวกยักษ์ทูลถามต่อไปว่า คนได้ปัญญาอย่างไรหนอ ทำอย่างไรจึงจะหาทรัพย์ได้<br />
            คนได้ชื่อเสียงอย่างไรหนอ ทำอย่างไรจึงจะผูกมิตรไว้ได้<br />
            คนละโลกนี้ไปสู่โลกหน้า ทำอย่างไรจึงไม่เศร้าโศกฯ<br /><br />
            พระผู้มีพระภาคตรัสตอบว่า บุคคลเชื่อธรรมของพระอรหันต์ เพื่อบรรลุนิพพาน<br />
            ฟังอยู่ด้วยดีย่อมได้ปัญญา เป็นผู้ไม่ประมาทมีวิจารณ์<br />
            คนทำเหมาะเจาะไม่ทอดธุระ เป็นผู้หมั่นย่อมหาทรัพย์ได้<br />
            คนย่อมได้ชื่อเสียง เพราะความสัตย์ ผู้ให้ย่อมผูกมิตรไว้ได้<br />
            บุคคลใดผู้อยู่ครองเรือน ประกอบด้วยศรัทธา<br />
            มีธรรม 4 ประการนี้ คือสัจจะ ธรรม ฐิติ จาคะ <br />
            บุคคลนั้นแลละโลกนี้ไป ย่อมไม่เศร้าโศก<br />
            เชิญถามสมณพราหมณ์เป็นอันมาก เหล่าอื่นว่า<br />
            โลกนี้มีอะไรยิ่งกว่า สัจจะ ธรรม จาคะ และขันติ<br /><br />
            อาฬวกยักษ์ทูลถามว่า<br />
            ทำไมหนอข้าพเจ้าจึงต้องถาม สมณพราหมณ์เป็นอันมาก<br />
            ในบัดนี้วันนี้ข้าพเจ้ารู้ชัดถึง สัมปรายิกประโยชน์<br />
            พระพุทธเจ้าเสด็จมาถึงเมืองอาฬวี<br />
            วันนี้ข้าพเจ้ารู้ชัด ถึงการที่บุคคลให้ในที่ใดมีผลมาก<br />
            ข้าพเจ้าจักเที่ยว จากบ้านไปสู่บ้าน จากบุรีไปสู่บุรี<br />
            พลางนมัสการสัมมาสัมพุทธเจ้า และพระธรรมซึ่งเป็นธรรมที่ดีฯ<br /><br /><hr /><br />
            </h4>
            <a href="/forth/lesson0407">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ขัตติยาธิปปายสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0406;