import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0403 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'พาหิรอนิจจาสูตร^500\nว่าด้วยความเป็นอนิจจัง^500\nแห่งอายตนะภายนอกทั้งสามกาล^500\nดูกรภิกษุทั้งหลาย^500\nรูปที่เป็นอดีตและอนาคตเป็นของไม่เที่ยง^500\nจะกล่าวไปใยถึงรูปที่เป็นปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใยในรูปที่เป็นอดีต^500\nไม่เพลิดเพลินรูปที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด^500\nเพื่อดับรูปที่เป็นปัจจุบัน^500\nเสียง กลิ่น รส^500\nโผฏฐัพพะ ธรรมารมณ์^500\nที่เป็นอดีตและอนาคตเป็นของไม่เที่ยง^500\nจะกล่าวไปใยถึงที่ปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใยในธรรมารมณ์ที่เป็นอดีต^500\nไม่เพลิดเพลินในธรรมารมณ์ที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด^500\nเพื่อดับซึ่งธรรมารณ์ที่เป็นปัจจุบัน',
        'ว่าด้วยความเป็นทุกข์^500\nแห่งอายตนะภายนอกทั้งสามกาล^500\nดูกรภิกษุทั้งหลาย^500\nรูปที่เป็นอดีตและอนาคตเป็นทุกข์^500\nจะกล่าวไปใยถึงรูปที่เป็นปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใยในรูปที่เป็นอดีต^500\nไม่เพลิดเพลินรูปที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด^500\nเพื่อดับรูปที่เป็นปัจจุบัน^500\nเสียง กลิ่น รส^500\nโผฏฐัพพะ ธรรมารมณ์^500\nที่เป็นอดีตและอนาคตเป็นทุกข์^500\nจะกล่าวไปใยถึงที่ปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใยในธรรมารมณ์ที่เป็นอดีต^500\nไม่เพลิดเพลินในธรรมารมณ์ที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด^500\nเพื่อดับซึ่งธรรมารณ์ที่เป็นปัจจุบัน^500\nว่าด้วยความเป็นอนัตตา^500\nแห่งอายตนะภายนอกทั้งสามกาล^500\nดูกรภิกษุทั้งหลาย^500\nรูปที่เป็นอดีตและอนาคตเป็นอนัตตา^500\nจะกล่าวไปใยถึงรูปที่เป็นปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใยในรูปที่เป็นอดีต^500\nไม่เพลิดเพลินรูปที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด^500\nเพื่อดับรูปที่เป็นปัจจุบัน^500\nเสียง กลิ่น รส^500\nโผฏฐัพพะ ธรรมารมณ์^500\nที่เป็นอดีตและอนาคตเป็นอนัตตา^500\nจะกล่าวไปใยถึงที่ปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใยในธรรมารมณ์ที่เป็นอดีต^500\nไม่เพลิดเพลินในธรรมารมณ์ที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด^500\nเพื่อดับซึ่งธรรมารณ์ที่เป็นปัจจุบัน'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i className="bi bi-x-lg" />
            </button>
            <a href="/lesson0404">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" />
              </button>
            </a>
            <h2 style={{display: 'inline-block'}}>พาหิรอนิจจาสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0403;