import React from 'react';

const Lesson0402 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>อดีต อนาคต ปัจจุบัน อนิจจสูตร</h2>
          </div>
            <h4>
            อดีต อนาคต ปัจจุบัน อนิจจสูตร<br />
            ว่าด้วยความเป็นอนิจจัง แห่งอายตนะภายในทั้งสามกาล<br />
            ดูกรภิกษุทั้งหลาย<br />
            จักษุที่เป็นอดีตและอนาคต เป็นของไม่เที่ยง<br />
            จะกล่าวไปใยถึงจักษุ ที่เป็นปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้ว เห็นอยู่อย่างนี้<br />
            ย่อมไม่มีเยื่อใย ในจักษุที่เป็นอดีต<br />
            ไม่เพลิดเพลินจักษุ ที่เป็นอนาคต<br />
            ย่อมปฏิบัติเพื่อเบื่อหน่าย เพื่อคลายกำหนัด<br />
            เพื่อดับจักษุที่เป็นปัจจุบัน<br />
            หู จมูก ลิ้น กาย ใจ ที่เป็นอดีตและอนาคต เป็นของไม่เที่ยง<br />
            จะกล่าวไปใย ถึงใจที่เป็นปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้ว เห็นอยู่อย่างนี้<br />
            ย่อมไม่มีเยื่อใยในใจ ที่เป็นอดีต<br />
            ไม่เพลิดเพลินในใจ ที่เป็นอนาคต<br />
            ย่อมปฏิบัติเพื่อเบื่อหน่าย เพื่อคลายกำหนัด เพื่อดับซึ่งใจที่เป็นปัจจุบัน<br /><br /><hr /><br />
            อดีต อนาคต ปัจจุบัน ทุกข์สูตร<br />
            ว่าด้วยความเป็นทุกข์ แห่งอายตนะภายในทั้งสามกาล<br />
            ดูกรภิกษุทั้งหลาย จักษุที่เป็นอดีตและอนาคต เป็นทุกข์<br />
            จะกล่าวไปใย ถึงจักษุที่เป็นปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้ว เห็นอยู่อย่างนี้<br />
            ย่อมไม่มีเยื่อใย ในจักษุที่เป็นอดีต<br />
            ไม่เพลิดเพลินจักษุ ที่เป็นอนาคต<br />
            ย่อมปฏิบัติเพื่อเบื่อหน่าย เพื่อคลายกำหนัด เพื่อดับจักษุที่เป็นปัจจุบัน<br />
            หู จมูก ลิ้น กาย ใจ ที่เป็นอดีตและอนาคต เป็นทุกข์<br />
            จะกล่าวไปใยถึงใจ ที่เป็นปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้ว เห็นอยู่อย่างนี้<br />
            ย่อมไม่มีเยื่อใยในใจ ที่เป็นอดีต<br />
            ไม่เพลิดเพลินในใจ ที่เป็นอนาคต<br />
            ย่อมปฏิบัติเพื่อเบื่อหน่าย เพื่อคลายกำหนัด<br />
            เพื่อดับซึ่งใจที่เป็นปัจจุบัน<br /><br /><hr /><br />
            อดีต อนาคต ปัจจุบัน อนัตตาสูตร<br />
            ว่าด้วยความเป็นอนัตตา แห่งอายตนะภายใน ทั้งสามกาล<br />
            ดูกรภิกษุทั้งหลาย จักษุที่เป็นอดีตและอนาคต เป็นอนัตตา<br />
            จะกล่าวไปใย ถึงจักษุที่เป็นปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้ว เห็นอยู่อย่างนี้<br />
            ย่อมไม่มีเยื่อใย ในจักษุที่เป็นอดีต<br />
            ไม่เพลิดเพลินจักษุ ที่เป็นอนาคต<br />
            ย่อมปฏิบัติเพื่อเบื่อหน่าย เพื่อคลายกำหนัด เพื่อดับจักษุที่เป็นปัจจุบัน<br />
            หู จมูก ลิ้น กาย ใจ ที่เป็นอดีตและอนาคต เป็นอนัตตา<br />
            จะกล่าวไปใยถึงใจ ที่เป็นปัจจุบันเล่า<br />
            อริยสาวกผู้ได้สดับแล้ว เห็นอยู่อย่างนี้<br />
            ย่อมไม่มีเยื่อใยในใจ ที่เป็นอดีต<br />
            ไม่เพลิดเพลินในใจ ที่เป็นอนาคต<br />
            ย่อมปฏิบัติเพื่อเบื่อหน่าย เพื่อคลายกำหนัด เพื่อดับซึ่งใจที่เป็นปัจจุบัน<br /><br /><hr /><br />
            </h4>
            <a href="/forth/lesson0403">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                พาหิรอนิจจาสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0402;