import React from 'react';

const Lesson0410 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ฐานสูตร</h2>
          </div>
            <h4>
            ฐานสูตร ว่าด้วยฐานะ ที่ควรพิจารณาเนืองๆ 5 ประการ<br />
            ดูกรภิกษุทั้งหลายฐานะ 5 ประการนี้<br />
            อันสตรี บุรุษ คฤหัสถ์หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆ 5 ประการเป็นไฉน<br />
            คือ สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆว่า<br />
            เรามีความแก่เป็นธรรมดา ไม่ล่วงพ้นความแก่ไปได้ 1 <br />
            เรามีความเจ็บไข้เป็นธรรมดา ไม่ล่วงพ้นความเจ็บไข้ไปได้ 1 <br />
            เรามีความตายเป็นธรรมดา ไม่ล่วงพ้นความตายไปได้ 1<br />
            เราต้องพลัดพรากจากของรัก ของชอบใจทั้งสิ้น 1 <br />
            เรามีกรรมเป็นของตน เป็นทายาทแห่งกรรม<br />
            มีกรรมเป็นกำเนิด มีกรรมเป็นเผ่าพันธุ์ มีกรรมเป็นที่พึ่ง <br />
            จะทำกรรมใดไว้ดีก็ตาม ชั่วก็ตาม<br />
            เราจะเป็นผู้รับผลของกรรมนั้น 1<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์อะไร<br />
            สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆว่า<br />
            เรามีความแก่เป็นธรรมดา ไม่ล่วงพ้นความแก่ไปได้<br />
            ดูกรภิกษุทั้งหลาย<br />
            ความมัวเมาในความเป็นหนุ่มสาว มีอยู่แก่สัตว์ทั้งหลาย<br />
            ซึ่งเป็นเหตุให้สัตว์ทั้งหลาย ประพฤติทุจริตด้วยกายวาจาใจ<br />
            เมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ ย่อมละความมัวเมา<br />
            ในความเป็นหนุ่มสาวนั้นได้ โดยสิ้นเชิง<br />
            หรือทำให้เบาบางลงได้<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์นี้แล สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆว่า<br />
            เรามีความแก่เป็นธรรมดา ไม่ล่วงพ้นความแก่ไปได้<br />
            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์อะไร สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆว่า<br />
            เรามีความเจ็บไข้เป็นธรรมดา ไม่ล่วงพ้นความเจ็บไข้ไปได้<br />
            ดูกรภิกษุทั้งหลาย<br />
            ความมัวเมาในความไม่มีโรค มีอยู่แก่สัตว์ทั้งหลาย<br />
            ซึ่งเป็นเหตุให้สัตว์ทั้งหลาย ประพฤติทุจริตด้วยกายวาจาใจ<br />
            เมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ<br />
            ย่อมละความมัวเมา ในความไม่มีโรคนั้นได้ โดยสิ้นเชิง<br />
            หรือทำให้เบาบางลงได้<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์นี้แล<br />
            สตรี บุรุษ คฤหัสถ์หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆว่า<br />
            เรามีความเจ็บไข้เป็นธรรมดา ไม่ล่วงพ้นความเจ็บไข้ไปได้<br />
            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์อะไร<br />
            สตรี บุรุษ คฤหัสถ์หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆว่า<br />
            เรามีความตายเป็นธรรมดา ไม่ล่วงพ้นความตายไปได้<br />
            ดูกรภิกษุทั้งหลาย<br />
            ความเมาในชีวิตมีอยู่แก่สัตว์ทั้งหลาย<br />
            ซึ่งเป็นเหตุให้สัตว์ทั้งหลาย ประพฤติทุจริตด้วยกายวาจาใจ<br />
            เมื่อเข้าพิจารณาฐานะนั้นอยู่เนืองๆ ย่อมละความมัวเมาในชีวิตนั้นได้ โดยสิ้นเชิง<br />
            หรือทำให้เบาบางลงได้<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์นี้แล<br />
            สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆว่า<br />
            เรามีความตายเป็นธรรมดา ไม่ล่วงพ้นความตายไปได้<br />
            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์อะไร<br />
            สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต<br />
            จึงควรพิจารณาเนืองๆว่า<br />
            เราจะต้องพลัดพรากจากของรัก ของชอบใจทั้งสิ้น<br />
            ดูกรภิกษุทั้งหลาย<br />
            ความพอใจ ความรักใคร่ ในของรักมีอยู่แก่สัตว์ทั้งหลาย<br />
            ซึ่งเป็นเหตุให้สัตว์ทั้งหลาย ประพฤติทุจริตด้วยกายวาจาใจ<br />
            เมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ ย่อมละความพอใจความรักใคร่นั้นได้ โดยสิ้นเชิง<br />
            หรือทำให้เบาบางลงได้<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์นี้แล<br />
            สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆว่า<br />
            เราจะต้องพลัดพรากจากของรัก ของชอบใจทั้งสิ้น<br />
            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์อะไร<br />
            สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต<br />
            ควรพิจารณาเนืองๆว่า<br />
            เรามีกรรมเป็นของตน เป็นทายาทแห่งกรรม<br />
            มีกรรมเป็นกำเนิด มีกรรมเป็นเผ่าพันธุ์ มีกรรมเป็นที่พึ่ง<br />
            จะทำกรรมใดดีก็ตามชั่วก็ตาม<br />
            เราจะเป็นผู้รับผลของกรรมนั้น<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            กายทุจริตวจีทุจริตมโนทุจริต มีอยู่แก่สัตว์ทั้งหลาย<br />
            เมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ ย่อมละทุจริตได้โดยสิ้นเชิง<br />
            หรือทำให้เบาบางลงได้<br /><br />

            ดูกรภิกษุทั้งหลาย<br />
            เพราะอาศัยอำนาจประโยชน์นี้แล<br />
            สตรี บุรุษ คฤหัสถ์หรือบรรพชิต<br />
            จึงควรพิจารณาเนืองๆว่า<br />
            เรามีกรรมเป็นของตน เป็นทายาทแห่งกรรม<br />
            มีกรรมเป็นกำเนิด มีกรรมเป็นเผ่าพันธุ์ มีกรรมเป็นที่พึ่ง<br />
            จะทำกรรมใดดีก็ตามชั่วก็ตาม เราจะเป็นผู้รับผลของกรรมนั้น<br /><br /><hr /><br />

            ว่าด้วยผลแห่งการพิจารณาฐานะ 5<br />
            ดูกรภิกษุทั้งหลาย<br />
            อริยสาวกนั้นย่อมพิจารณา<br />
            เห็นดังนี้ว่าไม่ใช่เราแต่ผู้เดียวเท่านั้น ที่มีความแก่เป็นธรรมดา<br />
            ไม่ล่วงพ้นความแก่ไปได้<br />
            โดยที่แท้สัตว์ทั้งปวงบรรดา<br />
            ที่มีการมาการไปการจุติการอุปบัติ ล้วนมีความแก่เป็นธรรมดา<br />
            ไม่ล่วงพ้นความแก่ไปได้<br /><br />

            เมื่ออริยสาวกนั้น<br />
            พิจารณาฐานะนั้นอยู่เนืองๆ มรรคย่อมเกิดขึ้น<br />
            อริยสาวกนั้นย่อมเสพอบรม ทำให้มากซึ่งมรรคนั้น<br />
            เมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่ ย่อมละสังโยชน์ได้ อนุสัยย่อมสิ้นไป<br /><br />

            อริยสาวกนั้นย่อมพิจารณา<br />
            เห็นดังนี้ว่าไม่ใช่เราแต่ผู้เดียวเท่านั้น ที่มีความเจ็บไข้เป็นธรรมดา<br />
            ไม่ล่วงพ้นความเจ็บไข้ไปได้<br />
            โดยที่แท้สัตว์ทั้งปวง<br />
            บรรดาที่มีการมาการไปการจุติการอุปบัติ ล้วนมีความเจ็บไข้เป็นธรรมดา<br />
            ไม่ล่วงพ้นความเจ็บไข้ไปได้<br /><br />

            เมื่ออริยสาวกนั้นพิจารณาฐานะ นั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น<br />
            อริยสาวกนั้นย่อมเสพอบรม ทำให้มากซึ่งมรรคนั้น<br />
            เมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่ ย่อมละสังโยชน์ได้อนุสัยย่อมสิ้นไป<br /><br />

            อริยสาวกนั้นย่อมพิจารณา<br />
            เห็นดังนี้ว่าไม่ใช่เราแต่ผู้เดียวเท่านั้น ที่มีความตายเป็นธรรมดา<br />
            ไม่ล่วงพ้นความตายไปได้<br />
            โดยที่แท้สัตว์ทั้งปวง<br />
            บรรดาที่มีการมาการไปการจุติการอุปบัติ ล้วนมีความตายเป็นธรรมดา<br />
            ไม่ล่วงพ้นความตายไปได้ เมื่ออริยสาวกนั้นพิจารณาฐานะ<br />
            นั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น<br />
            อริยสาวกนั้นย่อมเสพอบรม ทำให้มากซึ่งมรรคนั้น<br />
            เมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่ ย่อมละสังโยชน์ได้อนุสัยย่อมสิ้นไป<br /><br />

            อริยสาวกนั้นย่อมพิจารณาเห็นดังนี้ว่า<br />
            ไม่ใช่เราแต่ผู้เดียวเท่านั้นที่จะต้อง พลัดพรากจากของรักของชอบใจทั้งสิ้น<br />
            โดยที่แท้สัตว์ทั้งปวง บรรดาที่มีการมาการไปการจุติการอุปบัติ<br />
            ล้วนจะต้องพลัดพรากจากของรัก ของชอบใจทั้งสิ้น<br /><br />

            เมื่ออริยสาวกนั้นพิจารณาฐานะนั้นอยู่เนืองๆ มรรคย่อมเกิดขึ้น<br />
            อริยสาวกนั้นย่อมเสพอบรม ทำให้มากซึ่งมรรคนั้น<br />
            เมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่ ย่อมละสังโยชน์ได้ อนุสัยย่อมสิ้นไป<br />
            อริยสาวกนั้นย่อมพิจารณาเห็นดังนี้ว่า<br />
            ไม่ใช่เราแต่ผู้เดียวเท่านั้น ที่มีกรรมเป็นของตน<br />
            เป็นทายาทแห่งกรรม มีกรรมเป็นกำเนิด<br />
            มีกรรมเป็นเผ่าพันธุ์ มีกรรมเป็นที่พึ่ง<br />
            จักทำกรรมใดดีก็ตามชั่วก็ตาม<br />
            เราจะเป็นผู้รับผลของกรรมนั้น<br />
            โดยที่แท้สัตว์ทั้งปวง บรรดาที่มีการมาการไปการจุติการอุปบัติ<br />
            ล้วนมีกรรมเป็นของตน เป็นทายาทแห่งกรรม<br />
            มีกรรมเป็นกำเนิด มีกรรมเป็นเผ่าพันธุ์ มีกรรมเป็นที่พึ่ง<br />
            จะทำกรรมใดดีก็ตามชั่วก็ตาม จะเป็นผู้รับผลของกรรมนั้น<br /><br />

            เมื่ออริยสาวกนั้นพิจารณาฐานะ นั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น<br />
            อริยสาวกนั้นย่อมเสพอบรม ทำให้มากซึ่งมรรคนั้นอยู่<br />
            ย่อมละสังโยชน์ได้ อนุสัยย่อมสิ้นไป<br />
            สัตว์ทั้งหลายย่อม มีความแก่เป็นธรรมดา<br />
            มีความเจ็บไข้เป็นธรรมดา มีความตายเป็นธรรมดา<br />
            สัตว์ทั้งหลายย่อมเป็นไปตามธรรมดา พวกปุถุชนย่อมเกลียด<br />
            ถ้าเราพึงเกลียดธรรมนั้น ในพวกสัตว์ผู้มีอย่างนั้นเป็นธรรมดา<br />
            ข้อนั้นไม่สมควรแก่เราผู้เป็นอยู่อย่างนี้ เรานั้นเป็นอยู่อย่างนี้<br />
            ทราบธรรมที่หาอุปธิมิได้ เห็นการออกบวช โดยเป็นธรรมเกษม<br />
            ครอบงำความมัวเมาทั้งปวง ในความไม่มีโรค<br />
            ในความเป็นหนุ่มสาว และในชีวิตความอุตสาหะได้มีแล้วแก่เรา<br />
            ผู้เห็นเฉพาะซึ่งนิพพาน<br />
            บัดนี้เราไม่ควรเพื่อเสพกามทั้งหลาย<br />
            จะเป็นผู้ประพฤติไม่ถอยหลัง ตั้งหน้าประพฤติพรหมจรรย์<br /><br /><hr /><br />
            </h4>
            <a href="/fifth/lesson0501">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                วิปัสสนาภาวนา พิจารณาขันธ์ 5 อินทรีย์ 6
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0410;