import React from 'react';

const Lesson0104 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>การพิจารณาอินทรีย์ 6</h2>
          </div>
            <h4>
            ตาเห็นรูป รูปไม่เที่ยงเกิดดับ จักขุไม่เที่ยงเกิดดับ รูปไม่เที่ยงเกิดดับ<br />
            จักขุวิญญาณไม่เที่ยงเกิดดับ จักขุสัมผัสไม่เที่ยงเกิดดับ<br />
            กำหนดรู้องค์ประกอบของตาเห็นรูป โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากจักขุสัมผัสเป็นปัจจัย คือผลต่อเนื่องของ โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ผลต่อเนื่องของตาเห็นรูป โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ โสตะไม่เที่ยงเกิดดับ เสียงไม่เที่ยงเกิดดับ<br />
            โสตะวิญญาณไม่เที่ยงเกิดดับ โสตะสัมผัสไม่เที่ยงเกิดดับ<br />
            กำหนดรู้องค์ประกอบของหูได้ยินเสียง โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากโสตะสัมผัสเป็นปัจจัย คือผลต่อเนื่องของ โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ผลต่อเนื่องของหูได้ยินเสียง โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ฆานะไม่เที่ยงเกิดดับ กลิ่นไม่เที่ยงเกิดดับ<br />
            ฆานะวิญญาณไม่เที่ยงเกิดดับ ฆานะสัมผัสไม่เที่ยงเกิดดับ<br />
            กำหนดรู้องค์ประกอบของจมูกได้กลิ่น โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากฆานะสัมผัสเป็นปัจจัย คือผลต่อเนื่องของ โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ผลต่อเนื่องของจมูกได้กลิ่น โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ลิ้นได้รส รสไม่เที่ยงเกิดดับ ชิวหาไม่เที่ยงเกิดดับ รสไม่เที่ยงเกิดดับ<br />
            ชิวหาวิญญาณไม่เที่ยงเกิดดับ ชิวหาสัมผัสไม่เที่ยงเกิดดับ<br />
            กำหนดรู้องค์ประกอบของลิ้นได้รส โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากชิวหาสัมผัสเป็นปัจจัย คือผลต่อเนื่องของ โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ผลต่อเนื่องของลิ้นได้รส โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ กายไม่เที่ยงเกิดดับ โผฏฐัพพะไม่เที่ยงเกิดดับ<br />
            กายวิญญาณไม่เที่ยงเกิดดับ กายสัมผัสไม่เที่ยงเกิดดับ<br />
            กำหนดรู้องค์ประกอบของกายสัมผัส โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากกายสัมผัสเป็นปัจจัย คือผลต่อเนื่องของ โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ผลต่อเนื่องของกายสัมผัส โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br />
            ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ มโนไม่เที่ยงเกิดดับ ธรรมารมณ์ไม่เที่ยงเกิดดับ<br />
            มโนวิญญาณไม่เที่ยงเกิดดับ มโนสัมผัสไม่เที่ยงเกิดดับ<br />
            กำหนดรู้องค์ประกอบของใจคิดนึก โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากมโนสัมผัสเป็นปัจจัย คือผลต่อเนื่องของ โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br />
            กำหนดรู้ผลต่อเนื่องของใจคิดนึก โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <a href="/primary/lesson0105">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ฝึกเอาความจริงไปใช้
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0104;