import React from 'react';

const Lesson0102 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ตามทันตัวเรา</h2>
          </div>
            <h4>
              ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              กายสัมผัส ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              ใจคิดนึก ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br /><br />
              ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              รูปเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              เสียงเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              กลิ่นเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              รสเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              สัมผัสเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              ความคิดเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br /><hr /><br />
              ใบหน้าไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              ใบหน้าเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              คอไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              คอเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              อกไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              อกเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              ท้องไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              ท้องเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              แขนไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              แขนเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              ขาไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              ขาเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              เสื้อไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              เสื้อเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              กระดุมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              กระดุมเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              กางเกงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              กางเกงเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              ซิปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              ซิปเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              ตะขอไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              ตะขอเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
              ถุงเท้าไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
              ถุงเท้าเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
              ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br /><hr /><br />
            </h4>
            <a href="/primary/lesson0103">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ฝึกเห็นตามจริง
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0102;