import React from 'react';

const Lesson0103 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ฝึกเห็นตามจริง</h2>
          </div>
            <h4>
            ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางตา เป็นเพียงแค่รูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br /><br />
            หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางหู เป็นเพียงแค่เสียง<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br /><br />
            จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางจมูก เป็นเพียงแค่กลิ่น<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br /><br />
            ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางลิ้น เป็นเพียงแค่รส<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br /><br />
            กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางกาย เป็นเพียงแค่สัมผัส<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br /><br />
            ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางใจ เป็นเพียงแค่ความคิด<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม—-จริง<br /><br /><hr /><br />
            ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางตา เป็นเพียงแค่รูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ 1…2…3…4…5…6…7…8…9…10<br /><br />
            หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางหู เป็นเพียงแค่เสียง<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ 1…2…3…4…5…6…7…8…9…10<br /><br />
            จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางจมูก เป็นเพียงแค่กลิ่น<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ 1…2…3…4…5…6…7…8…9…10<br /><br />
            ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางลิ้น เป็นเพียงแค่รส<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ 1…2…3…4…5…6…7…8…9…10<br /><br />
            กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางกาย เป็นเพียงแค่สัมผัส<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ 1…2…3…4…5…6…7…8…9…10<br /><br />
            ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางใจ เป็นเพียงแค่ความคิด<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ 1…2…3…4…5…6…7…8…9…10<br /><br /><hr /><br />
            ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            รูปเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            เสียงเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            กลิ่นเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            รสเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            กายสัมผัส ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สัมผัสเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            ใจคิดนึก ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ความคิดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            รูป ร่างกาย ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่เที่ยงเกิดดับ<br />
            เวทนา ความพอใจ ไม่พอใจ ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่เที่ยงเกิดดับ<br />
            สัญญา ความจำ ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่เที่ยงเกิดดับ<br />
            สังขาร ความคิด ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่เที่ยงเกิดดับ<br />
            วิญญาณ ความรู้ ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            รูป ร่างกาย อย่างใดอย่างหนึ่ง ที่เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            เวทนา ความพอใจไม่พอใจ อย่างใดอย่างหนึ่ง ที่เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            สัญญา ความจำ อย่างใดอย่างหนึ่ง ที่เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            สังขาร ความคิด อย่างใดอย่างหนึ่ง ที่เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            วิญญาณ ความรู้ อย่างใดอย่างหนึ่ง ที่เป็นอดีต อนาคต และปัจจุบัน<br />
            ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            อุปทานขันธ์ 5 เป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
            <a href="/primary/lesson0104">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                การพิจารณาอินทรีย์ 6
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0103;