import React from 'react';

const Lesson0105 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ฝึกเอาความจริงไปใช้</h2>
          </div>
            <h4>
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันคือ รูป เวทนา สัญญา สังขาร วิญญาณ ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            รูปร่างกายไม่เที่ยง เป็นเหตุเป็นปัจจัย ให้เกิดเวทนาความพอใจไม่พอใจ<br />
            เมื่อเหตุปัจจัยไม่เที่ยง เวทนาความพอใจไม่พอใจจะเที่ยงได้อย่างไร<br /><br />
            เวทนาความพอใจไม่พอใจไม่เที่ยง เป็นเหตุเป็นปัจจัย ให้เกิดสัญญาความจำ<br />
            เมื่อเหตุปัจจัยไม่เที่ยง สัญญาความจำจะเที่ยงได้อย่างไร<br /><br />
            สัญญาความจำไม่เที่ยง เป็นเหตุเป็นปัจจัยให้เกิดสังขารความคิด<br />
            เมื่อเหตุปัจจัยไม่เที่ยง สังขารความคิดจะเที่ยงได้อย่างไร<br /><br />
            สังขารความคิดไม่เที่ยง เป็นเหตุเป็นปัจจัยให้เกิดวิญญาณความรู้<br />
            เมื่อเหตุปัจจัยไม่เที่ยง วิญญาณความรู้จะเที่ยงได้อย่างไร<br /><br /><hr /><br />
            อวัยวะภายใน ภายนอก ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            อายตนะภายใน ตา หู จมูก ลิ้น กาย ใจ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            อายตนะภายนอก รูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            ดิน น้ำ ลม ไฟ ภายใน ภายนอก ตัวเรา ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ <br /><br /><hr /><br />
            ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มากระทบสัมผัสทางตา เป็นเพียงรูปธรรมชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มากระทบสัมผัสทางหู เป็นเพียงรูปธรรมชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มากระทบสัมผัสทางจมูก เป็นเพียงรูปธรรมชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ลิ้นได้ยินรส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มากระทบสัมผัสทางลิ้น เป็นเพียงรูปธรรมชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มากระทบสัมผัสทางกาย เป็นเพียงรูปธรรมชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มากระทบสัมผัสทางใจ เป็นเพียงนามธรรมชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            สิ่งทั้งปวงที่มากระทบสัมผัส ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่น ว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            มโนกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ตัวกู ของกูไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ตัวกู ของกูไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ความอวดดีไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ความอวดดีไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ความอิจฉาริษยาไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ความอิจฉาริษยาไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            ปากพูดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ปากพูดไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            เท้าเดินไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            เท้าเดินไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            มือจับไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มือจับไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ<br /><br />
            มโนกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มโนกรรมไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br /><br />
            ตัวกู ของกูไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ตัวกู ของกูไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br /><br />
            ความอวดดีไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ความอวดดีไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br /><br />
            ความอิจฉาริษยาไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ความอิจฉาริษยาไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br /><br />
            ปากพูดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ปากพูดไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br /><br />
            เท้าเดินไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            เท้าเดินไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br /><br />
            มือจับไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            มือจับไม่มีตัวตนเป็นของตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นอขงตนเอง กำลังจะแตกสลาย ไม่เที่ยงเกิดดับ จริงไหม...จริง<br /><br /><hr /><br />
            </h4>
            <a href="/primary/lesson0106">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ฝึกเอาความจริงไปใช้
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0105;