import React from 'react';

const Lesson0106 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ฝึกเอาความจริงไปใช้</h2>
          </div>
            <h4>
            ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            พัดลม ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            พัดลมเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ<br />
            ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางตา เป็นเพียงแค่รูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง จริงอย่างไร<br />
            จริง เพราะ รูปมาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนี้ พัดลมเกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            องค์ประกอบของพัดลม เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            รูปทุกรูปที่มาปรากฏทางตา เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            จริงอย่างไร อวัยวะภายใน ภายนอก<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            ดีใจ เสียใจ ความสุข ความทุกข์<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            การกระทำ ความคิดเห็น นั่งนอน ไปไหนมาไหน<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            สิ่งทั้งปวงที่เกิดขึ้นกับตัวเราทั้งหมด เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br /><br />
            หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            เสียงกลอง ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            เสียงกลองเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ<br />
            ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางหู เป็นเพียงแค่เสียง<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง จริงอย่างไร<br />
            จริง เพราะ เสียงมาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนี้ เสียงกลองเกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            องค์ประกอบของกลอง เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            เสียงทุกเสียงที่มาปรากฏทางหู เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            จริงอย่างไร อวัยวะภายใน ภายนอก<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            ดีใจ เสียใจ ความสุข ความทุกข์<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            การกระทำ ความคิดเห็น นั่งนอน ไปไหนมาไหน<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            สิ่งทั้งปวงที่เกิดขึ้นกับตัวเราทั้งหมด เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br /><br />
            จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            กลิ่นผัดกระเพรา ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            กลิ่นผัดกระเพราเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ<br />
            ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางจมูก เป็นเพียงแค่กลิ่น<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง จริงอย่างไร<br />
            จริง เพราะ กลิ่นมาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนี้ กลิ่นผัดกระเพราเกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            องค์ประกอบของผัดกระเพราะ เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            กลิ่นทุกกลิ่นที่มาปรากฏทางจมูก เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            จริงอย่างไร อวัยวะภายใน ภายนอก<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            ดีใจ เสียใจ ความสุข ความทุกข์<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            การกระทำ ความคิดเห็น นั่งนอน ไปไหนมาไหน<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            สิ่งทั้งปวงที่เกิดขึ้นกับตัวเราทั้งหมด เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            รสไอติม ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            รสไอติมเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ<br />
            ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br /><br />
            ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางลิ้น เป็นเพียงแค่รส<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง จริงอย่างไร<br />
            จริง เพราะ รสมาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนี้ ไอติมเกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            องค์ประกอบของไอติม เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            รสทุกรสที่มาปรากฏทางลิ้น เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            จริงอย่างไร อวัยวะภายใน ภายนอก<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            ดีใจ เสียใจ ความสุข ความทุกข์<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            การกระทำ ความคิดเห็น นั่งนอน ไปไหนมาไหน<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            สิ่งทั้งปวงที่เกิดขึ้นกับตัวเราทั้งหมด เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br /><br />
            กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            เย็น ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            เย็นเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ<br />
            ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางกาย เป็นเพียงแค่สัมผัส<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง จริงอย่างไร<br />
            จริง เพราะ สัมผัสมาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนี้ สัมผัสเย็น ร้อน อ่อน แข็ง ตึง ไหว<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            สัมผัสทั้งปวง เย็น ร้อน อ่อน แข็ง ตึง ไหว<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            จริงอย่างไร อวัยวะภายใน ภายนอก<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            ดีใจ เสียใจ ความสุข ความทุกข์<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            การกระทำ ความคิดเห็น นั่งนอน ไปไหนมาไหน<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            สิ่งทั้งปวงที่เกิดขึ้นกับตัวเราทั้งหมด เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br /><br />
            ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ความคิด ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ความคิดเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ<br />
            ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สิ่งที่มาปรากฏทางใจ เป็นเพียงแค่ความคิด<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง จริงอย่างไร<br />
            จริง เพราะ ความคิดมาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง ดังนี้ คิดถึงคน คนก็เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            คิดถึงตนเอง ตนเองก็เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            คิดถึงสิ่งของ สิ่งของก็เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย จริงไหม...จริง<br />
            ความคิดทั้งปวงที่มาปรากฏทางใจ เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเป็นเพียงรูป<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            จริงอย่างไร อวัยวะภายใน ภายนอก<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            ดีใจ เสียใจ ความสุข ความทุกข์<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            การกระทำ ความคิดเห็น นั่งนอน ไปไหนมาไหน<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            จริงไหม...จริง<br />
            สิ่งทั้งปวงที่เกิดขึ้นกับตัวเราทั้งหมด เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            สิ่งทั้งปวงที่มากระทบสัมผัส เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            รูปเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            รูปเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            เสียงเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            เสียงเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            กลิ่นเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            กลิ่นเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            รสเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            รสเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            กายสัมผัส ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            สัมผัสเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            สัมผัสเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br />
            ใจคิดนึก ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ<br />
            ความคิดเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ตัวฉันไม่เที่ยงเกิดดับ ตัวฉันเกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ความคิดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย<br />
            ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา<br />
            ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่า สิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ<br /><br /><hr /><br />
            </h4>
        </div>
      </section>
    </div>
  )
}

export default Lesson0106;