import React from 'react';

const Life02 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>วิธีเจริญหรือสร้างปัญญา ปฏิบัติอย่างไร?</h2>
          </div>
          <h4>
            <p>เมื่อมีอะไรมากระทบสัมผัส ตา หู จมูก ลิ้น กาย ใจ หรืออินทรีย์ 6 แล้ว 
            ให้ฝึกใช้สติ ดึง ลาก หรือระลึกเอาความจริงของโลกและชีวิตว่า สิ่งทั้งปวงไม่เที่ยงเกิดดับ เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราว ซึ่งสรุปเหลือคำเดียวว่า &quot;ไม่เที่ยง เกิดดับ&quot; 
            มากั้นขณะกระทบสัมผัสไว้ก่อนทุกครั้งเมื่อถูกกระทบสัมผัส (ตรงผัสสะ) ความจริงเหมือนหน้าปัญญาเหมือนหลัง ลากเอาหน้ามาแล้วหลังก็ตามมา 
            เมื่อความจริงมาแล้วปัญญาจะตามมาทันทีพิจารณาสิ่งที่มากระทบสัมผัสตัวของเรา ปัญญาก็จะพิจารณาว่า ตัวของเราไม่เที่ยงเกิดดับ สิ่งที่มากระทบก็ไม่เที่ยงเกิดดับ 
            เช่น ตาเห็นรูป ปัญญาก็จะพิจารณาว่า รูปไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ หู กระทบเสียง พิจารณาเสียงไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ 
            จมูกกระทบกลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ ลิ้นกระทบรส รสไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ กายกระทบเย็นร้อนฯ สิ่งที่มากระทบไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ 
            ไปจนถึงใจคิดนึก ความคิดไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ</p><br /><hr /><br /><br />
            <p>ให้พิจารณาอย่านี้ตลอดเวลาเมื่อถูกกระทบสัมผัสจนเป็นปกตินิสัยในชีวิตประจำวัน 
            และปัญญาจะเกิดขึ้นทางอินทรีย์ 6 นี้ อย่างมหาศาล ปัญญา หรือ ความจริงนี้ก็จะดับความพอใจ ไม่พอใจ หรือความหลง หรืออวิชชาทันที ต่อไปจิตใจของเราก็จะเก็บเอาความจริงหรือปัญญาไว้ใจใจแทนอวิชชา 
            เมื่อมีอะไรมากระทบสัมผัสอินทรีย์ 6 หรือตัวของเรา สติก็จะลากเอาหรือระลึกเอา ดึงเอาปัญญาหรือความจริงที่เก็บไว้เป็นสัญญา (ความจำ) ที่อยู่ในใจออกมารับการกระทบสัมผัสทุกครั้ง 
            ทุกข์หรือปัญหาก็จะถูกดับหรือแก้ตรงที่มันเกิดทันที ทุกข์ที่จะเกิดขึ้นต่อไปอีกก็ไม่มี ซึ่งตรงกับคำสอนของพระพุทธเจ้าที่ตรัสไว้ว่า &quot;ทุกข์เกิดที่ไหนดับที่นั่น&quot; 
            นี่คือเอาพระธรรมคำสอนของพระพุทธเจ้าที่เป็นเหตุของการตรัสรู้ของพระองค์ท่านมาปฏิบัติ ปฏิบัติแล้วสัมมาทิฐิเกิดขึ้นทันที หลังจากสติดึงความจริงมาตั้งกั้นความเชื่อตรงผัสสะ หรือตรงที่กระทบ 
            หลังจากนั้นมรรคมีองค์ 8 เกิดขึ้น สติปัฏฐาน 4 สัมมัปปธาน 4 อิทธิบาท 4 อินทรีย์ 5 พละ 5 โพชฌงค์ 7 เกิดขึ้นตามมา เรียกว่าโพธิปักขิยธรรม 37 ประการ ซึ่งเป็นองค์ธรรมที่ดับทุกข์หรือแก้ปัญหาได้ถาวร</p><br /><hr /><br /><br />
            <p>หลังจากนั้นพระองค์ได้นำพระธรรมคำสอนนี้ไปสอนชาวโลกให้ปฏิบัติตาม ชาวโลกมีทั้งเจ้าฟ้ามหากษัตริย์ นักปราชญ์ ราชบัณฑิต คนธรรมดาทั่วไป ได้นำคำสอนของพระพุทธองค์อันนี้ไปปฏิบัติ 
            จึงได้ตรัสรู้เหมือนกับพระองค์ท่านมากมายเรียกว่าพระอรหันต์สาวก ปฏิบัติธรรมถูกธรรม อย่างนี้เรียกว่า ปฏิบัติธรรมโดยความไม่ประมาท ประสบความสำเร็จได้ภายใน 7 วัน 7 เดือน 7 ปี อย่างช้า พระพุทธเจ้าตรัสไว้อย่างนี้</p><br /><hr /><br /><br />
            <p>เพื่อป้องกันความผิดพลาด จึงขอเตือนสติของท่านผู้สนใจในการปฏิบัติธรรมทั้งหลายด้วยว่า ถ้าหากท่านจะทำอะไรในชีวิตของท่าน ท่านต้องศึกษาเรียนรู้สิ่งที่ตัวของท่านจะไปทำก่อนจนเข้าใจดีแล้วค่อยทำ ไม่ว่าทางโลกหรือทางธรรม 
            ถ้าหากท่านปฏิบัติผิดพลาด โดยเฉพาะทางธรรม นั่นหมายถึงท่านเสียเวลาชีวิตของท่านไปชาติหนึ่ง ซึ่งคนเราจะได้เกิดมาเป็นคนพบพระพุทธศาสนานั้นไม่ง่ายเลย ถ้าหากท่านขึ้เกียจเรียนพระธรรมคำสอนของพระพุทธเจ้าแล้ว 
            โอกาสที่ท่านจะปฏิบัติถูกนั้นไม่มีเลย บางท่านก็ใจร้อนอยากประสบความสำเร็จในชีวิตเร็วๆขึ้น จึงได้ไปปฏิบัติกับครูบาอาจารย์ทันที โดยไม่ได้พิจารณาว่าครูบาอาจารย์ของท่านนั้นท่านได้ศึกษาเล่าเรียนพระธรรมคำสอนของพระพุทธเจ้าจนจบพระไตรปิฎกหรือไม่ 
            ถ้าท่านเรียนคำสอนของพระพุทธเจ้าไม่จบท่านก็จะสอนเราผิด การปฏิบัติของเราก็ผิดไปตามครูบาอาจารย์ด้วย</p><br /><hr /><br /><br /> 
            <p>ฉะนั้น ท่านผู้ปฏิบัติธรรมทั้งหลายควรศึกษาพระธรรมคำสอนของพระพุทธเจ้าให้จบพระไตรปิฎกอย่างน้อย 2-3 จบ ไว้เป็นพื้นฐานก่อน 
            จะได้มีข้อมูลทราบว่าครูบาอาจารย์ของท่านสอนเราถูกต้องหรือไม่ ไม่ใช่ว่าจะนำตัวของท่านไปถึงแค่ครูบาอาจารย์ของท่านเท่านั้น อย่างนี้เรียกว่าท่านประมาทมาก ท่านต้องพาตัวของท่านขึ้นเลยไปถึงพระพุทธเจ้าด้วยจึงจะถูกต้อง 
            แล้วเอาคำสอนของครูบาอาจารย์ของเรามาเทียบเคียงกับคำสอนของพระพุทธเจ้าว่าเข้ากันได้หรือไม่ ถูกเหตุ ถูกผล หรือไม่ อย่างนี้เรียกว่าปฏิบัติธรรมถูกธรรม เป็นผู้ไม่ประมาท เป็นผลดีต่อท่านผู้ปฏิบัติอย่างยิ่ง 
            เพราะปฏิบัติถูกต้องแล้ว จะมีปัญญาแก้ปัญหาหรือดับทุกข์ได้พบสุขถาวรได้ในชาตินี้</p><br /><br />
          </h4>
          <a href="/buddhateaching/life03">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              ปฏิบัติธรรมอย่างไรจึงจะถูกทาง?
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life02;