import React from 'react';

const Life12 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>เราจะให้รางวัลชีวิตของเราได้อย่างไร?</h2>
          </div>
          <h4>
            <p>ทำไมต้องให้รางวัลชีวิตของเราด้วย ก่อนที่จะให้รางวัลชีวิตของเราให้ถูกต้องตามที่ชีวิตของเราต้องการนั้น 
            เราต้องรู้จักตัวของเราก่อนว่าตัวของเรามี 2 ตัว ที่ซ้อนทับกันอยู่</p><br /><hr /><br /><br />
            <p>ตัวที่ 1 ก็คือ ตัวชีวิต หมายถึง ร่างกายของเราทั้งหมด</p><br />
            <p>ส่วนตัวที่สองก็คือ ตัวคน หรือ จิตใจของเรา</p><br /><hr /><br /><br />
            <p>ความต้องการของ 2 ตัวนี้แตกต่างกัน บางอย่างมีขีดจำกัด บางอย่างไม่มีขีดจำกัด 
            ยกตัวอย่างเช่น เวลาดื่มเหล้าดื่มมากเข้าตัวชีวิตหรือว่าร่างกายรับไม่ไหว บางครั้งอาเจียนออกมา แต่ตัวคนหรือตัวจิตใจหรือตัวความอยากนั้นไม่พอต้องการอีก 
            เมื่อสองส่วนนี้ขัดแย้งกันตัวชีวิตก็เดือดร้อนอาเจียนออกมา เดินไม่เป็นทาง ลักษณะของความเป็นคนไม่มีเหลือ มีลักษณะเหมือนสัตว์เดรัจฉาน 
            ทักษะชีวิตกับตัวความอยากรู้ตัวคนไม่สมดุลกันตัวชีวิตจะเดือดร้อนตลอดเวลาเพราะตัวชีวิตมีขีดจำกัดในการรับแต่ตัวคนนี้ไม่มีขีดจำกัดดังพระพุทธเจ้าตรัสไว้ว่า
            แม่น้ำเสมอความอยากไม่มีเมื่อ 2 ตัวขัดแย้งกันวิธีความเป็นอยู่ของบุคคลนั้นๆก็จะมีแต่ปัญหาเครียดเกิดความทุกข์ตลอดเวลาร่างกายหรือตัวชีวิตรับไม่ได้แล้วเกิดอาการเจ็บป่วยขึ้น 90% 
            อาการป่วยของคนเราเกิดจาก 2 ตัวนี้ขัดแย้งกัน ทำให้ร่างกายอ่อนแอ เชื้อโรคภายนอกเข้าทำลายได้ง่าย นอกจากเจ็บป่วยในตัวชีวิตแล้ว ตัวคนก็ป่วยอีกจิตใจก็ป่วยด้วย 
            เพราะสะสมปัญหาขึ้นทุกวันด้วยความอยากหรือปัญหาหาที่สุดไม่ได้ แก้ปัญหาที่ตัวเองสร้างขึ้นไม่ได้ก็ตัดสินใจฆ่าตัวตาย นี่คือความขัดแย้งของร่างกายและจิตใจ 
            หรือตัวชีวิตและตัวคน</p><br /><hr /><br /><br />
            <p> ตลอดเวลาที่เราเกิดมาเป็นคนทำร้ายชีวิตตัวเองมาตลอดทำร้ายตัวเอง โดยปล่อยให้ภัยร้ายเข้ามาทางตา หู จมูก ลิ้น กาย ใจ
            หรืออินทรีย์ 6 ตลอดเวลา เมื่ออินทรีย์ 6 กระทบสิ่งภายนอกก็มาปรุงแต่งทำให้เกิดความพอใจไม่พอใจ อันไหนพอใจก็เสาะแสวงหา อันไหนไม่พอใจก็ผลักหนี 
            ชีวิตของปุถุชนคนธรรมดาก็ปฏิบัติอย่างนี้มาตลอดชีวิตของเขา ในที่สุดปัญหาความพอใจและไม่พอใจที่สะสมไว้ไม่รู้ตัวเพิ่มมากขึ้นก็ผลักดันตัวเองทำในสิ่งที่ตนเองต้องการนั้นโดยไม่ได้คิดพิจารณาให้ถี่ถ้วน 
            ทำให้เกิดปัญหาซับซ้อนมากขึ้นโดยไม่รู้ตัว นี่คือตัวความอยากหรือตัวคนสร้างปัญหาให้กับตัวชีวิต ตัวคนสร้างปัญหาเหล่านี้ให้กับตัวชีวิตทุกวันไม่มีเว้น ตัวชีวิตมีขีดความสามารถรับปัญหาเหล่านี้ได้จำกัดไม่เหมือนตัวคน 
            ตัวชีวิตก็เสื่อมโทรม ขี้โรค เพราะเกิดจากความเครียด แก้ปัญหาที่สะสมมาไม่ได้ ทำให้ความสมดุลของร่างกายเสียสมดุลไป ทำให้เกิดโรคภัยไข้เจ็บตามมา</p><br /><hr /><br /><br />
            <p> 
            บางครั้งร่างกายหรือชีวิตทนไม่ไหวก็ล้มป่วยลงถึงพิกลพิการไปหรือไม่ก็ฆ่าตัวตายซึ่งมีมากมายให้เห็นทุกวันในขณะนี้ตลอดเวลา ตัวคนก็พยายามแก้ไขไปหายามากิน ไปหาหมอมารักษา 
            หายจากโรคหนึ่งไปเป็นอีกโรคหนึ่ง ชีวิตเราเป็นอย่างนี้ตลอดเวลา เพราะต้นเหตุของการเกิดโรคทางกายหรือทางชีวิตนั้นมาจากตัวคนหรือจิตใจ เมื่อจิตใจแสวงหาสิ่งที่ตัวเองต้องการไม่มีที่สิ้นสุดอย่างนี้ 
            โรคทางกายหรือทางตัวชีวิตก็ไม่มีที่สิ้นสุดเช่นกัน ตัวชีวิตของเราก็ถูกทรมานอยู่ตลอดเวลา</p><br /><hr /><br /><br />
            <p> 
            ตัวชีวิตของเราก็ต้องการพักผ่อนหรือผ่อนคลายเช่นกัน ตลอดเวลาตั้งแต่เราเกิดมาเราไม่เคยหันไปมองดูตัวชีวิตเราของเราเลย มองบ้างในบางครั้งแต่ผิวเผินและไม่เข้าใจความสัมพันธ์ระหว่างตัวชีวิตกับตัวคน
            ว่าเกี่ยวเนื่องกันอย่างไร ต่อไปคนเราต้องหันมามองดูตัวชีวิตของเราให้มากขึ้นกว่าที่เป็นอยู่ทุกวันนี้ เราตามใจตัวคนเกินไปจนลืมตัวชีวิต ปล่อยให้เขาอยู่แบบทรมานมานานแล้ว และเราก็ไม่ควรทรมานตัวชีวิตอีกต่อไป 
            ขอให้ท่านหันกลับมามองดูชีวิตตัวเองบ้าง เราไม่เคยให้อะไรกับตัวชีวิตของเราเลย ให้แต่ตัวคนตลอดเวลา ตัวคนรือตัวจิตใจจึงได้รับการทะนุถนอมมาตลอดเวลา ปล่อยให้ตัวชีวิตอ้างว้างว้าเหว่มานานแสนนาน 
            ถ้าตราบใดยังเดินไปไหนมาไหนได้จะไม่หันมามองดูตัวชีวิตเลย แต่วันไหนเดินไปไหนมาไหนไม่ได้นอนซมอยู่โรงพยาบาลนั่นแหละ ตัวชีวิตจึงจะได้รับการพักผ่อนเยียวยารักษาให้หายจากอาการบาดเจ็บ 
            การบาดเจ็บของชีวิตทุกครั้งเกิดจากตัวคนหรือตัวความอยากนำมาให้เกือบทั้งหมด พวกเราเอารัดเอาเปรียบทรมานตัวชีวิตของเรามานานเหลือเกินแต่เขาก็ไม่เคยทำร้ายจิตใจหรือตัวคนเลย 
            ให้ตัวคนอาศัยร่างกายนี้ คิดกระทำตามที่ตัวคนต้องการ บางครั้งชีวิตรับไม่ได้ก็ต้องทนเอา ทนไม่ได้ก็ฟุบคาที่ พอหายแล้ว ตัวคนก็ใช้ตัวชีวิตทำร้ายตัวเองอีกเป็นอย่างนี้ตลอดเวลาหรือตลอดชีวิตของเรา 
            เราบังคับเคี่ยวเข็ญตัวชีวิตของเราตลอดเวลา ต่อไปเราควรหยุดคิด หยุดทรมานเขาบ้าง แค่นี้ยังไม่พอบางครั้งพาเขาไปทรมานในคุกอีกหลายปี</p><br /><hr /><br /><br />
            <p> ตัวชีวิตควรได้รับรางวัลสูงสุดจากตัวคนบ้าง 
            รางวัลที่ชีวิตของเราต้องการคืออะไรคือการลดโลภ โกรธ หลง ของตัวคนให้มากที่สุดเท่าที่จะทำได้ นี่คือสิ่งที่ตัวชีวิตหรือร่างกายของเราต้องการ เมื่อโลภโกรธ หลง ลดลงไปแล้ว ตัวปัญญาก็จะเกิดขึ้นในตัวคน 
            เมื่อมีปัญญาเพิ่มขึ้นก็จะแก้ไขปัญหาให้กับตัวคนได้มาก สิ่งที่ตกค้างในตัวคนก็มีน้อย เมื่อมีน้อยก็ไม่กระทบกระเทือนตัวชีวิต ตัวชีวิตก็จะได้พักผ่อนบ้างมิฉะนั้นก็จะไปตามแรงผลักดันจากความโลภ โกรธ หลง เมื่อไม่มีแรงผลักดันจากโลภ โกรธ หลง 
            ตัวชีวิตก็จะผ่อนคลายสบายขึ้น โรคภัยไข้เจ็บที่เกิดขึ้นบนตัวชีวิตก็ลดลงไปด้วย เพราะไม่เครียดกับปัญหาต่างๆภูมิต้านทานของร่างกายก็มีมากขึ้น เอาชนะโรคภัยไข้เจ็บได้</p><br /><hr /><br /><br />
            <p> ถ้าเราจะให้รางวัลแก่ชีวิตของเรา 
            เราจะต้องปฏิบัติตัวของเราให้ความโลภ โกรธ หลง ลดลงไป วิธีปฏิบัตินั้น พระพุทธเจ้าได้ตรัสไว้เป็นเวลา 2500 กว่าปีมาแล้ว ให้ชาวพุทธเราไปปฏิบัติเพื่อดับความโลภ โกรธ หลง หลักปฏิบัติก็คือหลักสติปัฏฐาน 4 
            คือการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ให้รู้เห็นสิ่งทั้งปวงตามความเป็นจริง ถ้าคนเราปฏิบัติตามหลักทางสายเอกนี้แล้วโลภ โกรธ หลงก็เบาบางและหมดไปในที่สุดนี่คือสิ่งที่ตัวชีวิตต้องการมากที่สุด 
            ตัวคนควรจะปฏิบัติเอาหลักการอันนี้มามอบให้ตัวชีวิต เพื่อเป็นรางวัลอันสูงค่า เพื่อตอบแทนบุญคุณแก่ตัวชีวิตที่ต้องบอบช้ำทนทุกข์ทรมาน รองรับความโลภ โกรธ หลง ของตัวคนมาตลอด เมื่อทุกคนเข้าถึงความจริงของโลกและชีวิตแล้ว 
            ตัวร่างกายหรือตัวชีวิตก็จะได้พักและผ่อนคลายตลอดไป ต่างคนต่างเกื้อกูลซึ่งกันและกันพากันไปถึงที่สุดของทุกข์ คือสุขถาวรที่ตัวคนและตัวชีวิตต้องการ นี่คือรางวัลที่ตัวชีวิตและตัวคนต้องการ 
            แต่การจะมอบความสุขถาวรให้เป็นรางวัลแก่ชีวิตนั้นต้องเข้าใจหลักการปฏิบัติให้เข้าถึงปัญญาและการดับทุกข์นั้นด้วยเพราะถ้าเข้าใจผิดจะเป็นการมอบความเลวร้ายให้กับชีวิตเป็นอย่างยิ่งการเข้าถึงปัญญาและการดับทุกข์นั้น
            ต้องเริ่มต้นด้วยการฝึกฝนตนเองในด้านวิปัสสนาภาวนาล้วนๆ โดยไม่ต้องไปทำสมาธิก่อน อย่างที่มีการสอนกันในปัจจุบันนี้ซึ่งเป็นการกระทำที่ไม่ตรงกับผลที่ต้องการ ถ้าทำสมาธิแล้วผลจะออกมาเป็นความสงบอย่างเดียว 
            ไม่มีปัญญาดับทุกข์ได้นั้นเป็นการผลักตนเอง จากการทำร้ายตัวเองอย่างหยาบไปสู่การทำร้ายตัวเองอย่างละเอียด โดยไม่รู้ตัว ซึ่งไม่สามารถแก้ไขตนเองกลับมาให้มีปัญญาดับทุกข์ได้เลยในชาตินี้ 
            การกระทำอย่างนี้ถือเป็นการมอบความเลวร้ายอย่างละเอียดให้กับตนเอง ซึ่งชีวิตไม่ได้ต้องการรางวัลอย่างนี้ ตัวคนและชีวิตต้องการดับทุกข์ ไม่ใช่การหลบทุกข์ชั่วคราวหรือความสงบซึ่งยังอยู่ในวังวนของการเวียนว่ายตายเกิดนับชาติไม่ถ้วน 
            ทุกคนมีโอกาสให้รางวัลชีวิตตลอดเวลาถ้าไม่ประมาท</p><br /><hr /><br /><br />
            <p> ว่างๆก็ลองส่องกระจกดูหน้าตัวเองบ้างแล้วถามตัวเองว่ารูปร่างหน้าตาอย่างนี้เราใช้เขามากี่ปีแล้ว ใช้อย่างสมบุกสมบันมาตลอดบางครั้งบอบช้ำเจ็บปวดจนทนไม่ได้
            ต้องเข้าไปพักรักษาตัวเองในโรงพยาบาล เมื่อหายดีแล้วก็ใช้เขาอีกอย่างเดิม บางครั้งหนักกว่าเดิมเสียอีก เมื่อไหร่ท่านจะให้รางวัลแก่เขาบ้าง ถามอย่างนี้ทุกวัน เมื่อท่านเห็นหน้าตาของท่านในกระจกแล้ว 
            ท่านก็จะเห็นบุญคุณของชีวิตอย่างมากมาย ซึ่งตลอดเวลาเขาเป็นที่รองรับอารมณ์ความโลภ ความโกรธ ความหลง เคียดแค้นชิงชัง ทำร้ายเขาทั้งทางตรงและทางอ้อม บางครั้งก็พาเขาเข้าไปนอนทุกข์ทรมานอยู่ในคุกตารางหลายปีหรือตลอดชีวิต
            เขาทนได้ทนมาตลอดให้เราเห็นหน้าอยู่ขณะนี้ ไม่มีอะไรทนได้ทุกอย่างเหมือนตัวชีวิตของเรา ฉะนั้นตัวชีวิตคือคู่ชีวิตของเราที่แท้จริง ตัวชีวิตของเรานี่แหละอยู่กับเรานานที่สุด สิ่งอื่นๆไม่ว่าอะไรทั้งนั้นแม้กระทั่งลูก เมีย พ่อแม่ ก็อยู่กับเราไม่ได้นาน 
            เท่ากับตัวของเราเลย เมื่อเรารู้ว่าตัวชีวิตของเราคือเพื่อนตายที่แท้จริง ตายเมื่อใดตัวชีวิตกับตัวคนก็จากกัน ถ้าไม่ตายก็อยู่ด้วยกันอย่างนี้แม้แต่จะระทมขมขื่นก็ไม่หนีไปจากกันง่ายๆ อย่างคนบางคนไม่พอใจเรา เราไม่มีอะไรจะให้ 
            ก็หนีไปจากเราแล้ว ตอนนี้เราต้องหันมาดูแลเพื่อนแท้เพื่อนตายของเราบ้าง อย่าให้เจ็บปวดบอบช้ำจากความโลภ โกรธ หลง อีก หมั่นฝึกฝนตัวคนให้อยู่อาศัยกับตัวชีวิตให้เกื้อกูลซึ่งกันและกันเลิกการเบียดเบียนทำลายล้างกันทั้งทางตรงและทางอ้อม 
            เมื่อท่านให้รางวัลกับชีวิตด้วยหลักการของการวิปัสสนาตามทางสายเอกของพระพุทธเจ้าแล้ว นั่นแหละยอดปรารถนาของชีวิตทุกคนชีวิตต้องการอย่างนี้ท่านอย่าเสียเวลาเลยให้รางวัลแก่ชีวิตท่านตั้งแต่บัดนี้เป็นต้นไป ชีวิตของท่านจะไร้ทุกข์พบแต่สุขถาวร</p><br /><br />
          </h4>
          <a href="/life13">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              วิปัสสนาภาวนา มีปัญญา รู้จริง รู้แจ้ง อริยสัจ 4 ได้อย่างไร?
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life12;