import React from 'react';

const Lesson0311 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ราหุลสูตร</h2>
          </div>
            <h4>
            ว่าด้วยสิ่งใดไม่เที่ยงสิ่งนั้นก็เป็นทุกข์<br />
            สมัยหนึ่งพระผู้มีพระภาค ประทับอยู่ ณ พระวิหารเชตวัน<br />
            อารามของท่านอนาถบิณฑิกเศรษฐี<br />
            ใกล้พระนครสาวัตถี<br />
            ครั้งนั้นพระผู้มีพระภาค ทรงหลีกเร้นอยู่ในที่สงัด<br />
            ทรงเกิดปริวิตก แห่งพระหฤทัยอย่างนี้ว่า<br />
            ธรรมที่เป็นเครื่องบ่มวิมุติ ของราหุลแก่กล้าแล้ว<br />
            ถ้ากระไรเราควรแนะนำราหุล ในธรรมเป็นที่สิ้นไป แห่งอาสวะยิ่งขึ้นไปเถิด<br />
            ครั้นทรงพระดำริฉะนี้แล้ว<br />
            ในเวลาเช้าพระผู้มีพระภาค<br />
            ทรงครองอันตรวาสก ทรงถือบาตรและจีวร เสด็จเข้าไปบิณฑบาต<br />
            ยังพระนครสาวัตถี<br />
            ครั้นเวลาภายหลัง<br />
            เสด็จกลับจากบิณฑบาตแล้ว<br />
            ตรัสเรียกท่านพระราหุลมาตรัสว่า<br />
            ราหุลเธอจงถือผ้านิสีทนะ ไปสู่ป่าอันธวันด้วยกัน<br />
            เพื่อพักผ่อนในเวลากลางวัน<br /><br />
            ท่านพระราหุลทูลรับพระดำรัส พระผู้มีพระภาค<br />
            แล้วได้ถือผ้านิสีทนะ ตามเสด็จพระผู้มีพระภาคไปข้างหลัง<br />
            ก็สมัยนั้นพวกเทวดาหลายพัน ติดตามพระผู้มีพระภาคไปด้วยกัน<br />
            คิดว่าวันนี้พระผู้มีพระภาค จักทรงแนะนำท่านพระราหุล<br />
            ในธรรมเป็นที่สิ้นอาสวะยิ่งขึ้นไป<br />
            ครั้งนั้นพระผู้มีพระภาค เสด็จเข้าไปสู่ป่าอันธวัน<br />
            ประทับ ณ พุทธอาสน์ ที่พระราหุลปูลาดถวาย ที่ควงตันไม้แห่งหนึ่ง<br />
            ฝ่ายท่านพระราหุล ถวายอภิวาทพระผู้มีพระภาคแล้ว<br />
            นั่ง ณ ที่ควรส่วนข้างหนึ่ง<br /><br />
            1. พระพุทธเจ้า ทรงตรัสถามพระราหุลว่า<br />
            จักษุเที่ยงหรือไม่เที่ยง<br />
            พระราหุลตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            2. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า<br />
            พระราหุลตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            3. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระราหุลตอบว่า<br />
            ไม่ควรเห็นอย่างนั้นพระเจ้าข้า<br /><br />
            4. พระพุทธเจ้า ทรงตรัสถามพระราหุลว่า<br />
            รูปเที่ยงหรือไม่เที่ยง<br />
            พระราหุลตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            5. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า<br />
            พระราหุลตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            6. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระราหุลตอบว่า<br />
            ไม่ควรเห็นอย่างนั้นพระเจ้าข้า<br /><br />
            7. พระพุทธเจ้า ทรงตรัสถามพระราหุลว่า<br />
            จักษุวิญญาณ จักษุสัมผัส<br />
            เวทนา สัญญา สังขาร วิญญาณ<br />
            ที่เกิดขึ้นเพราะจักษุสัมผัส เป็นปัจจัยเที่ยงหรือไม่เที่ยง<br />
            พระราหุลตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            8. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง<br />
            สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า<br />
            พระราหุลตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            9. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระราหุลตอบว่า<br />
            ไม่ควรเห็นอย่างนั้นพระเจ้าข้า<br /><br />
            10. พระพุทธเจ้า ทรงตรัสถามพระราหุลว่า<br />
            ใจเที่ยงหรือไม่เที่ยง<br />
            พระราหุลตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            11. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า<br />
            พระราหุลตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            12. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระราหุลตอบว่า<br />
            ไม่ควรเห็นอย่างนั้นพระเจ้าข้า<br /><br />
            13. พระพุทธเจ้า ทรงตรัสถามพระราหุลว่า<br />
            ธรรมารมณ์เที่ยงหรือไม่เที่ยง<br />
            พระราหุลตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            14. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า<br />
            พระราหุลตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            15. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระราหุลตอบว่า<br />
            ไม่ควรเห็นอย่างนั้นพระเจ้าข้า<br /><br />
            16. พระพุทธเจ้า ทรงตรัสถามพระราหุลว่า<br />
            มโนวิญญาณเที่ยงหรือไม่เที่ยง<br />
            พระราหุลตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            17. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า<br />
            พระราหุลตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            18. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระราหุลตอบว่า<br />
            ไม่ควรเห็นอย่างนั้นพระเจ้าข้า<br /><br />
            19. พระพุทธเจ้า ทรงตรัสถามพระราหุลว่า<br />
            มโนสัมผัสเที่ยงหรือไม่เที่ยง<br />
            พระราหุลตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            20. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า<br />
            พระราหุลตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            21. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระราหุลตอบว่า<br />
            ไม่ควรเห็นอย่างนั้นพระเจ้าข้า<br /><br />
            22. พระพุทธเจ้า ทรงตรัสถามพระราหุลว่า<br />
            เวทนา สัญญา สังขาร วิญญาณ<br />
            ที่เกิดขึ้นเพราะมโนสัมผัส<br />
            เป็นปัจจัยเที่ยงหรือไม่เที่ยง<br />
            พระราหุลตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            23. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า<br />
            พระราหุลตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            24. พระพุทธเจ้า ทรงตรัสถามพระราหุลต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวนเป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระราหุลตอบว่า<br />
            ไม่ควรเห็นอย่างนั้นพระเจ้าข้า<br /><br /><br />
            อริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้<br />
            ย่อมเบื่อหน่ายทั้งในจักษุ<br />
            ทั้งในรูป<br />
            ทั้งในจักษุวิญญาณ<br />
            ทั้งในจักษุสัมผัส<br />
            ทั้งในเวทนา สัญญา สังขาร วิญญาณ<br />
            ที่เกิดขึ้นเพราะจักษุสัมผัสเป็นปัจจัย<br />
            ย่อมเบื่อหน่ายทั้งในใจ<br />
            ทั้งในธรรมารมณ์<br />
            ทั้งในมโนวิญญาณ<br />
            ทั้งในมโนสัมผัส<br />
            ทั้งในเวทนา สัญญา สังขาร วิญญาณ<br />
            ที่เกิดขึ้นเพราะมโนสัมผัสเป็นปัจจัย<br />
            เมื่อเบื่อหน่ายย่อมคลายกำหนัด<br />
            เพราะคลายกำหนัดจิตย่อมหลุดพ้น<br />
            เมื่อจิตหลุดพ้นแล้ว<br />
            ย่อมมีญาณหยั่งรู้ว่าหลุดพ้นแล้ว<br />
            รู้ชัดว่าชาติสิ้นแล้ว<br />
            พรหมจรรย์อยู่จบแล้ว<br />
            กิจที่ควรทำ ทำเสร็จแล้ว<br />
            กิจอื่นเพื่อความเป็นอย่างนี้มิได้มี<br />
            พระผู้มีพระภาคเจ้า<br />
            ตรัสพระสูตรนี้จบลงแล้ว<br />
            ท่านพระราหุลชื่นชมยินดี พระภาษิตของพระผู้มีพระภาคเจ้า<br />
            อนึ่งเมื่อพระผู้มีพระภาคเจ้า ตรัสไวยากรณ์ภาษิตนี้อยู่<br />
            จิตของท่านพระราหุลหลุดพ้นแล้ว<br />
            จากอาสวะไม่ถือมั่นด้วยอุปาทาน<br />
            ฝ่ายเทวดาหลานพัน ก็เกิดธรรมจักษุ<br />
            อันปราศจากธุลีปราศจากมลทิน<br />
            ว่าสิ่งใดสิ่งหนึ่ง มีความเกิดขึ้นเป็นธรรมดา<br />
            สิ่งนั้นทั้งมวลล้วนมีความดับไปเป็นธรรมดา<br /><br /><hr /><br />
            </h4>
            <a href="/third/lesson0312">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ว่าด้วยควรเป็นผู้มีสติสัมปชัญญะ
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0311;