import React from 'react';

const Lesson0312 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ว่าด้วยควรเป็นผู้มีสติสัมปชัญญะ</h2>
          </div>
            <h4>
            พระพุทธเจ้าตรัสไว้ ว่าย่อมเป็นผู้มีสติอย่างไร<br />
            ย่อมเป็นผู้มีปกติ<br />
            เห็นกายในกายอยู่<br />
            มีความเพียรมีสัมปชัญญะมีสติ<br />
            กำจัดอภิชฌา และโทมนัสในโลกเสีย<br />
            ย่อมเป็นผู้มีปกติ เห็นเวทนาในเวทนาอยู่<br />
            มีความเพียรมีสัมปชัญญะมีสติ<br />
            กำจัดอภิชฌา และโทมนัสในโลกเสีย<br />
            ย่อมเป็นผู้มีปกติ เห็นจิตในจิตอยู่<br />
            มีความเพียร มีสัมปชัญญะมีสติ<br />
            กำจัดอภิชฌา และโทมนัสในโลกเสีย<br />
            ย่อมเป็นผู้มีปกติเห็นธรรมในธรรม<br />
            มีความเพียรมีสัมปชัญญะมีสติ<br />
            กำจัดอภิชฌา และโทมนัสในโลกเสีย<br />
            ย่อมเป็นผู้มีสติอย่างนี้แล<br /><br />
            ย่อมเป็นผู้มีสัมปชัญญะอย่างไร<br />
            ย่อมเป็นผู้มีปกติทำความรู้สึกตัว<br />
            ในก้าวไปในการถอยกลับ<br />
            ย่อมเป็นผู้มีปกติทำความรู้สึกตัว ในการแลในการเหลียว<br />
            ย่อมเป็นผู้มีปกติทำความรู้สึกตัว ในการคู้เข้าเหยียดออก<br />
            ย่อมเป็นผู้มีปกติทำความรู้สึกตัว ทรงผ้าสังฆาฏิบาตรและจีวร<br />
            ย่อมเป็นผู้มีปกติทำความรู้สึกตัว ในการกิน ดื่ม เคี้ยว ลิ้ม<br />
            ย่อมเป็นผู้มีปกติทำความรู้สึกตัว ในการถ่ายอุจจาระปัสสาวะ<br />
            ย่อมเป็นผู้มีปกติทำความรู้สึกตัว ในการเดินในการ ยืน นั่ง หลับ ตื่น พูด นิ่ง<br />
            ย่อมเป็นผู้มีสติสัมปชัญญะอย่างนี้แล<br /><br />
            ถ้าเมื่อนั้นมีสติสัมปชัญญะ เป็นผู้ไม่ประมาท<br />
            มีความเพียรมีใจเด็ดเดี่ยว อยู่อย่างนี้<br />
            สุขเวทนาย่อมบังเกิดขึ้น<br />
            เธอย่อมรู้ชัดอย่างนี้ ว่าสุขเวทนานี้ บังเกิดขึ้นแล้วแก่เราแล<br />
            ก็แต่ว่าสุขเวทนานั้น อาศัยจึงเกิดขึ้น<br />
            ไม่อาศัยไม่เกิดขึ้น<br />
            อาศัยอะไรอาศัยกายนี้เอง<br />
            ก็กายนี้แลไม่เที่ยง<br />
            อันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น<br />
            ก็สุขเวทนาอันอาศัยกายอันไม่เที่ยง<br />
            ปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น<br />
            แล้วจึงบังเกิดขึ้นจะเที่ยงแต่ที่ไหน<br />
            ดังนี้เธอย่อมพิจารณา เห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป<br />
            ความดับความสละคืน ในกายและในสุขเวทนาอยู่<br />
            เมื่อเธอพิจารณา เห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป<br />
            ความดับความสละคืน ในกายและในสุขเวทนาอยู่<br />
            ย่อมละราคานุสัยในกาย และในสุขเวทนาเสียได้<br /><br />
            ถ้าเมื่อนั้นมีสติสัมปชัญญะ เป็นผู้ไม่ประมาท<br />
            มีความเพียร มีใจเด็ดเดี่ยวอยู่อย่างนี้<br />
            ทุกขเวทนาย่อมบังเกิดขึ้น<br />
            เธอย่อมรู้ชัดอย่างนี้ว่า ทุกขเวทนานี้ บังเกิดขึ้นแล้วแก่เราแล<br />
            ก็แต่ว่าทุกขเวทนานั้น อาศัยจึงเกิดขึ้น<br />
            ไม่อาศัยไม่เกิดขึ้น<br />
            อาศัยอะไรอาศัยกายนี้เอง<br />
            ก็กายนี้แลไม่เที่ยง<br />
            อันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น<br />
            ก็ทุกขเวทนา อันอาศัยกายอันไม่เที่ยง<br />
            ปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น<br />
            แล้วจึงบังเกิดขึ้นจะเที่ยงแต่ที่ไหน<br />
            ดังนี้เธอย่อมพิจารณา เห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป<br />
            ความดับความสละคืนในกาย และในทุกขเวทนาอยู่<br />
            เมื่อเธอพิจารณา เห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป<br />
            ความดับความสละคืนในกาย และในทุกขเวทนาอยู่<br />
            ย่อมละปฏิฆานุสัยในกาย และในทุกขเวทนาเสียได้<br /><br />
            ถ้าเมื่อนั้นมีสติสัมปชัญญะเป็นผู้ไม่ประมาท<br />
            มีความเพียรมีใจเด็ดเดี่ยวอยู่อย่างนี้<br />
            ไม่ทุกข์ไม่สุขเวทนา ย่อมบังเกิดขึ้น<br />
            เธอย่อมรู้ชัดอย่างนี้ว่า ไม่ทุกข์ไม่สุขเวทนานี้ บังเกิดขึ้นแล้วแก่เราแล<br />
            ก็แต่ว่าไม่ทุกข์ไม่สุขเวทนา<br />
            นั้นอาศัยจึงเกิดขึ้น<br />
            ไม่อาศัยไม่เกิดขึ้น<br />
            อาศัยอะไรอาศัยกายนี้เอง<br />
            ก็กลายนี้แหละไม่เที่ยง<br />
            อันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น<br />
            อาศัยอะไรอาศัยกายนี้เอง<br />
            ก็กายนี้แลไม่เที่ยง<br />
            อันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น<br />
            ก็ไม่ทุกข์ไม่สุขเวทนา อาศัยกายอันไม่เที่ยง<br />
            ปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น<br />
            แล้วจึงบังเกิดขึ้นจักเที่ยงแต่ที่ไหน<br />
            ดังนี้เธอย่อมพิจารณา เห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป<br />
            ความดับความสละคืน ในกายและในไม่ทุกข์ไม่สุขเวทนาอยู่<br />
            เมื่อเธอพิจารณาเห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป<br />
            ความดับความสละคืน ในกายและในไม่ทุกข์ไม่สุขเวทนาอยู่<br />
            ความดับ ความสละคืนในกาย และในไม่ทุกข์ไม่สุขเวทนาอยู่<br />
            ย่อมละอวิชชานุสัยในกาย และในไม่ทุกข์ไม่สุขเวทนาเสียได้<br /><br />
            ถ้าเมื่อนั้นเสวยสุขเวทนา ก็รู้ชัดว่า สุขเวทนาไม่เที่ยง<br />
            ไม่น่าหมกมุ่น ไม่น่าเพลิดเพลิน<br />
            ถ้าเสวยทุกขเวทนาก็รู้ชัดว่า<br />
            ทุกขเวทนาไม่เที่ยง ไม่น่าหมกมุ่น ไม่น่าเพลิดเพลิน<br />
            ถ้าเสวยไม่ทุกข์ไม่สุขเวทนา ก็รู้ชัดว่า ไม่ทุกข์ไม่สุขเวทนา ไม่เที่ยงไม่น่าหมกมุ่น ไม่น่าเพลิดเพลิน<br /><br />
            ถ้าเธอเสวยสุขเวทนา ย่อมเป็นผู้ปราศจากกิเลส เสวยสุขเวทนานั้น<br />
            ถ้าเธอเสวยทุกขเวทนา ย่อมเป็นผู้ปราศจากกิเลส เสวยทุกขเวทนานั้น<br />
            ถ้าเธอเสวยไม่ทุกข์ไม่สุขเวทนา ย่อมเป็นผู้ปราศจากกิเลส เสวยไม่ทุกข์ไม่สุขเวทนานั้น<br />
            เมื่อเสวยเวทนามีกายเป็นที่สุด<br />
            ก็รู้ชัดว่า เราเสวยเวทนามีกายเป็นที่สุด<br />
            เมื่อเสวยเวทนามีชีวิตเป็นที่สุด<br />
            ก็รู้ชัดว่า เราเสวยเวทนามีชีวิตเป็นที่สุด<br />
            ย่อมรู้ชัดว่าเมื่อตายไป<br />
            เวทนาทั้งปวงอัน ไม่น่าเพลิดเพลิน<br />
            จักเป็นความเย็นในโลกนี้ทีเดียว<br /><br />
            เปรียบเหมือนประทีปน้ำมัน<br />
            อาศัยน้ำมัน และไส้จึงลูกโพลงอยู่ได้<br />
            เพราะสิ้นน้ำมันและไส้ประทีปนั้น<br />
            ไม่มีเชื้อพึงดับไป<br />
            ฉันใดก็ฉันนั้นเหมือนกัน<br />
            เมื่อเสวยเวทนามีกายเป็นที่สุด<br />
            ย่อมรู้ชัดว่า เราเสวยเวทนามีกายเป็นที่สุด<br />
            เมื่อเสวยเวทนามีชีวิตเป็นที่สุด<br />
            ย่อมรู้ชัดว่า เราเสวยเวทนามีชีวิตเป็นที่สุด<br />
            ย่อมรู้ชัดว่าเมื่อตายไป<br />
            เวทนาทั้งปวง อันไม่น่าเพลิดเพลิน จักเป็นความเย็นในโลกนี้ทีเดียว<br /><br /><hr /><br />
            </h4>
            <a href="/third/lesson0313">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ว่าด้วยเวทนา 3
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0312;