import React from 'react';

const Lesson0314 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ว่าด้วยการกระทำที่สุดทุกข์</h2>
          </div>
            <h4>
            ว่าด้วยการกระทำที่สุดทุกข์<br />
            พระพุทธเจ้าตรัสกะท่านพระราหุลว่า<br /><br />
            ปฐวีธาตุที่เป็นภายในก็ดี เป็นภายนอกก็ดี<br />
            ปฐวีธาตุนั้นก็เป็น แต่สักว่าปฐวีธาตุเท่านั้น<br />
            พึงเห็นปฐวีธาตุนั้นด้วยปัญญาอันชอบ<br />
            ตามความเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา นั่นไม่เป็นเรา นั่นไม่ใช่ตัวตนของเรา<br />
            เพราะเห็นด้วยปัญญา อันชอบตามความเป็นจริงอย่างนั้น<br />
            จิตย่อมเบื่อหน่ายในปฐวีธาตุ<br />
            ย่อมคลายกำหนัดในปฐวีธาตุ<br /><br />
            อาโปธาตุที่เป็นภายในก็ดี เป็นภายนอกก็ดี<br />
            อาโปธาตุนั้นก็เป็น แต่สักว่าอาโปธาตุเท่านั้น<br />
            พึงเห็นอาโปธาตุนั้นด้วยปัญญาอันชอบ<br />
            ตามความเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา นั่นไม่เป็นเรา นั่นไม่ใช่ตัวตนของเรา<br />
            เพราะเห็นด้วยปัญญา อันชอบตามความเป็นจริงอย่างนั้น<br />
            จิตย่อมเบื่อหน่ายในอาโปธาตุ<br />
            ย่อมคลายกำหนัดในอาโปธาตุ<br /><br />
            เตโชธาตุที่เป็นภายในก็ดี เป็นภายนอกก็ดี<br />
            เตโชธาตุนั้นก็เป็น แต่สักว่าเตโชธาตุเท่านั้น<br />
            พึงเห็นเตโชธาตุนั้นด้วยปัญญาอันชอบ<br />
            ตามความเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา นั่นไม่เป็นเรา นั่นไม่ใช่ตัวตนของเรา<br />
            เพราะเห็นด้วยปัญญา อันชอบตามความเป็นจริงอย่างนั้น<br />
            จิตย่อมเบื่อหน่ายในเตโชธาตุ<br />
            ย่อมคลายกำหนัดในเตโชธาตุ<br /><br />
            วาโยธาตุที่เป็นภายในก็ดี เป็นภายนอกก็ดี<br />
            วาโยธาตุนั้นก็เป็น แต่สักว่าวาโยธาตุเท่านั้น<br />
            พึงเห็นวาโยธาตุนั้นด้วยปัญญาอันชอบ<br />
            ตามความเป็นจริงอย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา นั่นไม่เป็นเรา นั่นไม่ใช่ตัวตนของเรา<br />
            เพราะเห็นด้วยปัญญา อันชอบตามความเป็นจริงอย่างนั้น<br />
            จิตย่อมเบื่อหน่ายในวาโยธาตุ<br />
            ย่อมคลายกำหนัดในวาโยธาตุ<br />
            เพราะเหตุที่พิจารณาเห็นว่า<br />
            ไม่ใช่ตัวตนไม่เนื่องในตนในธาตุ 4 นี้<br />
            พระพุทธเจ้ากล่าวว่าตัดตัณหาได้แล้ว<br />
            รื้อถอนสังโยชน์เสียได้<br />
            การกระทำที่สุดแห่งทุกข์ได้แล้ว<br />
            เพราะละมานะได้โดยชอบ<br /><br /><hr /><br />
            </h4>
            <a href="/third/lesson0313">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ว่าด้วยการกระทำที่สุดทุกข์
              </button>
            </a>
        </div>

      </section>
    </div>
  )
}

export default Lesson0314;