import React from 'react';

const Lesson0313 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ว่าด้วยเวทนา 3</h2>
          </div>
            <h4>
            ว่าด้วยเวทนา 3 เกิดแต่ผัสสะ<br />
            มีผัสสะเป็นมูล<br />
            พระพุทธเจ้าตรัสไว้ว่า เวทนา 3 นี้เกิดแต่ผัสสะ<br />
            มีผัสสะเป็นมูลมีผัสสะเป็นเหตุ<br />
            มีผัสสะเป็นปัจจัย<br />
            เวทนา 3 เป็นไฉน<br />
            เวทนา 3 คือ<br />
            สุขเวทนา ทุกขเวทนา ไม่ทุกข์ไม่สุขเวทนา<br /><br />
            สุขเวทนาย่อมเกิดขึ้น เพราะอาศัยผัสสะ อันเป็นที่ตั้งแห่งสุขเวทนา<br />
            ความเสวยอารมณ์ อันเกิดแต่ผัสสะนั้นชื่อว่าสุขเวทนา<br />
            เกิดขึ้นเพราะอาศัยผัสสะ<br />
            อันเป็นที่ตั้งแห่งสุขเวทนานั้น ย่อมดับไปสงบไป<br />
            เพราะผัสสะอันเป็นที่ตั้ง แห่งสุขเวทนานั้นแลดับไป<br /><br />
            ทุกขเวทนาย่อมเกิดขึ้น เพราะอาศัยผัสสะ อันเป็นที่ตั้งแห่งทุกขเวทนา<br />
            ความเสวยอารมณ์ อันเกิดแต่ผัสสะนั้นชื่อว่าทุกขเวทนา<br />
            เกิดขึ้นเพราะอาศัยผัสสะ<br />
            อันเป็นที่ตั้งแห่งทุกขเวทนา นั้นย่อมดับไปสงบไป<br />
            เพราะผัสสะอันเป็นที่ตั้ง แห่งทุกขเวทนานั้นแลดับไป<br /><br />
            ไม่ทุกข์ไม่สุขเวทนา ย่อมเกิดขึ้นเพราะอาศัยผัสสะ อันเป็นที่ตั้งแห่งไม่ทุกข์ไม่สุขเวทนา<br />
            ความเสวยอารมณ์ อันเกิดแต่ผัสสะนั้นชื่อว่า ไม่ทุกข์ไม่สุขเวทนา<br />
            เกิดขึ้นเพราะอาศัยผัสสะ อันเป็นที่ตั้งแห่งไม่ทุกข์ไม่สุขเวทนา นั้นย่อมดับไปสงบไป<br />
            เพราะผัสสะอันเป็นที่ตั้ง แห่งไม่ทุกข์ไม่สุขเวทนานั้นแลดับไป<br />
            เพราะไม้สองอันเสียดสีกัน<br />
            เพราะการเสียดสีกัน เกิดไออุ่นจึงเกิดไฟ<br />
            เพราะแยกไม้สองอันนั้น แลออกจากกัน<br />
            ไออุ่นที่เกิดขึ้นเพราะการเสียดสีนั้น ย่อมดับไป สงบไปฉันใด<br />
            เวทนา 3 นี้ก็ฉันนั้นเหมือนกันแล<br />
            เกิดแต่ผัสสะ มีผัสสะเป็นเหตุ<br />
            มีผัสสะเป็นปัจจัย<br />
            เวทนาอันเกิดแต่ผัสสะเกิดขึ้น<br />
            เพราะอาศัยผัสสะที่เกิดแต่ปัจจัยนั้น<br />
            ย่อมดับไปเพราะผัสสะที่เกิดปัจจัยนั้นดับไป<br /><br /><hr /><br />
            </h4>
            <a href="/third/lesson0313">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ว่าด้วยการกระทำที่สุดทุกข์
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0313;