import React from 'react';

const Lesson0307 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ว่าด้วยความเป็นอนัตตาแห่งอายตนะภายนอก</h2>
          </div>
            <h4>
            ตาเห็นรูปการเคลื่อนไหวทางตา เกิดขึ้นแล้ว<br />
            เพราะโลกและชีวิตกระทบสัมผัสกัน เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตนหรือจากของของตน<br /><br />
            หูได้ยินเสียงการเคลื่อนไหวทางหู เกิดขึ้นแล้ว<br />
            เพราะโลกและชีวิตกระทบสัมผัสกัน เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตนหรือจากของของตน<br /><br />
            จมูกได้กลิ่นการเคลื่อนไหวทางจมูก เกิดขึ้นแล้ว<br />
            เพราะโลกและชีวิตกระทบสัมผัสกัน เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตนหรือจากของของตน<br /><br />
            ลิ้นได้รสการเคลื่อนไหวทางลิ้น เกิดขึ้นแล้ว<br />
            เพราะโลกและชีวิตกระทบสัมผัสกัน เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตน หรือจากของของตน<br /><br />
            กายสัมผัสการเคลื่อนไหวทางกาย เกิดขึ้นแล้ว<br />
            เพราะโลกและชีวิตกระทบสัมผัสกัน เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตน หรือจากของของตน<br /><br />
            ใจคิดนึกการเคลื่อนไหวทางใจ เกิดขึ้นแล้ว<br />
            เพราะโลกและชีวิตกระทบสัมผัสกัน เป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมกันชั่วคราว แล้วแตกสลาย<br />
            ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรไปยึดมั่นถือมั่น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตน หรือจากของของตน<br /><br /><hr /><br />    
            </h4>
            <a href="/third/lesson0302">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ว่าด้วยทรงแสดงธรรมเพื่อความเป็นผู้อยู่ผู้เดียว
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0307;