import React from 'react';

const Lesson0308 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ว่าด้วยทรงแสดงธรรมเพื่อความเป็นผู้อยู่ผู้เดียว</h2>
          </div>
            <h4>
            1. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ว่า<br />
            จักษุเที่ยงหรือไม่เที่ยง<br />
            พระอานนท์ตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            2. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์ หรือเป็นสุขเล่า<br />
            พระอานนท์ตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            3. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวน เป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระอานนท์ตอบว่า<br />
            ไม่ควรเห็นอย่างนั้น พระเจ้าข้า<br /><br />
            4. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ว่า<br />
            รูปเที่ยงหรือไม่เที่ยง<br />
            พระอานนท์ตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            5. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์ หรือเป็นสุขเล่า<br />
            พระอานนท์ตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            6. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวน เป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระอานนท์ตอบว่า<br />
            ไม่ควรเห็นอย่างนั้น พระเจ้าข้า<br /><br />
            7. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ว่า<br />
            จักษุวิญญาณ จักษุสัมผัส สุขเวทนา ทุกขเวทนา หรือไม่ทุกข์ไม่สุขเวทนา<br />
            ที่เกิดขึ้น เพราะจักษุสัมผัส เป็นปัจจัยเที่ยงหรือไม่เที่ยง<br />
            พระอานนท์ตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            8. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า<br />
            พระอานนท์ตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            9. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวน เป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระอานนท์ตอบว่า<br />
            ไม่ควรเห็นอย่างนั้น พระเจ้าข้า<br /><br />
            10. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ว่า<br />
            ใจเที่ยงหรือไม่เที่ยง<br />
            พระอานนท์ตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            11. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์ หรือเป็นสุขเล่า<br />
            พระอานนท์ตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            12. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวน เป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระอานนท์ตอบว่า<br />
            ไม่ควรเห็นอย่างนั้น พระเจ้าข้า<br /><br />
            13. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ว่า<br />
            ธรรมารมณ์ เที่ยงหรือไม่เที่ยง<br />
            พระอานนท์ตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            14. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง สิ่งนั้นเป็นทุกข์ หรือเป็นสุขเล่า<br />
            พระอานนท์ตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            15. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวน เป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระอานนท์ตอบว่า<br />
            ไม่ควรเห็นอย่างนั้น พระเจ้าข้า<br /><br />
            16. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ว่า<br />
            มโนวิญญาณ มโนสัมผัส สุขเวทนา ทุกขเวทนา หรือไม่ทุกข์ไม่สุขเวทนา<br />
            ที่เกิดขึ้น เพราะมโนสัมผัส เป็นปัจจัยเที่ยง หรือไม่เที่ยง<br />
            พระอานนท์ตอบว่า<br />
            ไม่เที่ยงพระเจ้าข้า<br /><br />
            17. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง<br />
            สิ่งนั้นเป็นทุกข์ หรือเป็นสุขเล่า พระอานนท์ตอบว่า<br />
            เป็นทุกข์พระเจ้าข้า<br /><br />
            18. พระพุทธเจ้า ทรงตรัสถาม พระอานนท์ต่อไปว่า<br />
            ก็สิ่งใดไม่เที่ยง เป็นทุกข์ มีความแปรปรวน เป็นธรรมดา<br />
            ควรหรือหนอ ที่จะตามเห็นสิ่งนั้น ว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา<br />
            พระอานนท์ตอบว่า<br />
            ไม่ควรเห็นอย่างนั้น พระเจ้าข้า<br /><br />
            อริยสาวก ผู้ได้สดับแล้วเห็นอยู่อย่างนี้<br />
            ย่อมเบื่อหน่อยทั้งในจักษุ ทั้งในรูป<br />
            ทั้งในจักษุวิญญาณ<br />
            ทั้งในจักษุสัมผัส<br />
            ทั้งในสุขเวทนาทุกขเวทนา<br />
            หรือไม่ทุกข์ไม่สุขเวทนา<br />
            ที่เกิดขึ้น เพราะอาศัยจักษุสัมผัส เป็นปัจจัยตามความเป็นจริง<br />
            เมื่อเบื่อหน่อยย่อมคลายกำหนัด<br />
            เพราะคลายกำหนัดจึงหลุดพ้น<br />
            เมื่อหลุดพ้นแล้ว ย่อมมีญาณหยั่งรู้ว่าหลุดพ้นแล้ว<br />
            รู้ชัดว่าชาติสิ้นแล้ว<br />
            พรหมจรรย์อยู่จบแล้ว<br />
            กิจที่ควรทำ ทำเสร็จแล้ว<br />
            กิจอื่นเพื่อความเป็นอย่างนี้มิได้มีอีก<br /><br /><hr /><br />
            </h4>
            <a href="/third/lesson0309">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ถ้ามีคนพึงถามอย่างนี้ว่า
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0308;