import React from 'react';

const Lesson0310 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ถ้ามีคนพึงถามอย่างนี้ว่า</h2>
          </div>
            <h4>
            พระพุทธเจ้าตรัสไว้ว่า เมื่อเมตตาเจโตวิมุติอันบุคคลเสพแล้ว ทำให้มากแล้ว<br />
            ทำให้เป็นดุจญาณ<br />
            ทำให้เป็นที่ตั้งให้ตั้งมั่นโดยลำดับ<br />
            สั่งสมดีแล้ว ปรารถนาดีแล้ว<br />
            พึงหวังอานิสงส์ 11 ประการ<br />
            11 ประการเป็นไฉน<br />
            คือย่อมหลับเป็นสุข<br />
            ย่อมตื่นเป็นสุข<br />
            ย่อมไม่ฝันลามก<br />
            ย่อมเป็นที่รักของมนุษย์ทั้งหลาย<br />
            ย่อมเป็นที่รักของอมนุษย์ทั้งหลาย<br />
            เทวดาทั้งหลายย่อมรักษา<br />
            ไฟ ยาพิษ หรือศาสตราย่อมไม่กล้ำกลายได้<br />
            จิตย่อมตั้งมั่นได้เร็ว<br />
            สีหน้าผ่องใส<br />
            เป็นผู้ไม่หลงไหลทำกาละ<br />
            เมื่อไม่แทงตลอด<br />
            คุณยิ่งย่อมเป็นผู้เข้าถึงพรหมโลก<br /><br />
            เมื่อเมตตาเจโตวิมุติอันบุคคลเสพแล้ว<br />
            เจริญแล้วทำให้มากแล้ว<br />
            ทำให้เจริญดุจญาณ<br />
            ทำให้ตั้งมั่นโดยลำดับ<br />
            สั่งสมดีแล้ว ปรารถนาดีแล้ว<br />
            พึงหวังอานิสงส์ 11 ประการฉะนี้แล<br /><br /><hr /><br />
            </h4>
            <a href="/third/lesson0311">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ราหุลสูตร
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0310;