import React from 'react';

const Lesson0315 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ว่าด้วยการกระทำที่สุดทุกข์</h2>
          </div>
            <h4>
            สมัยหนึ่งพระผู้มีพระภาค ประทับอยู่ ณ กูฎาคารศาลา<br />
            ในป่ามหาวันใกล้พระนครเวสาลี<br />
            ครั้งนั้นแล<br />
            อุคค คฤหบดีชาวเมืองเวสาลี<br />
            ได้เข้าไปเฝ้าพระผู้มีพระภาค ถึงที่ประทับ<br />
            ครั้นแล้วได้ทูลถามพระผู้มีพระภาค<br />
            ว่าข้าแต่พระองค์ผู้เจริญ<br />
            เหตุปัจจัยอะไรหนอแล<br />
            เป็นเครื่องให้สัตว์บางพวก ในโลกนี้ไม่ปรินิพพานในปัจจุบัน<br />
            อนึ่ง เหตุปัจจัยอะไร เป็นเครื่องให้สัตว์บางพวก ในโลกนี้ปรินิพพานในปัจจุบัน<br /><br />
            พระผู้มีพระภาคตรัสว่า มีอยู่แลคฤหบดี<br />
            รูปทั้งหลายอันบุคคลพึงรู้แจ้ง ด้วยจักษุอันน่าปรารถนาน่าใคร่น่าพอใจ<br />
            น่ารัก ชักให้ใคร่ ชวนให้กำหนัด <br />
            หากว่าภิกษุเพลิดเพลิน หมกมุ่น พัวพันรูปนั้น<br />
            เมื่อภิกษุนั้นเพลิดเพลิน<br />
            หมกมุ่น พัวพันรูปนั้นอยู่<br />
            วิญญาณอันอาศัยซึ่งตัณหานั้นก็ย่อมมี<br />
            อุปาทานอันอาศัยซึ่งตัณหานั้นก็ย่อมมี<br />
            ภิกษุผู้มีอุปาทานย่อมไม่ปรินิพพาน<br />
            เสียง กลิ่น รส โผฏฐัพพะ และธรรมารมณ์<br />
            อันบุคคลพึงรู้แจ้งด้วยใจ อันน่าปรารถนาน่าใคร่ น่าพอใจ<br />
            น่ารักชักให้ใคร่<br />
            ชวนให้กำหนัด<br />
            หากว่าภิกษุ เพลิดเพลิน<br />
            หมกมุ่นพัวพันธรรมารมณ์นั้น<br />
            เมื่อภิกษุนั้นเพลิดเพลิน หมกมุ่น พัวพันธรรมารมณ์นั้นอยู่<br />
            วิญญาณอันอาศัยซึ่งตัณหานั้นก็ย่อมมี<br />
            อุปาทานอาศัยซึ่งปัญหานั้นก็ย่อมมี<br />
            ภิกษุผู้มีอุปาทานย่อมไม่ปรินิพพาน<br />
            ดูกรคฤหบดีเหตุปัจจัยนี้แล<br />
            เป็นเครื่องให้สัตว์บางพวก<br />
            ในโลกนี้ไม่ปรินิพพานในปัจจุบัน<br /><br />
            ดูกรและคฤหบดี รูปอันบุคคลพึงรู้แจ้งด้วยจักษุ<br />
            อันน่าปรารถนาน่าใคร่น่าพอใจ<br />
            น่ารัก ชักให้ใคร่ ชวนให้กำหนัด<br />
            หากว่าภิกษุไม่เพลิดเพลิน ไม่หมกมุ่นไม่พัวพันรูปนั้น<br />
            เมื่อภิกษุนั้นไม่เพลิดเพลิน ไม่หมกมุ่นไม่พัวพันรูปนั้นอยู่<br />
            วิญญาณอาศัยซึ่งตัณหานั้นก็ย่อมไม่มี<br />
            อุปาทานอันอาศัยซึ่งตัณหา นั้นก็ย่อมไม่มี<br />
            ภิกษุผู้ไม่มีอุปทานย่อมปรินิพพาน<br />
            เสียง กลิ่น รส โผฏฐัพพะ และธรรมารมณ์<br />
            อันบุคคลพึงรู้แจ้งด้วยใจ อันน่าปรารถนาน่าใคร่ น่าพอใจ<br />
            น่ารัก ชักให้ใคร่ ชวนให้กำหนัด<br />
            หากภิกษุไม่เพลิดเพลิน ไม่หมกมุ่น ไม่พัวพันธรรมารมณ์นั้น<br />
            เมื่อภิกษุนั้นไม่เพลินไม่หมกมุ่น ไม่พัวพันในธรรมารมณ์นั้นอยู่<br />
            วิญญาณอันอาศัยซึ่งตัณหานั้นก็ย่อมไม่มี<br />
            อุปาทานอันอาศัยซึ่งตัณหานั้นก็ย่อมไม่มี<br />
            ภิกษุผู้ไม่มีอุปาทานย่อมปรินิพพาน<br /><br /><hr /><br />
            </h4>
            <a href="/forth/lesson0401">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                วิปัสสนาภาวนา พิจารณาขันธ์ 5 อินทรีย์ 6
              </button>
            </a>
        </div>

      </section>
    </div>
  )
}

export default Lesson0315;