import React from 'react';

const Lesson0309 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ถ้ามีคนพึงถามอย่างนี้ว่า</h2>
          </div>
            <h4>
            ถ้ามีคนพึงถามอย่างนี้ว่า ธรรมทั้งปวงมีอะไรเป็นมูล<br />
            ธรรมทั้งปวงมีอะไรเป็นแดนเกิด<br />
            ธรรมทั้งปวงมีอะไรเป็นสมุทัย<br />
            ธรรมทั้งปวงมีอะไรเป็นที่ประชุมลง<br />
            ธรรมทั้งปวงมีอะไรเป็นประมุข<br />
            ธรรมทั้งปวงมีอะไรเป็นใหญ่<br />
            ธรรมทั้งปวงมีอะไรเป็นยิ่งกว่า<br />
            ธรรมทั้งปวงมีอะไรเป็นแก่นสาร<br />
            ให้ตอบอย่างนี้ว่า ธรรมทั้งปวงมีอะไรเป็นมูล<br />
            มีฉันทะเป็นมูล<br />
            ธรรมทั้งปวงมีอะไรเป็นแดนเกิด<br />
            มีมนสิการเป็นแดนเกิด<br />
            ธรรมทั้งปวงมีอะไรเป็นสมุทัย<br />
            มีผัสสะเป็นสมุทัย<br />
            ธรรมทั้งปวงมีอะไรเป็นที่ประชุมลง<br />
            มีเวทนาเป็นที่ประชุมลง<br />
            ธรรมทั้งปวงมีอะไรเป็นประมุข<br />
            มีสมาธิเป็นประมุข<br />
            ธรรมทั้งปวงมีอะไรเป็นใหญ่<br />
            มีสติเป็นใหญ่<br />
            ธรรมทั้งปวงมีอะไรเป็นยิ่งกว่า<br />
            มีปัญญาเป็นยิ่ง<br />
            ธรรมทั้งปวงมีอะไรเป็นแก่นสาร<br />
            มีวิมุติเป็นแก่นสาร<br /><br />
            พระพุทธเจ้าตรัสไว้ว่า ธรรมเป็นที่สิ้นอาสวะ 10 ประการ<br />
            ธรรม 10 ประการนี้ อันบุคคลเจริญแล้วทำให้มากแล้ว<br />
            ย่อมเป็นไปเพื่อความสิ้นไป แห่งอาสวะทั้งหลาย<br />
            ธรรม 10 ประการเป็นไฉน<br />
            คือสัมมาทิฏฐิ สัมมาสังกัปปะ สัมมาวาจา<br />
            สัมมากัมมันตะ สัมมาอาชีวะ สัมมาวายามะ<br />
            สัมมาสติ สัมมาสมาธิ สัมมาญาณะ สัมมาวิมุติ<br />
            ธรรม 10 ประการนี้ อันบุคคลเจริญแล้วทำให้มากแล้ว<br />
            ย่อมเป็นไปเพื่อความสิ้นไป<br />
            แห่งอาสวะทั้งหลาย<br /><br />
            พระพุทธเจ้าตรัสไว้ว่า การจักแสดงสิ่งที่ดี และสิ่งที่ไม่ดีแก่เธอทั้งหลาย<br />
            สิ่งที่ไม่ดีเป็นไฉน<br />
            คือมิจฉาทิฏฐิ ความเห็นผิด<br />
            มิจฉาสังกัปปะ ความดำริผิด<br />
            มิจฉาวาจา เจรจาผิด<br />
            มิจฉากัมมันตะ การงานผิด<br />
            มิจฉาอาชีวะ เลี้ยงชีพผิด<br />
            มิจฉาวายามะ ความพยายามผิด<br />
            มิจฉาสติ ความระลึกผิด<br />
            มิจฉาสมาธิ ตั้งใจผิด<br />
            มิจฉาญาณะ รู้ผิด<br />
            มิจฉาวิมุติ หลุดพ้นผิด<br />
            นี้เรียกว่าสิ่งที่ไม่ดี<br /><br />
            ก็สิ่งที่ดีเป็นไฉน<br />
            คือสัมมาทิฏฐิ ความเห็นชอบ<br />
            สัมมาสังกัปปะ ความดำริชอบ<br />
            สัมมาวาจา เจรจาชอบ<br />
            สัมมากัมมันตะ การงานชอบ<br />
            สัมมาอาชีวะ เลี้ยงชีพชอบ<br />
            สัมมาวายามะ ความเพียรชอบ<br />
            สัมมาสติ ระลึกชอบ<br />
            สัมมาสมาธิ ตั้งใจชอบ<br />
            สัมมาญาณะ ความรู้ชอบ<br />
            สัมมาวิมุติ ความหลุดพ้นชอบ<br />
            นี้เรียกว่าสิ่งที่ดี<br /><br /><hr /><br />  
            </h4>
            <a href="/third/lesson0302">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ถ้ามีคนพึงถามอย่างนี้ว่า (ต่อ)
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0309;