import React from 'react';

const Lesson0306 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ว่าด้วยความเป็นอนัตตาแห่งอายตนะภายนอก</h2>
          </div>
            <h4>
            พระพุทธเจ้าตรัสไว้ว่า รูปเป็นอนัตตา<br />
            สิ่งใดเป็นอนัตตา สิ่งนั้นท่านทั้งหลาย พึงเห็นด้วยปัญญา อันชอบตามความเป็นจริง อย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา นั่นไม่เป็นเรา นั่นไม่ใช่ตัวตนของเรา<br />
            เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์ เป็นอนัตตา<br />
            สิ่งใดเป็นอนัตตา สิ่งนั้นท่านทั้งหลาย พึงเห็นด้วยปัญญา อันชอบตามความเป็นจริง อย่างนี้ว่า<br />
            นั่นไม่ใช่ของเรา นั่นไม่เป็นเรา นั่นไม่ใช่ตัวตนของเรา<br /><br />
            เมื่ออริยสาวก ผู้ได้สดับแล้วเห็นอยู่อย่างนี้<br />
            ย่อมเบื่อหน่ายแม้ในรูป<br />
            ย่อมเบื่อหน่ายแม้ในเสียง<br />
            ย่อมเบื่อหน่ายแม้ในกลิ่น<br />
            ย่อมเบื่อหน่ายแม้ในรส<br />
            ย่อมเบื่อหน่ายแม้ในโผฏฐัพพะ<br />
            ย่อมเบื่อหน่ายแม้ในธรรมารมณ์<br />
            เมื่อเบื่อหน่ายย่อมคลายกําหนัด<br />
            เพราะคลายกําหนัดย่อมหลุดพ้น<br />
            เมื่อหลุดพ้นแล้ว ย่อมมีญาณหยั่งรู้ว่าหลุดพ้นแล้ว<br />
            รู้ชัดว่าชาติสิ้นแล้ว<br />
            พรหมจรรย์อยู่จบแล้ว<br />
            กิจที่ควรทํา..ทําเสร็จแล้ว<br />
            กิจอื่นเพื่อความเป็นอย่างนี้มิได้มี<br /><br /><hr /><br />
            </h4>
            <a href="/third/lesson0307">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ว่าด้วยความเป็นอนัตตาแห่งอายตนะภายนอก
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0306;