import React from 'react';

const Lesson0303 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ว่าด้วยความเป็นอนัตตาแห่งอายตนะภายใน</h2>
          </div>
            <h4>
            พระพุทธเจ้าตรัสไว้ว่า จักษุเป็นอนัตตา<br />
            สิ่งใดเป็นอนัตตา สิ่งนั้นท่านทั้งหลาย พึงเห็นด้วยปัญญา อันชอบตามความเป็นจริง อย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตนหรือจากของๆตน<br /><br />
            หูเป็นอนัตตา สิ่งใดเป็นอนัตตา สิ่งนั้นท่านทั้งหลาย<br />
            พึงเห็นด้วยปัญญา อันชอบตามความเป็นจริง อย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตนหรือจากของๆตน<br /><br />
            จมูกเป็นอนัตตา สิ่งใดเป็นอนัตตา สิ่งนั้นท่านทั้งหลาย<br />
            พึงเห็นด้วยปัญญา อันชอบตามความเป็นจริง อย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตนหรือจากของๆตน<br /><br />
            ลิ้นเป็นอนัตตา สิ่งใดเป็นอนัตตา สิ่งนั้นท่านทั้งหลาย<br />
            พึงเห็นด้วยปัญญา อันชอบตามความเป็นจริง อย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตนหรือจากของๆตน<br /><br />
            กายเป็นอนัตตา สิ่งใดเป็นอนัตตา สิ่งนั้นท่านทั้งหลาย<br />
            พึงเห็นด้วยปัญญา อันชอบตามความเป็นจริง อย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตนหรือจากของๆตน<br /><br />
            ใจเป็นอนัตตา สิ่งใดเป็นอนัตตา สิ่งนั้นท่านทั้งหลาย<br />
            พึงเห็นด้วยปัญญา อันชอบตามความเป็นจริง อย่างนี้ว่า<br />
            ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง<br />
            เกิดจากเหตุปัจจัย มาประชุมปรุงแต่งกันชั่วคราว แล้วแตกสลาย ไม่มีตัวตนเป็นของตนเอง<br />
            ไม่ควรเห็นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ ดับไม่เหลือ<br />
            ว่างเปล่าจากตนหรือจากของๆตน<br /><br />
            อริยสาวก ผู้ได้สดับแล้วเห็นอยู่อย่างนี้<br />
            ย่อมเบื่อหน่ายแม้ในจักษุ ย่อมเบื่อหน่ายแม้ในหู ย่อมเบื่อหน่ายแม้ในจมูก<br />
            ย่อมเบื่อหน่ายแม้ในลิ้น ย่อมเบื่อหน่ายแม้ในกาย ย่อมเบื่อหน่ายแม้ในใจ<br />
            เมื่อเบื่อหน่ายย่อมคลายกำหนัด<br />
            เพราะคลายกำหนัดย่อมหลุดพ้น<br />
            เมื่อหลุดพ้นแล้ว ย่อมมีญาณหยั่งรู้ว่าหลุดพ้นแล้ว<br />
            รู้ชัดว่าชาติสิ้นแล้ว พรหมจรรย์อยู่จบแล้ว<br />
            กิจที่ควรทำ ทำเสร็จแล้ว<br />
            กิจอื่นเพื่อความเป็นอย่างนี้มิได้มี<br /><br /><hr /><br />
            </h4>
            <a href="/third/lesson0302">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                ว่าด้วยความเป็นอนิจจังแห่งอายตนะภายนอก
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Lesson0303;