import React from 'react';

const Introduction = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>บทสรรเสริญคุณพระรัตนตรัย</h2>
          </div>
            <h4>
            นะโม ตัสสะ ภะคะวะโต อะระหะโต สัมมา สัมพุทธัสสะ<br />
            นะโม ตัสสะ ภะคะวะโต อะระหะโต สัมมา สัมพุทธัสสะ<br />
            นะโม ตัสสะ ภะคะวะโต อะระหะโต สัมมา สัมพุทธัสสะ<br /><br />
            ขอนอบน้อมแด่พระผู้มีพระภาคเจ้า พระองค์นั้น<br />
            ซึ่งเป็นผู้ไกลจากกิเลส<br />
            ตรัสรู้ชอบได้โดยพระองค์เอง<br /><br />
            ขอนอบน้อมแด่พระผู้มีพระภาคเจ้า พระองค์นั้น<br />
            ซึ่งเป็นผู้ไกลจากกิเลส<br />
            ตรัสรู้ชอบได้โดยพระองค์เอง<br /><br />
            ขอนอบน้อมแด่พระผู้มีพระภาคเจ้า พระองค์นั้น<br />
            ซึ่งเป็นผู้ไกลจากกิเลส<br />
            ตรัสรู้ชอบได้โดยพระองค์เอง <br /><hr /><br /><br />
            อะระหัง สัมมาสัมพุทโธ ภะคะวา<br />
            พุทธัง ภะคะวันตัง อะภิวาเทมิ<br /><br />
            สวากขาโต ภะคะวะตา ธัมโม<br />
            ธัมมังนะมัสสามิ<br /><br />
            สุปะติปันโน ภะคะวะโต สาวะกะสังโฆ<br />
            สังฆัง นะมามิ <br /><hr /><br /><br />
            อิติปิโส ภะคะวา เพราะเหตุอย่างนี้ พระผู้มีพระภาคเจ้านั้น<br />
            อะระหัง สัมมา เป็นผู้ไกลจากกิเลส<br />
            สัมพุทโธ เป็นผู้ตรัสรู้ชอบโดยพระองค์เอง<br />
            วิชชาจะระณะสัมปันโน เป็นผู้ถึงพร้อมด้วยวิชชาและจรณะ<br />
            สุคะโต เป็นผู้ไปแล้วด้วยดี<br />
            โลกะวิทู เป็นผู้รู้โลกอย่างแจ่มแจ้ง<br />
            อะนุตตะโร ปุริสะธัมมะสาระถิ เป็นผู้สามารถฝึกคนที่สมควรฝึกได้ อย่างไม่มีใครยิ่งกว่า<br />
            สัตถาเทวะมะนุสสานัง เป็นครูผู้สอนของเทวดา และมนุษย์ทั้งหลาย<br />
            พุทโธ เป็นผู้รู้ ผู้ตื่น ผู้เบิกบานด้วยธรรม<br />
            ภะคะวาติ เป็นผู้มีความเจริญจำแนกธรรม สั่งสอนสัตว์ ดังนี้ <br /><hr /><br /><br />
            สวากขาโต ภะคะวาตา ธัมโม พระธรรม เป็นสิ่งที่พระผู้มีพระภาคเจ้า ตรัสไว้ดีแล้ว<br />
            สันทิฏฐิโก เป็นสิ่งที่ผู้ศึกษาและปฏิบัติ พึงเห็นได้ด้วยตนเอง<br />
            อะกาลิโก เป็นสิ่งที่ปฏิบัติได้ และให้ผลได้ไม่จำกัดกาล<br />
            เอหิปัสสิโก เป็นสิ่งที่ควรกล่าวกับผู้อื่นว่า ท่านจงมาดูเถิด<br />
            โอปะนะยิโก เป็นสิ่งที่ควรน้อมเข้ามาใส่ตัว<br />
            ปัจจัตตัง เวทิตัพโพ วิญญูหีติ เป็นสิ่งที่ผู้รู้ พึงรู้ได้เฉพาะตน ดังนี้ <br /><hr /><br /><br />
            สุปะฏิปันโน ภะคะวะโต สาวะกะสังโฆ<br />
            สงฆ์สาวก ของพระผู้มีพระภาคเจ้าหมู่ใด ปฏิบัติดีแล้ว<br />
            อุชุปฏิปันโน ภะคะวะโต สาวะกะสังโฆ<br />
            สงฆ์สาวก ของพระผู้มีพระภาคเจ้าหมู่ใด ปฏิบัติตรงแล้ว<br />
            ญายะปฏิปันโน ภะคะวะโต สาวะกะสังโฆ<br />
            สงฆ์สาวก ของพระผู้มีพระภาคเจ้าหมู่ใด ปฏิบัติเพื่อรู้ธรรม เป็นเครื่องออกจากทุกข์แล้ว<br />
            สามีจิปฏิปันโน ภะคะวะโต สาวะกะสังโฆ<br />
            สงฆ์สาวก ของพระผู้มีพระภาคเจ้าหมู่ใด ปฏิบัติสมควรแล้ว<br />
            ยะทิทัง ได้แก่บุคคลเหล่านี้คือ<br />
            จัตตาริ ปุริสสะ ยุคานิ อัฏฐะ ปุริสะปุคคะลา<br />
            คู่แห่งบุรุษสี่คู่ นับเรียงตัวได้แปดบุรุษ<br />
            เอสะ ภะคะวะโต สาวะกะสังโฆ<br />
            นั่นแหละ สงฆ์สาวก ของพระผู้มีพระภาคเจ้า<br />
            อาหุเนยโย เป็นผู้ควรแก่สักการะที่เขานำมาบูชา<br />
            ปาหุเนยโย เป็นผู้ควรแก่สักการะที่จัดไว้ต้อนรับ<br />
            ทักขิเนยโย เป็นผู้ควรรับทักษิณาทาน<br />
            อัญชะลีกะระนีโย เป็นผู้ที่บุคคลทั่วไปควรทำอัญชลี<br />
            อะนุตตะรัง ปุญญะเขตตัง โลกัสสาติ<br />
            เป็นเนื้อนาบุญของโลก ไม่มีนาบุญอื่นยิ่งกว่า ดังนี้<br /><hr /><br /><br />
            </h4>
            <a href="/primary/lesson0101">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" /> &nbsp;
                วิปัสสนาภาวนาพิจารณาขันธ์ ๕ อินทรีย์ ๖
              </button>
            </a>
        </div>
      </section>
    </div>
  )
}

export default Introduction;