import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Learning01 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ไม่เที่ยงเกิดดับ^500\nตาฉันเห็นรูปคือตัวฉันเห็นรูป^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nหูฉันได้ยินเสียงคือตัวฉันได้ยินเสียง^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nจมูกฉันได้กลิ่นคือตัวฉันได้กลิ่น^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nลิ้นฉันได้รสคือตัวฉันได้รส^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nกายฉันสัมผัสคือตัวฉันสัมผัส^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nใจฉันคิดนึกคือตัวฉันคิดนึก^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมฉันคิดคือตัวฉันคิด^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nวจีกรรมฉันพูดคือตัวฉันพูด^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nกายกรรมฉันทำคือตัวฉันทำ^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nมือฉันจับไม้กวาดคือตัวฉันจับไม้กวาด^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nมือฉันกวาดคือตัวฉันกวาด^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nมือฉันเคลื่นไหวคือตัวฉันเคลื่อนไหว^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nเท้าฉันเดินคือตัวฉันเดิน^500\nทั้งหมดคือโลกและชีวิตผลต่อเนื่อง^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>รู้ทันสิ่งที่มากระทบสัมผัส</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Learning01;