import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Learning01 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'กำหนดรู้ รู้ทันสิ่งที่มากระทบสัมผัส',
        'ไม่เที่ยงเกิดดับ^500\nตัวฉันเกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ ตัวฉันคือ^500\nรูป เวทนา สัญญา สังขาร วิญญาณ^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nรูป เวทนา สัญญา สังขาร วิญญาณ^500\nคือกาย เวทนา จิต ธรรม^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nกาย เวทนา จิต ธรรม^500\nคือโลกและชีวิต เกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของโลกและชีวิต^500\nคือวัตถุ สิ่งของ สัตว์ บุคคล^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ ผลต่อเนื่องของ^500\nวัตถุ สิ่งของ สัตว์ บุคคล^500\nคือรูป เสียง กลิ่น รส โผฏฐัพพะ^500\nธรรมารมณ์ เกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของรูป เสียง^500\nกลิ่น รส โผฏฐัพพะ ธรรมารมณ์^500\nคือความพอใจ ไม่พอใจ^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ ความพอใจ ไม่พอใจ^500\nคือความไม่รู้ เกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ ความไม่รู้^500\nคืออวิชชา เกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของอวิชชา^500\nคือชีวิต เกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ ชีวิต^500\nคือตัวฉัน เกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ ตัวฉัน^500\nคือรูป เวทนา สัญญา สังขาร^500\nวิญญาณ เกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nรูป เวทนา สัญญา สังขาร วิญญาณ^500\nคือกาย เวทนา จิต ธรรม^500\nเกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nกาย เวทนา จิต ธรรม^500\nคือโลกและชีวิต เกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับโลกและชีวิต^500\nคือตัวฉัน เกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย ไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ โลกและชีวิต^500\nเคลื่อนไหวเกิดขึ้น ตั้งอยู่ ดับไป^500\nเกิดจากเหตุปัจจัยมาประชุมชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nว่างเปล่าจากตนและของของตน^500\nไม่ควรไปยึดมั่นถือมั่นถือมั่นว่า^500\nโลกและชีวิตเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'ไม่เที่ยงเกิดดับ^500\nเหตุปัจจัยของตาเห็นรูปไม่เที่ยงเกิดดับ^500\nตาเห็นรูปไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของตาเห็นรูปไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nเหตุปัจจัยของหูได้ยินเสียง^500\nไม่เที่ยงเกิดดับ^500\nหูได้ยินเสียงไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของหูได้ยินเสียง^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nเหตุปัจจัยของจมูกได้กลิ่น^500\nไม่เที่ยงเกิดดับ^500\nจมูกได้กลิ่นไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของจมูกได้กลิ่น^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nเหตุปัจจัยของลิ้นได้รส^500\nไม่เที่ยงเกิดดับ^500\nลิ้นได้รสไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของลิ้นได้รส^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nเหตุปัจจัยของกายสัมผัส^500\nไม่เที่ยงเกิดดับ^500\nกายสัมผัสไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของกายสัมผัส^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nเหตุปัจจัยของใจคิดนึก^500\nไม่เที่ยงเกิดดับ^500\nใจคิดนึกไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของใจคิดนึก^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nเหตุปัจจัยของมโนกรรม^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของมโนกรรม^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nเหตุปัจจัยของวจีกรรม^500\nไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของวจีกรรม^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nไม่เที่ยงเกิดดับ^500\nเหตุปัจจัยของกายกรรม^500\nไม่เที่ยงเกิดดับ^500\nกายกรรมไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nผลต่อเนื่องของกายกรรม^500\nไม่เที่ยงเกิดดับ^500\nมโนกรรมไม่เที่ยงเกิดดับ^500\nวจีกรรมไม่เที่ยงเกิดดับ ^500\nกายกรรมไม่เที่ยงเกิดดับ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>รู้ทันสิ่งที่มากระทบสัมผัส</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Learning01;