import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0505 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'อานาปานสติภาวนา^500\nดูกรราหุล^500\nเธอจงเจริญอานาปานสติภาวนาเถิด^500\nเพราะอานาปานสติ^500\nที่บุคคลเจริญแล้วทำให้มากแล้ว^500\nย่อมมีผลมีอานิสงส์ใหญ่^500\nก็อานาปานสติอันบุคคลเจริญอย่างไร^500\nทำให้มากอย่างไร^500\nจึงมีผลใหญ่มีอานิสงส์ใหญ่^500\nดูกรราหุล^500\nภิกษุในธรรมวินัยนี้^500\nอยู่ในป่าก็ดี อยู่ที่โคนไม้ก็ดี^500\nอยู่ในเรือนว่างก็ดี^500\nนั่งคู้บัลลังก์ตั้งกายตรง^500\nดำรงสติไว้เฉพาะหน้า^500\nเธอมีสติหายใจออก^500\nมีสติหายใจเข้า^500\nเมื่อหายใจออกยาว^500\nก็รู้ชัดว่าหายใจออกยาว^500\nเมื่อหายใจเข้ายาว^500\nก็รู้ชัดว่าหายใจเข้ายาว^500\nเมื่อหายใจออกสั้น^500\nก็รู้ชัดว่าหายใจออกสั้น^500\nเมื่อหายใจเข้าสั้น^500\nก็รู้ชัดว่าหายใจเข้าสั้น^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้กองลมทั้งปวงหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้กองลมทั้งปวงหายใจเข้า^500\nย่อมสำเหนียกว่า^500\nจักระงับกายสังขารหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักระงับกายสังขารหายใจเข้า^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้ปิติหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้ปิติหายใจเข้า^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้สึกหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้สึกหายใจเข้า^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้จิตสังขารหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้จิตสังขารหายใจเข้า^500\nย่อมสำเหนียกว่า^500\nจักระงับจิตสังขารหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักระงับจิตสังขารหายใจเข้า^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้จิตหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักกำหนดรู้จิตหายใจเข้า^500\nย่อมสำเหนียกว่า^500\nจักทำจิตให้ร่าเริงหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักทำจิตให้ร่าเริงหายใจเข้า^500\nย่อมสำเหนียกว่า^500\nจักดำรงจิตมั่นหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักดำรงจิตมั่นหายใจเข้า^500\nย่อมสำเหนียกว่า^500\nจักเปลื้องจิตหายใจออก^500\nย่อมสำเหนียกว่า^500\nจักเปลื้องจิตหายใจเข้า^500\nย่อมสำเหนียกว่าจักพิจารณา^500\nโดยความเป็นของไม่เที่ยงหายใจออก^500\nย่อมสำเหนียกว่าจักพิจารณา^500\nโดยความเป็นของไม่เที่ยงหายใจเข้า^500\nย่อมสำเหนียกว่าจักพิจารณา^500\nธรรมอันปราศจากราคะหายใจออก^500\nย่อมสำเหนียกว่าจักพิจารณา^500\nธรรมอันปราศจากราคะหายใจเข้า^500\nย่อมสำเหนียกว่าจักพิจารณา^500\nธรรมเป็นที่ดับสนิทหายใจออก ^500\nย่อมสำเหนียกว่าจักพิจารณา^500\nธรรมเป็นที่ดับสนิทหายใจเข้า^500\nย่อมสำเหนียกว่าจักพิจารณา^500\nธรรมเป็นที่สละคืนหายใจออก^500\nย่อมสำเหนียกว่าจักพิจารณา^500\nธรรมเป็นที่สละคืนหายใจเข้า',
        'ดูกรราหุล^500\nอานาปานสติที่บุคคลเจริญแล้วอย่างนี้^500\nทำให้มากแล้วอย่างนี้^500\nย่อมมีผลใหญ่มีอานิสงส์ใหญ่^500\nดูกรราหุล^500\nเมื่ออานาปานสติอันบุคคลเจริญแล้วอย่างนี้^500\nทำให้มากแล้วอย่างนี้^500\nลมอัสสาสะปัสสาสะอันมีในภายหลัง^500\nอันบุคคลผู้เจริญอานาปานสติ^500\nทราบชัดแล้วย่อมดับไป^500\nหาเป็นอันบุคคลผู้เจริญอานาปานสติ^500\nไม่ทราบชัดแล้วดับไปไม่ได้ดังนี้^500\nพระผู้มีพระภาคได้ตรัสพระพุทธพจน์นี้แล้ว^500\nท่านพระราหุลมีใจยินดี^500\nชื่นชมพระภาษิตของพระผู้มีพระภาคดังนี้แล'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อานาปานสติภาวนา</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0505;