import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0503 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'มหาราหุโลวาทสูตร\nเรื่องพระราหุล\nข้าพเจ้าได้สดับมาอย่างนี้\nสมัยหนึ่งพระผู้มีพระภาค\nประทับอยู่ ณ พระวิหารเชตวัน\nอารามของท่านอนาถบิณฑิกเศรษฐี\nเขตพระนครสาวัตถี\nครั้งนั้นเวลาเช้า\nพระผู้มีพระภาค\nครองอันตรวาสก\nแล้วถือบาตรและจีวร\nเสด็จเข้าไปบิณฑบาต\nยังนครสาวัตถีเวลาเช้า\nแม้ท่านพระราหุล\nก็ครองอันตรวาสก\nแล้วถือบาตรและจีวร\nตามพระผู้มีพระภาคไป\nณ เบื้องพระปฤษฎางค์\nครั้งนั้นพระผู้มีพระภาค\nทรงผินพระพักตร์\nไปรับสั่งกะท่านพระราหุลว่า\nดูกรราหุล\nรูปอย่างใดอย่างหนึ่ง\nที่เป็นอดีตเป็นอนาคต\nและเป็นปัจจุบัน\nเป็นภายในก็ดีเป็นภายนอกก็ดี\nหยาบก็ดีละเอียดก็ดี\nเลวก็ดีประณีตก็ดี\nอยู่ในที่ไกลก็ดีอยู่ในที่ใกล้ก็ดี\nรูปทั้งปวงนี้เธอพึงเห็นด้วยปัญญา\nอันชอบตามเป็นจริงอย่างนี้ว่า\nนั่นไม่ใช่ของเรา\nเราไม่เป็นนั่น\nนั่นไม่ใช่ตัวตนของเราดังนี้\nพระราหุลทูลถามว่า\nข้าแต่พระผู้มีพระภาค\nรูปเท่านั้นหรือ\nข้าแต่พระสุคตรูปเท่านั้นหรือ\nพระพุทธเจ้าตรัสตอบว่า\nดูกรราหุลทั้งรูป \nทั้งเวทนา ทั้งสัญญา\nทั้งสังขาร ทั้งวิญญาณ\nครั้งนั้นท่านพระราหุลคิดว่า\nวันนี้ใครหนออันพระผู้มีพระภาค\nทรงโอวาทด้วย\nโอวาทในที่เฉพาะพระพักตร์\nแล้วจักเข้าบ้านเพื่อบิณฑบาตเล่า\nดังนี้แล้วกลับจากที่นั้นแล้ว\nนั่งคู้บัลลังก์ตั้งกายตรง\nดำรงสติไว้เฉพาะหน้า\nณ โคนต้นไม้แห่งหนึ่ง\nท่านพระสารีบุตรได้เห็นท่านพระราหุล\nนั่งคู้บัลลังก์ตั้งกายตรง\nดำรงสติไว้เฉพาะหน้า\nณ โคนต้นไม้แห่งหนึ่ง\nแล้วบอกกะท่านพระราหุลว่า\nดูกรราหุล\nท่านจงเจริญอานาปานสติเถิด\nด้วยว่าอานาปานสติภาวนา\nที่บุคคลเจริญแล้วทำให้มากแล้ว\nย่อมมีผลมากมีอานิสงส์มาก\nดังนั้นเวลาเย็น\nท่านพระราหุลออกจากที่เร้น\nแล้วเข้าไปเฝ้าพระผู้มีพระภาค\nถึงที่ประทับถวายบังคมพระผู้มีพระภาค\nแล้วนั่งณที่ควรส่วนข้างหนึ่ง\nแล้วได้ทูลพระผู้มีพระภาคว่า\nข้าแต่พระองค์ผู้เจริญอานาปานสติ\nอันบุคคลเจริญแล้วอย่างไร\nทำให้มากแล้วอย่างไร\nจึงจะมีผลมีอานิสงส์',
        'ธาตุ 5 \nดูกรราหุล\nรูปอย่างใดอย่างหนึ่ง\nเป็นภายในอาศัยตน\nเป็นของหยาบมีลักษณะแข้นแข็ง\nอันกรรมและกิเลสเข้าไปยึดมั่น\nคือ ผม ขน เล็บ ฟัน หนัง\nเนื้อ เอ็น กระดูก \nเยื่อในกระดูก ม้าม หัวใจ\nตับ พังผืด ไต ปอด ไส้ใหญ่ ไส้น้อย\nอาหารใหม่ อาหารเก่า\nหรือสิ่งใดสิ่งหนึ่งอย่างอื่น\nเป็นภายในอาศัยตน\nเป็นของหยาบมีลักษณะแข้นแข็ง\nอันกรรมและกิเลสเข้าไปยึดมั่น\nนี้เราเรียกว่าปฐวีธาตุเป็นภายใน\nก็ปฐวีธาตุเป็นภายในก็ดี\nเป็นภายนอกก็ดี\nอันใดปฐวีธาตุนั้น\nเป็นปฐวีธาตุเหมือนกัน\nปฐวีธาตุนั้นเธอพึงเห็นด้วยปัญญา\nอันชอบตามเป็นจริงอย่างนี้ว่า\nนั่นไม่ใช่ของเรา\nเราไม่เป็นนั่น\nนั่นไม่ใช่ตนของเราดังนี้\nเพราะบุคคลเห็นปฐวีธาตุนั้น\nด้วยปัญญาอันชอบ\nตามเป็นจริงอย่างนี้แล้ว\nย่อมเบื่อหน่ายในปฐวีธาตุ\nจิตย่อมคลายกำหนัดในปฐวีธาตุ',
        'ดูกรราหุลก็อาโปธาตุเป็นไฉน\nอาโปธาตุเป็นภายในก็มี\nเป็นภายนอกก็มี\nก็อาโปธาตุที่เป็นภายในเป็นไฉน\nสิ่งใดเป็นภายในอาศัยตน\nเป็นอาโปมีลักษณะเอิบอาบ\nอันกรรมและกิเลสเข้าไปยึดมั่น\nคือ ดี เสลด หนอง เลือด เหงื่อ\nมันข้น น้ำตา เปลวมัน น้ำลาย\nน้ำมูก ไขข้อ มูตร\nหรือสิ่งใดสิ่งหนึ่งอย่างอื่น\nเป็นภายในอาศัยตน\nเป็นอาโปมีลักษณะเอิบอาบ\nอันกรรมและกิเลสเข้าไปยึดมั่น\nนี้เราเรียกว่าอาโปธาตุเป็นภายใน\nก็อาโปธาตุเป็นภายในก็ดี\nเป็นภายนอกก็ดี\nอันใดอาโปธาตุนั้น\nเป็นอาโปธาตุเหมือนกัน\nอาโปธาตุนั้นเธอพึงเห็นด้วยปัญญา\nอันชอบตามเป็นจริงอย่างนี้ว่า\nนั่นไม่ใช่ของเรา\nเราไม่เป็นนั่น\nนั่นไม่ใช่ตนของเราดังนี้\nเพราะบุคคลเห็นอาโปธาตุนั้น\nด้วยปัญญาอันชอบ\nตามเป็นจริงอย่างนี้แล้ว\nย่อมเบื่อหน่ายในอาโปธาตุ\nจิตย่อมคลายกำหนัดในอาโปธาตุ',
        'ดูกรราหุล\nก็เตโชธาตุเป็นไฉน\nเตโชธาตุเป็นภายในก็มี\nเป็นภายนอกก็มี\nก็เตโชธาตุที่เป็นภายในเป็นไฉน\nสิ่งใดเป็นภายในอาศัยตน\nเป็นเตโชมีลักษณะร้อน\nอันกรรมและกิเลสเข้าไปยึดมั่น\nคือไฟที่ยังกายให้อบอุ่น\nไฟที่ยังกายให้ทรุดโทรมไฟ\nที่ยังกายให้กระวนกระวาย\nและไฟที่เผาอาหาร\nที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม\nให้ย่อยไปโดยชอบ\nหรือสิ่งใดสิ่งหนึ่งอย่างอื่น\nเป็นภายในอาศัยตน\nเป็นเตโชมีลักษณะร้อน\nอันกรรมและกิเลสเข้าไปยึดมั่น\nนี้เราเรียกว่าเตโชธาตุเป็นภายใน\nก็เตโชธาตุเป็นภายในก็ดี\nเป็นภายนอกก็ดี\nอันใดเตโชธาตุนั้น\nเป็นเตโชธาตุเหมือนกัน\nเตโชธาตุนั้นเธอพึงเห็นด้วยปัญญา\nอันชอบตามเป็นจริงวันนี้ว่า\nนั่นไม่ใช่ของเรา\nเราไม่เป็นนั่น\nนั่นไม่ใช่ตัวตนของเราดังนี้\nเพราะบุคคล\nเห็นเตโชธาตุนั้นด้วยปัญญา\nอันชอบตามเป็นจริงอย่างนี้แล้ว\nย่อมเบื่อหน่ายในเตโชธาตุ\nจิตย่อมคลายกำหนัดในเตโชธาตุ',
        'ดูกรราหุล\nวาโยธาตุเป็นไฉน\nวาโยธาตุเป็นภายในก็มี\nเป็นภายนอกก็มี\nก็วาโยธาตุเป็นภายในเป็นไฉน\nสิ่งใดเป็นภายในอาศัยตน\nเป็นวาโยมีลักษณะพัดไปมา\nอันกรรมและกิเลสเข้าไปยึดมั่น\nคือลมพัดขึ้นเบื้องบนลมพัดลงเบื้องต่ำ\nลมในท้องลมในไส้\nลมแล่นไปตามอวัยวะน้อยใหญ่\nลมหายใจหรือสิ่งใดสิ่งหนึ่งอย่างอื่น\nเป็นภายในอาศัยตน\nเป็นวาโยพัดไปมา\nอันกรรมและกิเลสเข้าไปยึดมั่น\nนี้เราเรียกว่าวาโยธาตุเป็นภายใน\nก็วาโยธาตุเป็นภายในก็ดี\nเป็นภายนอกก็ดี\nอันใดวาโยธาตุนั้น\nเป็นวาโยธาตุเหมือนกัน\nวาโยธาตุนั้นเธอพึงเห็นด้วยปัญญา\nอันชอบตามเป็นจริงอย่างนี้ว่า\nนั่นไม่ใช่ของเรา\nเราไม่เป็นนั่น\nนั่นไม่ใช่ตนของเราดังนี้\nเพราะบุคคลเห็นวาโยธาตุนั้น\nด้วยปัญญาอันชอบ\nตามเป็นจริงอย่างนี้แล้ว\nย่อมเบื่อหน่ายในวาโยธาตุ\nจิตย่อมคลายกำหนัดในวาโยธาตุ',
        'ดูกรราหุล\nก็อากาศธาตุเป็นไฉน\nอากาศธาตุเป็นภายในก็มี\nเป็นภายนอกก็มี\nอากาศธาตุที่เป็นภายในเป็นไฉน\nสิ่งใดเป็นภายในอาศัยตน\nเป็นอากาศมีลักษณะว่าง\nอันกรรมและกิเลสเข้าไปยึดมั่น\nคือช่องหูช่องจมูกช่องปาก\nช่องคอสำหรับกลืนอาหาร\nที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม\nและช่องสำหรับถ่ายอาหาร\nที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม ออกเบื้องล่าง\nหรือสิ่งใดสิ่งหนึ่งอย่างอื่น\nเป็นภายในอาศัยตน\nเป็นอากาศมีลักษณะว่างไม่ทึบ\nมีลักษณะไม่ทึบเป็นช่อง\nมีลักษณะเป็นช่อง\nอันเนื้อและเลือดไม่ถูกต้องเป็นภายใน\nอันกรรมและกิเลสเข้าไปยึดมั่น\nนี้เราเรียกว่าอากาศธาตุเป็นภายใน\nก็อากาศธาตุเป็นภายในก็ดี\nเป็นภายนอกก็ดี\nอันใดอากาศธาตุนั้น\nเป็นอากาศธาตุเหมือนกัน\nอากาศธาตุนั้นเธอพึงเห็นด้วยปัญญา\nอันชอบตามเป็นจริงอย่างนี้ว่า\nนั่นไม่ใช่ของเราเราไม่เป็นนั่น\nนั่นไม่ใช่ตนของเราดังนี้\nก็บุคคลเห็นอากาศธาตุนั้นด้วยปัญญา\nอันชอบตามเป็นจริงอย่างนี้แล้ว\nย่อมเบื่อหน่ายในอากาศธาตุ\nจิตย่อมคลายกำหนัดในอากาศธาตุ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>มหาราหุโลวาทสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0503;