import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0209 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'พระพุทธเจ้าตรัสไว้ดังนี้ว่า\nบุคคลเมื่อไม่รู้ไม่เห็นจักษุ\nตามความเป็นจริง\nเมื่อไม่รู้ไม่เห็นรูป\nตามความเป็นจริง\nเมื่อไม่รู้ไม่เห็นจักษุวิญญาณ\nตามความเป็นจริง\nเมื่อไม่รู้ไม่เห็นจักษุสัมผัส\nตามความเป็นจริง\nเมื่อไม่รู้ไม่เห็นความเสวยอารมณ์\nเป็นสุขก็ตาม\nเป็นทุกข์ก็ตาม\nมิใช่ทุกข์ มิใช่สุขก็ตาม\nที่เกิดขึ้นเพราะจักษุสัมผัส\nเป็นปัจจัยตามความเป็นจริง\nย่อมกำหนัดในจักษุ\nกำหนัดในรูป\nกำหนัดในจักษุวิญญาณ\nกำหนัดในจักษุสัมผัส\nกำหนัดในเสวยอารมณ์\nเป็นสุขก็ตามเป็นทุกข์ก็ตาม\nมิใช่ทุกข์มิใช่สุขก็ตาม\nที่เกิดขึ้นเพราะจักษุสัมผัสเป็นปัจจัย\nเมื่อบุคคลนั้นกำหนัดนักแล้ว\nประกอบพร้อมแล้ว\nลุ่มหลงเล็งเห็นคุณอยู่\nย่อมมีอุปทานขันธ์ 5\nถึงความพอกพูนต่อไป\nและเขาจะมีตัณหาที่นำไปสู่ภพใหม่\nร่วมกันด้วยความกำหนัด\nด้วยอำนาจความยินดี\nอันมีความเพลิดเพลิน\nในอารมณ์นั้นๆ เจริญทั่ว\nจะมีความกระวนกระวาย\nแม้ทางกายแม้ทางใจเจริญทั่ว\nมีความเดือดร้อน\nแม้ทางกายแม้ทางใจเจริญทั่ว\nมีความเร่าร้อน\nแม้ทางกายแม้ทางใจเจริญทั่ว\nเขาย่อมเสวยทุกข์ทางกายบ้างทุกข์ทางใจบ้าง',
        'ส่วนบุคคลเมื่อรู้เมื่อเห็นจักษุ\nตามความเป็นจริง\nเมื่อรู้เมื่อเห็นรูป\nตามความเป็นจริง\nเมื่อรู้เมื่อเห็นจักษุวิญญาณ\nตามความเป็นจริง\nเมื่อรู้เมื่อเห็นจักษุสัมผัส\nตามความเป็นจริง\nเมื่อรู้เมื่อเห็นความเสวยอารมณ์\nเป็นสุขก็ตามเป็นทุกข์ก็ตาม\nมิใช่ทุกข์ มิใช่สุขก็ตาม\nที่เกิดขึ้นเพราะจักษุสัมผัส\nเป็นปัจจัยตามความเป็นจริง\nย่อมไม่กำหนัดในจักษุ\nไม่กำหนัดในรูป\nไม่กำหนัดในจักษุวิญญาณ\nไม่กำหนัดในจักษุสัมผัส\nไม่กำหนัดในความเสวยอารมณ์\nเป็นสุขก็ตามเป็นทุกข์ก็ตาม\nมิใช่ทุกข์มิใช่สุขก็ตาม\nที่เกิดขึ้นเพราะจักษุสัมผัสเป็นปัจจัย\nเมื่อบุคคลนั้นไม่กำหนัดนักแล้ว\nไม่ประกอบพร้อมแล้ว\nไม่ลุ่มหลงเล็งเห็นโทษอยู่\nย่อมมีอุปทานขันธ์ 5 ไม่พอกพูนต่อไป\nและเขาละตัณหาที่นำไปสู่ภพใหม่\nร่วมกันด้วยความกำหนัด\nด้วยอำนาจความยินดี\nอันมีความเพลิดเพลินในอารมณ์นั้นๆได้\nจะละความกระวนกระวาย\nแม้ทางกายแม้ทางใจได้\nจะละความเดือดร้อน\nแม้ทางกายแม้ทางใจได้\nจะละความเร่าร้อน\nแม้ทางกายแม้ทางใจได้\nเขาย่อมเสวยสุขทางกายบ้างสุขทางใจบ้าง\nบุคคลผู้เป็นเช่นนั้นแล้ว\nมีความเห็นอันใด\nความเห็นอันนั้นย่อมเป็นสัมมาทิฏฐิ\nมีความดำริอันใด\nความดำริอันนั้นย่อมเป็นสัมมาสังกัปปะ\nมีความพยายามอันใด\nความพยายามอันนั้นย่อมเป็นสัมมาวายามะ\nมีความระลึกอันใด\nความระลึกอันนั้นย่อมเป็นสัมมาสติ\nมีความตั้งใจอันใด\nความตั้งใจอันนั้นย่อมเป็นสัมมาสมาธิ\nส่วนกายกรรม\nวจีกรรม\nอาชีวะของเขา\nย่อมบริสุทธิ์ดีในเบื้องต้น\nเที่ยงด้วยอาการอย่างนี้\nเขาชื่อว่าอัฏฐังคิกมรรค\nอันประเสริฐถึงความเจริญบริบูรณ์',
        'เมื่อบุคคลนั้นเจริญอัฏฐังคิกมรรคนี้อยู่อย่างนี้\nชื่อว่ามีสติปัฏฐาน 4\nสัมมัปปธาน 4\nอิทธิบาท 4\nอินทรีย์ 5\nพละ 5\nโพชฌงค์ 7\nถึงความเจริญบริบูรณ์\nบุคคลนั้นเมื่อมีธรรมทั้ง 2 ดังนี้\nคือสมถะและวิปัสสนาคู่เคียงกันเป็นไป\nเขาชื่อว่ากำหนดรู้ธรรม\nที่ควรกำหนดรู้ด้วยปัญญาอันยิ่ง\nละธรรมที่ควรละด้วยปัญญาอันยิ่ง\nเจริญธรรมที่ควรเจริญด้วยปัญญาอันยิ่ง\nทำให้แจ้งธรรมที่ควรทำให้แจ้งด้วยปัญญาอันยิ่ง',
        'กามคุณ 5\nกามคุณนี้มี 5 อย่างแล\n5 อย่างเป็นไฉน\nรูปที่เห็นด้วยจักษุ\nอันน่าปรารถนา น่าใคร่ น่าพอใจ\nเป็นที่รักประกอบด้วยกาม\nเป็นที่ตั้งแห่งความกำหนัด\nเสียงที่รู้ได้ด้วยโสต\nอันน่าปรารถนา น่าใคร่ น่าพอใจ\nเป็นที่รักประกอบด้วยกาม\nเป็นที่ตั้งแห่งความกำหนัด\nกลิ่นที่รู้ได้ด้วยฆานะ\nอันน่าปรารถนา น่าใคร่ น่าพอใจ\nเป็นที่รักประกอบด้วยกาม\nเป็นที่ตั้งแห่งความกำหนัด\nรสที่รู้ได้ด้วยชิวหา\nอันน่าปรารถนา น่าใคร่ น่าพอใจ\nเป็นที่รักประกอบด้วยกาม\nเป็นที่ตั้งแห่งความกำหนัด\nโผฏฐัพพะที่รู้ด้วยกาย\nอันน่าปรารถนา น่าใคร่ น่าพอใจ\nเป็นที่รักประกอบด้วยกาม\nเป็นที่ตั้งแห่งความกำหนัด นี้แลกามคุณ 5 อย่าง'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>กำหนดรู้ธรรมที่เนื่องด้วยอายตนะ 6</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0209;