import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0507 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'วิภังคสูตร\nว่าด้วยจำแนกปฏิจจสมุปบาท\nพระผู้มีพระภาคประทับอยู่ ณ พระเชตวัน\nอารามของท่านอนาถบิณฑิกเศรษฐี\nเขตพระนครสาวัตถี\nพระผู้มีพระภาคได้ตรัสว่า\nดูกรภิกษุทั้งหลาย\nเราจักแสดงจักจำแนก\nปฏิจจสมุปบาทแก่พวกเธอ\nพวกเธอจงฟังปฏิจจสมุปบาทนั้น\nจงใส่ใจให้ดีเถิดเราจักกล่าว\nภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคแล้ว',
        'พระผู้มีพระภาคได้ตรัสว่า\nดูกรภิกษุทั้งหลาย\nก็ปฏิจจสมุปบาทเป็นไฉน\nดูกรภิกษุทั้งหลาย\nเพราะอวิชชาเป็นปัจจัยจึงมีสังขาร\nเพราะสังขารเป็นปัจจัยจึงมีวิญญาณ\nเพราะวิญญาณเป็นปัจจัยจึงมีนามรูป\nเพราะนามรูปเป็นปัจจัยจึงมีสฬายตนะ\nเพราะสฬายตนะเป็นปัจจัยจึงมีผัสสะ\nเพราะผัสสะเป็นปัจจัยจึงมีเวทนา\nเพราะเวทนาเป็นปัจจัยจึงมีตัณหา\nเพราะตัณหาเป็นปัจจัยจึงมีอุปาทาน\nเพราะอุปาทานเป็นปัจจัยจึงมีภพ\nเพราะภพเป็นปัจจัยจึงมีชาติ\nเพราะชาติเป็นปัจจัยจึงมีชรา\nและมรณะโสกะปริเทวะ\nทุกข์โทมนัสและอุปายาส\nความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้\nย่อมมีด้วยประการอย่างนี้',
        'ดูกรภิกษุทั้งหลาย\nก็ชราและมรณะเป็นไฉน\nความแก่ ภาวะของความแก่\nฟันหลุด ผมหงอก หนังเป็นเกลียว\nความเสื่อมแห่งอายุ \nความแก่หง่อมแห่งอินทรีย์\nในหมู่สัตว์นั้นๆของเหล่าสัตว์นั้นๆ\nนี้เรียกว่าชรา\nก็มรณะเป็นไฉน\nความเคลื่อนภาวะของความเคลื่อน\nความทำลายความอันตรธานมฤตยู\nความตาย กาลกิริยา\nความแตกแห่งขันธ์\nความทอดทิ้งซากศพ\nความขาดแห่งชีวิตินทรีย์\nจากนั้นของเหล่าสัตว์นั้นๆ\nนี้เรียกว่ามรณะ\nชราและมรณะดังพรรณนามาฉะนี้\nเรียกว่าชราและมรณะ',
        'ก็ชาติเป็นไฉน\nความเกิดความบังเกิด\nความหยั่งลง\nเกิด\nเกิดจำเพาะ\nความปรากฏแห่งขันธ์\nความได้อายตนะครบในหมู่สัตว์นั้นๆ\nของเหล่าสัตว์นั้นๆ\nนี้เรียกว่าชาติ\nก็ภพเป็นไฉน\nภพ 3 เหล่านี้คือ\nกามภพ รูปภพ อรูปภพ\nนี้เรียกว่าภพ\nก็อุปาทานเป็นไฉน\nอุปาทาน 4 เหล่านี้\nคือกามุปาทาน\nทิฏฐุปาทาน\nสีลพัตตุปาทาน\nอัตตวาทุปาทาน\nนี้เรียกว่าอุปาทาน',
        'ก็ตัณหาเป็นไฉน\nตัณหา 6 หมวดเหล่านี้คือ\nรูปตัณหา สัททตัณหา\nคันธตัณหา รสตัณหา\nโผฏฐัพพะตัณหา ธัมมตัณหา\nนี้เรียกว่าตัณหา\nก็เวทนาเป็นไฉน\nเวทนา 6 หมวดเหล่านี้คือ\nจักขุสัมผัสสชาเวทนา\nโสตสัมผัสสชาเวทนา\nฆานสัมมผัสสชาเวทนา\nชิวหาสัมผัสสชาเวทนา\nกายสัมผัสสชาเวทนา\nมโนสัมผัสสชาเวทนา\nนี้เรียกว่าเวทนา\nก็ผัสสะเป็นไฉน\nผัสสะ 6 หมวดเหล่านี้คือ\nจักขุสัมผัส\nโสตะสัมผัส\nฆานสัมผัส\nชิวหาสัมผัส\nกายสัมผัส\nมโนสัมผัส\nนี้เรียกว่าผัสสะ',
        'ก็สฬายตนะเป็นไฉน\nสฬายตนะคือ\nตา หู จมูก\nลิ้น กาย ใจ\nนี้เรียกว่าสฬายตนะ\nก็นามรูปเป็นไฉน\nเวทนา สัญญา เจตนา\nผัสสะ มนสิการ\nนี้เรียกว่านาม\nมหาภูตรูป 4\nและรูปที่อาศัยมหาภูตรูป 4\nนี้เรียกว่ารูป\nนามและรูปดังพรรณนามาฉะนี้\nเรียกว่านามรูป\nก็วิญญาณเป็นไฉน\nวิญญาณ 6 หมวดเหล่านี้คือ\nจักขุวิญญาณ\nโสตะวิญญาณ\nฆานวิญญาณ\nชิวหาวิญญาณ\nกายวิญญาณ\nมโนวิญญาณ\nนี้เรียกว่าวิญญาณ',
        'ก็สังขารเป็นไฉน\nสังขาร 3 เหล่านี้คือ\nกายสังขาร\nวจีสังขาร\nจิตสังขาร\nนี้เรียกว่าสังขาร\nก็อวิชชาเป็นไฉน\nความไม่รู้ในทุกข์\nความไม่รู้ในเหตุเกิดแห่งทุกข์\nความไม่รู้ในความดับทุกข์\nความไม่รู้ในปฏิปทา\nที่จะให้ถึงความดับทุกข์\nนี้เรียกว่าอวิชา\nดูกรภิกษุทั้งหลาย\nเพราะอวิชชาเป็นปัจจัยจึงมีสังขาร\nเพราะสังขารเป็นปัจจัยจึงมีวิญญาณ\nดังพรรณนามาฉะนี้\nความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้\nย่อมมีด้วยประการอย่างนี้\nก็เพราะอวิชชานั่นแหละ\nดับด้วยการสำรอกโดยไม่เหลือ\nสังขารจึงดับ\nเพราะสังขารดับวิญญาณจึงดับ\nความดับแห่งกองทุกข์ทั้งมวลนี้\nย่อมมีด้วยประการอย่างนี้'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>วิภังคสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0507;