import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0503 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'มหาราหุโลวาทสูตร^500\nเรื่องพระราหุล^500\nข้าพเจ้าได้สดับมาอย่างนี้^500\nสมัยหนึ่งพระผู้มีพระภาค^500\nประทับอยู่ ณ พระวิหารเชตวัน^500\nอารามของท่านอนาถบิณฑิกเศรษฐี^500\nเขตพระนครสาวัตถี^500\nครั้งนั้นเวลาเช้า^500\nพระผู้มีพระภาค^500\nครองอันตรวาสก^500\nแล้วถือบาตรและจีวร^500\nเสด็จเข้าไปบิณฑบาต^500\nยังนครสาวัตถีเวลาเช้า^500\nแม้ท่านพระราหุล^500\nก็ครองอันตรวาสก^500\nแล้วถือบาตรและจีวร^500\nตามพระผู้มีพระภาคไป^500\nณ เบื้องพระปฤษฎางค์^500\nครั้งนั้นพระผู้มีพระภาค^500\nทรงผินพระพักตร์^500\nไปรับสั่งกะท่านพระราหุลว่า^500\nดูกรราหุล^500\nรูปอย่างใดอย่างหนึ่ง^500\nที่เป็นอดีตเป็นอนาคต^500\nและเป็นปัจจุบัน^500\nเป็นภายในก็ดีเป็นภายนอกก็ดี^500\nหยาบก็ดีละเอียดก็ดี^500\nเลวก็ดีประณีตก็ดี^500\nอยู่ในที่ไกลก็ดีอยู่ในที่ใกล้ก็ดี^500\nรูปทั้งปวงนี้เธอพึงเห็นด้วยปัญญา^500\nอันชอบตามเป็นจริงอย่างนี้ว่า^500\nนั่นไม่ใช่ของเรา^500\nเราไม่เป็นนั่น^500\nนั่นไม่ใช่ตัวตนของเราดังนี้^500\nพระราหุลทูลถามว่า^500\nข้าแต่พระผู้มีพระภาค^500\nรูปเท่านั้นหรือ^500\nข้าแต่พระสุคตรูปเท่านั้นหรือ^500\nพระพุทธเจ้าตรัสตอบว่า^500\nดูกรราหุลทั้งรูป ^500\nทั้งเวทนา ทั้งสัญญา^500\nทั้งสังขาร ทั้งวิญญาณ^500\nครั้งนั้นท่านพระราหุลคิดว่า^500\nวันนี้ใครหนออันพระผู้มีพระภาค^500\nทรงโอวาทด้วย^500\nโอวาทในที่เฉพาะพระพักตร์^500\nแล้วจักเข้าบ้านเพื่อบิณฑบาตเล่า^500\nดังนี้แล้วกลับจากที่นั้นแล้ว^500\nนั่งคู้บัลลังก์ตั้งกายตรง^500\nดำรงสติไว้เฉพาะหน้า^500\nณ โคนต้นไม้แห่งหนึ่ง^500\nท่านพระสารีบุตรได้เห็นท่านพระราหุล^500\nนั่งคู้บัลลังก์ตั้งกายตรง^500\nดำรงสติไว้เฉพาะหน้า^500\nณ โคนต้นไม้แห่งหนึ่ง^500\nแล้วบอกกะท่านพระราหุลว่า^500\nดูกรราหุล^500\nท่านจงเจริญอานาปานสติเถิด^500\nด้วยว่าอานาปานสติภาวนา^500\nที่บุคคลเจริญแล้วทำให้มากแล้ว^500\nย่อมมีผลมากมีอานิสงส์มาก^500\nดังนั้นเวลาเย็น^500\nท่านพระราหุลออกจากที่เร้น^500\nแล้วเข้าไปเฝ้าพระผู้มีพระภาค^500\nถึงที่ประทับถวายบังคมพระผู้มีพระภาค^500\nแล้วนั่งณที่ควรส่วนข้างหนึ่ง^500\nแล้วได้ทูลพระผู้มีพระภาคว่า^500\nข้าแต่พระองค์ผู้เจริญอานาปานสติ^500\nอันบุคคลเจริญแล้วอย่างไร^500\nทำให้มากแล้วอย่างไร^500\nจึงจะมีผลมีอานิสงส์',
        'ธาตุ 5 ^500\nดูกรราหุล^500\nรูปอย่างใดอย่างหนึ่ง^500\nเป็นภายในอาศัยตน^500\nเป็นของหยาบมีลักษณะแข้นแข็ง^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nคือ ผม ขน เล็บ ฟัน หนัง^500\nเนื้อ เอ็น กระดูก ^500\nเยื่อในกระดูก ม้าม หัวใจ^500\nตับ พังผืด ไต ปอด ไส้ใหญ่ ไส้น้อย^500\nอาหารใหม่ อาหารเก่า^500\nหรือสิ่งใดสิ่งหนึ่งอย่างอื่น^500\nเป็นภายในอาศัยตน^500\nเป็นของหยาบมีลักษณะแข้นแข็ง^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nนี้เราเรียกว่าปฐวีธาตุเป็นภายใน^500\nก็ปฐวีธาตุเป็นภายในก็ดี^500\nเป็นภายนอกก็ดี^500\nอันใดปฐวีธาตุนั้น^500\nเป็นปฐวีธาตุเหมือนกัน^500\nปฐวีธาตุนั้นเธอพึงเห็นด้วยปัญญา^500\nอันชอบตามเป็นจริงอย่างนี้ว่า^500\nนั่นไม่ใช่ของเรา^500\nเราไม่เป็นนั่น^500\nนั่นไม่ใช่ตนของเราดังนี้^500\nเพราะบุคคลเห็นปฐวีธาตุนั้น^500\nด้วยปัญญาอันชอบ^500\nตามเป็นจริงอย่างนี้แล้ว^500\nย่อมเบื่อหน่ายในปฐวีธาตุ^500\nจิตย่อมคลายกำหนัดในปฐวีธาตุ',
        'ดูกรราหุลก็อาโปธาตุเป็นไฉน^500\nอาโปธาตุเป็นภายในก็มี^500\nเป็นภายนอกก็มี^500\nก็อาโปธาตุที่เป็นภายในเป็นไฉน^500\nสิ่งใดเป็นภายในอาศัยตน^500\nเป็นอาโปมีลักษณะเอิบอาบ^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nคือ ดี เสลด หนอง เลือด เหงื่อ^500\nมันข้น น้ำตา เปลวมัน น้ำลาย^500\nน้ำมูก ไขข้อ มูตร^500\nหรือสิ่งใดสิ่งหนึ่งอย่างอื่น^500\nเป็นภายในอาศัยตน^500\nเป็นอาโปมีลักษณะเอิบอาบ^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nนี้เราเรียกว่าอาโปธาตุเป็นภายใน^500\nก็อาโปธาตุเป็นภายในก็ดี^500\nเป็นภายนอกก็ดี^500\nอันใดอาโปธาตุนั้น^500\nเป็นอาโปธาตุเหมือนกัน^500\nอาโปธาตุนั้นเธอพึงเห็นด้วยปัญญา^500\nอันชอบตามเป็นจริงอย่างนี้ว่า^500\nนั่นไม่ใช่ของเรา^500\nเราไม่เป็นนั่น^500\nนั่นไม่ใช่ตนของเราดังนี้^500\nเพราะบุคคลเห็นอาโปธาตุนั้น^500\nด้วยปัญญาอันชอบ^500\nตามเป็นจริงอย่างนี้แล้ว^500\nย่อมเบื่อหน่ายในอาโปธาตุ^500\nจิตย่อมคลายกำหนัดในอาโปธาตุ',
        'ดูกรราหุล^500\nก็เตโชธาตุเป็นไฉน^500\nเตโชธาตุเป็นภายในก็มี^500\nเป็นภายนอกก็มี^500\nก็เตโชธาตุที่เป็นภายในเป็นไฉน^500\nสิ่งใดเป็นภายในอาศัยตน^500\nเป็นเตโชมีลักษณะร้อน^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nคือไฟที่ยังกายให้อบอุ่น^500\nไฟที่ยังกายให้ทรุดโทรมไฟ^500\nที่ยังกายให้กระวนกระวาย^500\nและไฟที่เผาอาหาร^500\nที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม^500\nให้ย่อยไปโดยชอบ^500\nหรือสิ่งใดสิ่งหนึ่งอย่างอื่น^500\nเป็นภายในอาศัยตน^500\nเป็นเตโชมีลักษณะร้อน^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nนี้เราเรียกว่าเตโชธาตุเป็นภายใน^500\nก็เตโชธาตุเป็นภายในก็ดี^500\nเป็นภายนอกก็ดี^500\nอันใดเตโชธาตุนั้น^500\nเป็นเตโชธาตุเหมือนกัน^500\nเตโชธาตุนั้นเธอพึงเห็นด้วยปัญญา^500\nอันชอบตามเป็นจริงวันนี้ว่า^500\nนั่นไม่ใช่ของเรา^500\nเราไม่เป็นนั่น^500\nนั่นไม่ใช่ตัวตนของเราดังนี้^500\nเพราะบุคคล^500\nเห็นเตโชธาตุนั้นด้วยปัญญา^500\nอันชอบตามเป็นจริงอย่างนี้แล้ว^500\nย่อมเบื่อหน่ายในเตโชธาตุ^500\nจิตย่อมคลายกำหนัดในเตโชธาตุ',
        'ดูกรราหุล^500\nวาโยธาตุเป็นไฉน^500\nวาโยธาตุเป็นภายในก็มี^500\nเป็นภายนอกก็มี^500\nก็วาโยธาตุเป็นภายในเป็นไฉน^500\nสิ่งใดเป็นภายในอาศัยตน^500\nเป็นวาโยมีลักษณะพัดไปมา^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nคือลมพัดขึ้นเบื้องบนลมพัดลงเบื้องต่ำ^500\nลมในท้องลมในไส้^500\nลมแล่นไปตามอวัยวะน้อยใหญ่^500\nลมหายใจหรือสิ่งใดสิ่งหนึ่งอย่างอื่น^500\nเป็นภายในอาศัยตน^500\nเป็นวาโยพัดไปมา^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nนี้เราเรียกว่าวาโยธาตุเป็นภายใน^500\nก็วาโยธาตุเป็นภายในก็ดี^500\nเป็นภายนอกก็ดี^500\nอันใดวาโยธาตุนั้น^500\nเป็นวาโยธาตุเหมือนกัน^500\nวาโยธาตุนั้นเธอพึงเห็นด้วยปัญญา^500\nอันชอบตามเป็นจริงอย่างนี้ว่า^500\nนั่นไม่ใช่ของเรา^500\nเราไม่เป็นนั่น^500\nนั่นไม่ใช่ตนของเราดังนี้^500\nเพราะบุคคลเห็นวาโยธาตุนั้น^500\nด้วยปัญญาอันชอบ^500\nตามเป็นจริงอย่างนี้แล้ว^500\nย่อมเบื่อหน่ายในวาโยธาตุ^500\nจิตย่อมคลายกำหนัดในวาโยธาตุ',
        'ดูกรราหุล^500\nก็อากาศธาตุเป็นไฉน^500\nอากาศธาตุเป็นภายในก็มี^500\nเป็นภายนอกก็มี^500\nอากาศธาตุที่เป็นภายในเป็นไฉน^500\nสิ่งใดเป็นภายในอาศัยตน^500\nเป็นอากาศมีลักษณะว่าง^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nคือช่องหูช่องจมูกช่องปาก^500\nช่องคอสำหรับกลืนอาหาร^500\nที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม^500\nและช่องสำหรับถ่ายอาหาร^500\nที่กิน ที่ดื่ม ที่เคี้ยว ที่ลิ้ม ออกเบื้องล่าง^500\nหรือสิ่งใดสิ่งหนึ่งอย่างอื่น^500\nเป็นภายในอาศัยตน^500\nเป็นอากาศมีลักษณะว่างไม่ทึบ^500\nมีลักษณะไม่ทึบเป็นช่อง^500\nมีลักษณะเป็นช่อง^500\nอันเนื้อและเลือดไม่ถูกต้องเป็นภายใน^500\nอันกรรมและกิเลสเข้าไปยึดมั่น^500\nนี้เราเรียกว่าอากาศธาตุเป็นภายใน^500\nก็อากาศธาตุเป็นภายในก็ดี^500\nเป็นภายนอกก็ดี^500\nอันใดอากาศธาตุนั้น^500\nเป็นอากาศธาตุเหมือนกัน^500\nอากาศธาตุนั้นเธอพึงเห็นด้วยปัญญา^500\nอันชอบตามเป็นจริงอย่างนี้ว่า^500\nนั่นไม่ใช่ของเราเราไม่เป็นนั่น^500\nนั่นไม่ใช่ตนของเราดังนี้^500\nก็บุคคลเห็นอากาศธาตุนั้นด้วยปัญญา^500\nอันชอบตามเป็นจริงอย่างนี้แล้ว^500\nย่อมเบื่อหน่ายในอากาศธาตุ^500\nจิตย่อมคลายกำหนัดในอากาศธาตุ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i className="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>มหาราหุโลวาทสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0503;