import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0602 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ข้าพเจ้าได้สดับมาแล้วอย่างนี้\nสมัยหนึ่งพระผู้มีพระภาค\nประทับอยู่ ณ นิคมเทวทหะ\nของศากยะทั้งหลายในสักกชนบท\nครั้งนั้นแล\nภิกษุมากรูปด้วยกัน\nปรารถนาจะไปสู่ปัจฉาภูมชนบท\nเข้าไปเฝ้าพระผู้มีพระภาค\nถวายอภิวาทพระผู้มีพระภาคแล้ว\nนั่งอยู่ ณ ที่ควรส่วนข้างหนึ่งแล้ว\nได้กราบทูลพระผู้มีพระภาคว่า\nพระพุทธเจ้าข้า\nพวกข้าพระองค์ปรารถนา\nจะไปสู่ปัจฉาภูมชนบท\nเพื่อสำเร็จการอยู่อาศัย\nในปัจฉาภูมชนบท\nพระผู้มีพระภาคตรัสถามว่า\nดูกรภิกษุทั้งหลาย\nก็เธอทั้งหลายลาสารีบุตรแล้วหรือ?\nภิกษุเหล่านั้นกราบทูลว่า\nพระพุทธเจ้าข้า\nพวกข้าพระองค์\nยังมิได้ลาท่านพระสารีบุตร\nพระผู้มีพระภาคตรัสว่า\nดูกรภิกษุทั้งหลาย\nเธอทั้งหลายจงไปลาสารีบุตรเถิด\nสารีบุตรเป็นบัณฑิตอนุเคราะห์\nเพื่อนพรหมจารี\nภิกษุเหล่านั้นทูลรับ\nพระผู้มีพระภาคว่าอย่างนั้น\nพระพุทธเจ้าข้า\nก็สมัยนั้นแล\nท่านพระสารีบุตร\nนั่งอยู่ในมณฑปเล็กๆแห่งหนึ่ง\nที่มุงด้วยตะใคร่น้ำ\nไม่ไกลพระผู้มีพระภาค\nครั้งนั้นแล ภิกษุเหล่านั้น\nชื่นชมยินดีพระภาษิต\nของพระผู้มีพระภาค\nลุกจากอาสนะ ถวายอภิวาท\nทำประทักษิณพระผู้มีพระภาคแล้ว\nพากันเข้าไปหาท่านพระสารีบุตร\nกล่าวคำปราศรัย\nกับท่านพระสารีบุตร\nครั้นผ่านการปราศรัย\nพอให้ระลึกถึงกันไปแล้ว\nจึงนั่งอยู่ ณ ที่ควรส่วนข้างหนึ่งแล้ว\nได้กล่าวกะท่านพระสารีบุตรว่า\nข้าแต่ท่านพระสารีบุตร\nข้าพเจ้าทั้งหลาย\nปรารถนาจะไปปัจฉาภูมชนบท\nเพื่อสำเร็จการอยู่อาศัย\nในปัจฉาภูมชนบท\nท่านพระสารีบุตรกล่าวว่า\nท่านทั้งหลาย\nกราบทูลลาพระศาสดาแล้วหรือ?\nดูกรท่านผู้มีอายุทั้งหลาย\nก็กษัตริย์ผู้เป็นบัณฑิตบ้าง\nพราหมณ์ผู้เป็นบัณฑิตบ้าง\nคฤหบดีผู้เป็นบัณฑิตบ้าง\nสมณะผู้เป็นบัณฑิตบ้าง\nเป็นผู้ถามปัญหากะภิกษุ\nผู้ไปไพรัชชประเทศต่างๆมีอยู่\nดูกรท่านผู้มีอายุทั้งหลาย\nก็พวกมนุษย์ที่เป็นบัณฑิต\nทดลองถามว่า\nพระศาสดาของพวกท่าน\nมีวาทะอย่างไร?\nตรัสสอนอย่างไร?\nธรรมทั้งหลายพวกท่านฟังดีแล้ว\nเรียบร้อยดีแล้ว\nใส่ใจดีแล้ว\nทรงจำดีแล้ว\nแทงตลอดดีแล้ว\nด้วยปัญญาบ้างหรือ?\nท่านผู้มีอายุทั้งหลาย\nเมื่อพยากรณ์อย่างไร?\nจึงจะชื่อว่าเป็นผู้กล่าวตาม\nที่พระผู้มีพระภาคตรัสแล้ว\nจะไม่กล่าวตู่พระผู้มีพระภาค\nด้วยคำไม่จริง\nและพยากรณ์ธรรมสมควรแก่ธรรม\nทั้งการคล้อยตามวาทะ\nที่ถูกไรๆ จะไม่พึงถึงฐานะ\nอันวิญญูชนจะติเตียนได้\nภิ. ข้าแต่ท่านผู้มีอายุ\nข้าพเจ้าทั้งหลาย\nมาแม้แต่ที่ไกล\nเพื่อจะรู้เนื้อความแห่งภาษิต\nนั้นในสำนักท่านพระสารีบุตร\nดีละหนอ\nขอเนื้อความแห่งภาษิตนั้น\nจงแจ่มแจ้งกะท่านพระสารีบุตรเถิด\nส. ถ้าเช่นนั้น\nท่านทั้งหลายจงฟัง\nจงใส่ใจให้ดี\nเราจักกล่าว\nภิกษุเหล่านั้น\nรับคำท่านพระสารีบุตรแล้ว\nท่านพระสารีบุตรได้กล่าวว่า\nท่านผู้มีอายุทั้งหลาย\nก็กษัตริย์เป็นบัณฑิตบ้าง\nพราหมณ์เป็นบัณฑิตบ้าง\nคฤหบดีเป็นบัณฑิตบ้าง\nสมณะเป็นบัณฑิตบ้าง\nเป็นผู้ถามปัญหากะภิกษุ\nผู้ไปไพรัชชประเทศต่างๆ มีอยู่\nดูกรท่านผู้มีอายุทั้งหลาย\nก็มนุษย์ทั้งหลายที่เป็นบัณฑิต\nจะทดลองถามว่า\nพระศาสดาของท่านผู้มีอายุทั้งหลาย\nมีวาทะว่าอย่างไร\nตรัสสอนอย่างไร?\nดูกรท่านผู้มีอายุทั้งหลาย\nท่านทั้งหลายถูกถามอย่างนี้แล้ว\nพึงพยากรณ์อย่างนี้ว่า\nดูกรท่านผู้มีอายุทั้งหลาย\nพระศาสดาของเราทั้งหลาย\nตรัสสอนให้กำจัดฉันทราคะ\nเมื่อท่านทั้งหลาย\nพยากรณ์อย่างนี้แล้ว\nกษัตริย์ผู้เป็นบัณฑิตบ้าง\nพราหมณ์ผู้เป็นบัณฑิตบ้าง\nคฤหบดีผู้เป็นบัณฑิตบ้าง\nสมณะผู้เป็นบัณฑิตบ้าง\nพึงถามปัญหายิ่งขึ้นไป\nดูกรท่านผู้มีอายุทั้งหลาย\nก็มนุษย์ทั้งหลายที่เป็นบัณฑิต\nจะทดลองถามว่า\nก็พระศาสดาของท่านผู้มีอายุทั้งหลาย\nตรัสสอนให้กำจัดฉันทราคะ\nในสิ่งอะไร\nท่านทั้งหลายถูกถามอย่างนี้แล้ว\nพึงพยากรณ์อย่างนี้ว่า\nดูกรท่านผู้มีอายุทั้งหลาย\nพระศาสดาตรัสสอน\nให้กำจัดฉันทราคะใน\nรูป เวทนา สัญญา\nสังขาร วิญญาณ\nดูกรท่านผู้มีอายุทั้งหลาย\nเมื่อท่านทั้งหลาย\nพยากรณ์อย่างนี้แล้ว\nกษัตริย์ผู้เป็นบัณฑิตบ้าง\nพราหมณ์ผู้เป็นบัณฑิตบ้าง\nคฤหบดีผู้เป็นบัณฑิตบ้าง\nสมณะผู้เป็นบัณฑิตบ้าง\nพึงถามปัญหายิ่งขึ้นไป\nก็มนุษย์ทั้งหลายที่เป็นบัณฑิต\nจะทดลองถามว่า\nก็พระศาสดาของท่านผู้มีอายุทั้งหลาย\nทรงเห็นโทษอะไร\nจึงตรัสสอน\nให้กำจัดฉันทราคะใน\nรูป เวทนา สัญญา\nสังขาร วิญญาณ?\nดูกรท่านผู้มีอายุทั้งหลาย\nท่านทั้งหลายถูกถามอย่างนี้แล้ว\nพึงพยากรณ์อย่างนี้ว่า\nดูกรท่านผู้มีอายุทั้งหลาย\nเมื่อบุคคลมีความกำหนัด\nความพอใจ ความรัก\nความกระหาย\nความกระวนกระวาย\nความทะยานอยากใน\nรูป เวทนา สัญญา\nสังขาร และวิญญาณ\nยังไม่ปราศจากไปแล้ว\nโสกะ ปริเทวะ ทุกข์ โทมนัส\nและอุปายาสย่อมเกิดขึ้น\nเพราะรูป เวทนา สัญญา\nสังขารและวิญญาณ\nแปรปรวนเป็นอย่างอื่นไป\nดูกรท่านผู้มีอายุทั้งหลาย\nพระศาสดาของเราทั้งหลาย\nทรงเห็นโทษนี้แล\nจึงตรัสสอน\nให้กำจัดฉันทราคะใน\nรูป เวทนา สัญญา\nสังขาร และวิญญาณ\nดูกรท่านผู้มีอายุทั้งหลาย\nแม้เมื่อท่านทั้งหลาย\nพยากรณ์อย่างนี้แล\nกษัตริย์ผู้เป็นบัณฑิตบ้าง\nพราหมณ์ผู้เป็นบัณฑิตบ้าง\nคฤหบดีผู้เป็นบัณฑิตบ้าง\nสมณะผู้เป็นบัณฑิตบ้าง\nพึงถามปัญหายิ่งขึ้นไป\nดูกรท่านผู้มีอายุทั้งหลาย\nก็มนุษย์ทั้งหลาย\nที่เป็นบัณฑิตจะทดลองถามว่า\nก็พระศาสดา\nของท่านผู้มีอายุทั้งหลาย\nทรงเห็นอานิสงส์อะไร?\nจึงตรัสสอน\nให้กำจัดให้ฉันทราคะใน\nรูป เวทนา สัญญา\nสังขาร วิญญาณ\nท่านทั้งหลายถูกถามอย่างนี้แล้ว\nพึงพยากรณ์อย่างนี้ว่า\nดูกรท่านผู้มีอายุทั้งหลาย\nเมื่อบุคคลมีความกำหนัด\nความพอใจ ความรัก\nความกระหาย\nความกระวนกระวาย\nความทะยานอยากใน\nรูป เวทนา สัญญา\nสังขาร และวิญญาณ\nปราศจากไปแล้ว\nโสกะ ปริเทวะ ทุกข์ โทมนัส\nและอุปายาสย่อมไม่เกิดขึ้น\nเพราะรูป เวทนา สัญญา\nสังขารและวิญญาณ\nแปรปรวนเป็นอย่างอื่นไป\nดูกรท่านผู้มีอายุทั้งหลาย\nพระศาสดาของเราทั้งหลาย\nทรงเห็นอานิสงส์นี้แล\nจึงตรัสสอนให้กำจัดฉันทราคะ\nในรูป เวทนา สัญญา\nสังขาร และ วิญญาณ\nดูกรท่านผู้มีอายุทั้งหลาย\nก็เมื่อบุคคล\nเข้าถึงอกุศลธรรมทั้งหลายอยู่\nจักได้มีการอยู่สบาย\nไม่มีความลำบาก\nไม่มีความคับแค้น\nไม่มีความเดือดร้อน\nในปัจจุบันนี้\nและเมื่อตายไปแล้ว\nก็พึงหวังสุคติไซร้\nพระผู้มีพระภาค\nก็จะไม่พึงทรงสรรเสริญ\nการละอกุศลธรรมทั้งหลาย\nก็เพราะเมื่อบุคคล\nเข้าถึงอกุศลธรรมทั้งหลาย\nย่อมมีการอยู่เป็นทุกข์\nมีความลำบาก\nมีความคับแค้น\nมีความเดือดร้อนในปัจจุบัน\nและเมื่อตายไปแล้ว\nก็พึงหวังได้ทุคติ\nฉะนั้นพระผู้มีพระภาค\nจึงทรงสรรเสริญ\nการละอกุศลธรรมทั้งหลาย\nดูกรท่านผู้มีอายุทั้งหลาย\nแต่เมื่อบุคคล\nเข้าถึงกุศลธรรมทั้งหลายอยู่\nจักได้มีการอยู่เป็นทุกข์\nมีความลำบาก\nมีความคับแค้น\nมีความเดือดร้อน\nในปัจจุบันนี้\nและเมื่อตายไปแล้ว\nก็พึงหวังได้ทุคติไซร้\nพระผู้มีพระภาค\nก็จะไม่พึงทรงสรรเสริญ\nการเข้าถึงกุศลธรรมทั้งหลาย\nก็เพราะเมื่อบุคคล\nเข้าถึงกุศลธรรมทั้งหลายอยู่\nมีการอยู่สบาย\nไม่มีความลำบาก\nไม่มีความคับแค้น\nไม่มีความเดือดร้อน\nในปัจจุบันนี้\nและเมื่อตายไปแล้ว\nก็พึงหวังได้สุคติ\nฉะนั้นพระผู้มีพระภาค\nจึงทรงสรรเสริญ\nการเข้าถึงกุศลธรรมทั้งหลาย\nท่านพระสารีบุตร\nได้กล่าวคำนี้แล้ว\nภิกษุเหล่านั้น\nชื่นชมยินดีภาษิต\nของท่านพระสารีบุตรฉะนี้แล',
        'พระนครสาวัตถี\nณ ที่นั้นแล ฯลฯ\nดูกรภิกษุทั้งหลาย\nเราจักแสดงภาระ\nผู้แบกภาระ\nเครื่องถือมั่นภาระ\nและเครื่องวางภาระ\nแก่เธอทั้งหลาย\nเธอทั้งหลายจงฟัง \nจงใส่ใจให้ดี\nเราจักกล่าว\nภิกษุเหล่านั้น\nทูลรับสนองพระพุทธดำรัสแล้ว\nพระผู้มีพระภาคได้ตรัสว่า\nดูกรภิกษุทั้งหลาย\nก็ภาระเป็นไฉน?\nพึงกล่าวว่า\nภาระ คืออุปาทานขันธ์  ๕\nอุปาทานขันธ์ ๕ เป็นไฉน?\nคือ อุปาทานขันธ์ คือรูป\nอุปาทานขันธ์  คือเวทนา\nอุปาทานขันธ์ คือสัญญา\nอุปาทานขันธ์ คือสังขาร\nและอุปาทานขันธ์ คือวิญญาณ\nดูกรภิกษุทั้งหลาย นี้เรียกว่าภาระ.\nดูกรภิกษุทั้งหลาย\nก็ผู้แบกภาระเป็นไฉน?\nพึงกล่าวว่าบุคคล\nบุคคลนี้นั้น คือ\nท่านผู้มีชื่ออย่างนี้\nมีโคตรอย่างนี้\nดูกรภิกษุทั้งหลาย\nนี้เรียกว่าผู้แบกภาระ.\nดูกรภิกษุทั้งหลาย\nก็เครื่องถือมั่นภาระเป็นไฉน?\nตัณหานี้ใด นำให้เกิดภพใหม่\nประกอบด้วยความกำหนัด\nด้วยอำนาจความเพลิดเพลิน\nมีปกติเพลิดเพลินยิ่ง\nในภพหรืออารมณ์นั้นๆ\nได้แก่กามตัณหา\nภวตัณหา\nวิภวตัณหา\nดูกรภิกษุทั้งหลาย\nนี้เรียกว่าเครื่องถือมั่นภาระ\nดูกรภิกษุทั้งหลาย\nก็การวางภาระเป็นไฉน?\nความที่ตัณหานั่นแลดับไปด้วย\nสำรอกโดยไม่เหลือ\nความสละ\nความสละคืน\nความพ้น\nความไม่อาลัย\nดูกรภิกษุทั้งหลาย\nนี้เรียกว่าการวางภาระ\nพระผู้มีพระภาค\nผู้พระสุคตศาสดา\nครั้นได้ตรัสไวยากรณภาษิตนี้\nจบลงแล้ว\nจึงได้ตรัสคาถาประพันธ์\nต่อไปอีกในภายหลังว่า\nขันธ์ ๕ ชื่อว่าภาระแล\nและผู้แบกภาระคือบุคคล\nเครื่องถือมั่นภาระ\nเป็นเหตุนำมาซึ่งความทุกข์ในโลก\nการวางภาระเสียได้เป็นสุข\nบุคคลวางภาระหนักเสียได้แล้ว\nไม่ถือภาระอื่น\nถอนตัณหาพร้อม\nทั้งมูลรากแล้ว\nเป็นผู้หายหิวดับรอบแล้วดังนี้'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>เทวทหสูตร ภารสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0602;