import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0203 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ตาเห็นรูป รูปไม่เที่ยงเกิดดับ^500\nจักขุ ว่างเปล่าจากตนหรือจากของๆตน^500\nรูป ว่างเปล่าจากตนหรือจากของๆตน^500\nจักขุวิญญาณ^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nจักขุสัมผัส^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากจักขุสัมผัส^500\nเป็นปัจจัยก็ว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nดังนั้นโลกนี้จึงว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล^500\nที่จะไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ^500\nโสตะ ว่างเปล่าจากตนหรือจากของๆตน^500\nเสียง ว่างเปล่าจากตนหรือจากของๆตน^500\nโสตะวิญญาณ^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nโสตะสัมผัส^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากโสตะสัมผัส^500\nเป็นปัจจัยก็ว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nดังนั้นโลกนี้จึงว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล^500\nที่จะไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ^500\nฆานะ ว่างเปล่าจากตนหรือจากของๆตน^500\nกลิ่น ว่างเปล่าจากตนหรือจากของๆตน^500\nฆานะวิญญาณ^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nฆานะสัมผัส^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากฆานะสัมผัส^500\nเป็นปัจจัยก็ว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nดังนั้นโลกนี้จึงว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล^500\nที่จะไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ลิ้นได้รส รสไม่เที่ยงเกิดดับ^500\nชิวหา ว่างเปล่าจากตนหรือจากของๆตน^500\nรส ว่างเปล่าจากตนหรือจากของๆตน^500\nชิวหาวิญญาณ^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nชิวหาสัมผัส^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากชิวหาสัมผัส^500\nเป็นปัจจัยก็ว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nดังนั้นโลกนี้จึงว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล^500\nที่จะไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ^500\nกาย ว่างเปล่าจากตนหรือจากของๆตน^500\nสัมผัส ว่างเปล่าจากตนหรือจากของๆตน^500\nกายวิญญาณ^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nกายสัมผัส^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากกายสัมผัส^500\nเป็นปัจจัยก็ว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nดังนั้นโลกนี้จึงว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล^500\nที่จะไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ^500\nมโน ว่างเปล่าจากตนหรือจากของๆตน^500\nธรรมารมณ์ ว่างเปล่าจากตนหรือจากของๆตน^500\nมโนวิญญาณ^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nมโนสัมผัส^500\nว่างเปล่าจากตนหรือจากของๆตน^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากมโนสัมผัส^500\nเป็นปัจจัยก็ว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nดังนั้นโลกนี้จึงว่างเปล่า^500\nจากตนหรือจากของๆตน^500\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล^500\nที่จะไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>กำหนดรู้โลกและชีวิตกระทบสัมผัสว่างจากตนหรือของของตน</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0203;