import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0103 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ตาเห็นรูป^500\nรูปไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางตา^500\nเป็นเพียงแค่รูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nหูได้ยินเสียง^500\nเสียงไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางหู^500\nเป็นเพียงแค่เสียง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nจมูกได้กลิ่น^500\nกลิ่นไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางจมูก^500\nเป็นเพียงแค่กลิ่น^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nลิ่นได้รส^500\nรสไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางลิ้น^500\nเป็นเพียงแค่รส^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nกายสัมผัส^500\nสัมผัสไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางกาย^500\nเป็นเพียงแค่สัมผัส^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nใจคิดนึก^500\nความคิดไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางใจ^500\nเป็นเพียงแค่ความคิด^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\nจริงไหม—-จริง',
        'ตาเห็นรูป^500\nรูปไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางตา^500\nเป็นเพียงแค่รูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\n1…2…3…4…5…6…7…8…9…10^500\nหูได้ยินเสียง^500\nเสียงไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางหู^500\nเป็นเพียงแค่เสียง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\n1…2…3…4…5…6…7…8…9…10^500\nจมูกได้กลิ่น^500\nกลิ่นไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางจมูก^500\nเป็นเพียงแค่กลิ่น^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\n1…2…3…4…5…6…7…8…9…10^500\nลิ้นได้รส^500\nรสไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางลิ้น^500\nเป็นเพียงแค่รส^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\n1…2…3…4…5…6…7…8…9…10^500\nกายสัมผัส^500\nสัมผัสไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางกาย^500\nเป็นเพียงแค่สัมผัส^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\n1…2…3…4…5…6…7…8…9…10500\nใจคิดนึก^500\nความคิดไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสิ่งที่มาปรากฏทางใจ^500\nเป็นเพียงแค่ความคิด^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nตัวฉันเป็นเพียงรูป^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแต่สลาย^500\nไม่เที่ยงเกิดดับ^500\n1…2…3…4…5…6…7…8…9…10',
        'ตาเห็นรูป^500\nรูปไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nรูปเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่า^500\nสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'หูได้ยินเสียง^500\nเสียงไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nเสียงเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่า^500\nสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'จมูกได้กลิ่น ^500\nกลิ่นไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nกลิ่นเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่า^500\nสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'ลิ้นได้รส^500\nรสไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nรสเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่า^500\nสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'กายสัมผัส^500\nไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nสัมผัสเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่า^500\nสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'ใจคิดนึก^500\nไม่เที่ยงเกิดดับ^500\nตัวฉันไม่เที่ยงเกิดดับ^500\nความคิดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่า^500\nสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'รูป ร่างกาย^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่เที่ยงเกิดดับ^500\nเวทนา ความพอใจ ไม่พอใจ^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่เที่ยงเกิดดับ^500\nสัญญา ความจำ^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่เที่ยงเกิดดับ^500\nสังขาร ความคิด^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่เที่ยงเกิดดับ^500\nวิญญาณ ความรู้^500\nไม่เที่ยง เป็นทุกข์ เป็นอนัตตา^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่เที่ยงเกิดดับ',
        'รูป ร่างกาย^500\nอย่างใดอย่างหนึ่ง^500\nที่เป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่าสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'เวทนา ความพอใจไม่พอใจ^500\nอย่างใดอย่างหนึ่ง^500\nที่เป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่าสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'สัญญา ความจำ^500\nอย่างใดอย่างหนึ่ง^500\nที่เป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่าสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'สังขาร ความคิด^500\nอย่างใดอย่างหนึ่ง^500\nที่เป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่าสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'วิญญาณ ความรู้^500\nอย่างใดอย่างหนึ่ง^500\nที่เป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่าสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
        'อุปทานขันธ์ 5 เป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่าสิ่งนั้นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ',
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ฝึกเห็นตามจริง</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0103;