import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0504 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ภาวนาเสมอด้วยธาตุ 5\nดูกรราหุล\nเธอจงเจริญภาวนา\nเสมอด้วยแผ่นดินเถิด\nเพราะเมื่อเธอเจริญภาวนา\nเสมอด้วยแผ่นดินอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้\nดูกรราหุล\nเปรียบเหมือนคนทั้งหลาย\nทิ้งของสะอาดบ้างไม่สะอาดบ้าง\nคูถบ้าง มูตรบ้าง\nน้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง\nลงที่แผ่นดิน แผ่นดินจะอึดอัด\nหรือระอาหรือเกลียดของนั้นก็หาไม่ฉันใด\nเธอจงเจริญภาวนา\nเสมอด้วยแผ่นดินฉันนั้นแล\nเพราะเมื่อเธอเจริญภาวนา\nเสมอด้วยแผ่นดินอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'ดูกรราหุล\nเธอจงเจริญภาวนาเสมอด้วยน้ำเถิด\nเพราะเมื่อเธอเจริญภาวนา\nเสมอด้วยน้ำอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้\nดูกรราหุล\nเปรียบเหมือนคนทั้งหลาย\nล้างของสะอาดบ้างของไม่สะอาดบ้าง\nคูถบ้าง มูตรบ้าน\nน้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง\nลงในน้ำ น้ำจะอึดอัดหรือระอา\nหรือเกลียดของนั้นก็หาไม่ฉันใด\nเธอจงเจริญภาวนา\nเสมอด้วยน้ำฉันนั้นแล\nเพราะเมื่อเธอเจริญภาวนา\nเสมอด้วยน้ำอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'ดูกรราหุล\nเธอจงเจริญภาวนาเสมอด้วยไฟเถิด\nเพราะเมื่อเธอเจริญภาวนาเสมอด้วยไฟอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจะไม่ครอบงำจิตได้\nลูกรราหุล\nเปรียบเหมือนไฟ\nที่เผาของสะอาดบ้านของไม่สะอาดบ้าง\nคูถบ้าง มูตรบ้าง\nน้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง\nไฟจะอึดอัดหรือระอา\nหรือเกลียดของนั้นก็หาไม่ฉันใด\nเธอจงเจริญภาวนา\nเสมอด้วยไฟฉันนั้นแล\nเพราะเมื่อเธอเจริญภาวนา\nเสมอด้วยไฟอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'ดูกรราหุล\nเธอจงเจริญภาวนาเสมอด้วยลมเถิด\nเพราะเมื่อเธอเจริญภาวนาเสมอด้วยลมอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตของเธอได้\nดูกรราหุล\nเปรียบเหมือนลมย่อมพัดต้อง\nของสะอาดบ้างของไม่สะอาดบ้าง\nคูถบ้าง มูตรบ้าง\nน้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง\nลมจะอึดอัดหรือระอา\nหรือเกลียดของนั้นก็หาไม่ฉันใด\nเธอจงเจริญภาวนา\nเสมอด้วยลมฉันนั้น\nก็เมื่อเธอเจริญภาวนา\nเสมอด้วยลมอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'ดูกรราหุล\nเธอจงเจริญภาวนาเสมอด้วยอากาศเถิด\nเพราะเมื่อเธอเจริญภาวนา\nเสมอด้วยอากาศอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้\nดูกรราหุล\nเปรียบเหมือนอากาศ\nไม่ตั้งอยู่ในที่ไหนฉันใด\nเธอจงเจริญภาวนา\nเสมอด้วยอากาศฉันนั้นแล\nเพราะเมื่อเธอเจริญภาวนา\nเสมอด้วยอากาศอยู่\nผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ\nที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้',
        'การเจริญภาวนาธรรม 6 อย่าง\nดูกรราหุล\nเธอจงเจริญเมตตาภาวนาเถิด\nเพราะเมื่อเธอเจริญเมตตาภาวนาอยู่\nจักละพยาบาทได้\nเธอจงเจริญกรุณาภาวนาเถิด\nเพราะเมื่อเธอเจริญกรุณาภาวนาอยู่\nจักละวิหิงสาได้\nเธอจงเจริญมุทิตาภาวนาเถิด\nเพราะเมื่อเธอเจริญมุทิตาภาวนาอยู่\nจักละอรติได้\nเธอจงเจริญอุเบกขาภาวนาเถิด\nก็เมื่อเธอเจริญอุเบกขาภาวนาอยู่\nจักละปฏิฆะได้\nเธอจงเจริญอสุภภาวนาเถิด\nเพราะเมื่อเธอเจริญอสุภภาวนาอยู่\nจักละราคาได้\nเธอจงเจริญอนิจจสัญญาภาวนาเถิด\nเพราะเมื่อเธอเจริญอนิจจสัญญาภาวนาอยู่\nจักละอัสมิมานะได้'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ภาวนาเสมอด้วยธาตุ 5</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0504;