import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0308 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        '1. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ว่า\nจักษุเที่ยงหรือไม่เที่ยง\nพระอานนท์ตอบว่า\nไม่เที่ยงพระเจ้าข้า\n2. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์\nหรือเป็นสุขเล่า\nพระอานนท์ตอบว่า\nเป็นทุกข์พระเจ้าข้า\n3. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวน\nเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระอานนท์ตอบว่า\nไม่ควรเห็นอย่างนั้น\nพระเจ้าข้า\n4. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ว่า\nรูปเที่ยงหรือไม่เที่ยง\nพระอานนท์ตอบว่า\nไม่เที่ยงพระเจ้าข้า\n5. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์\nหรือเป็นสุขเล่า\nพระอานนท์ตอบว่า\nเป็นทุกข์พระเจ้าข้า\n6. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวน\nเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระอานนท์ตอบว่า\nไม่ควรเห็นอย่างนั้น\nพระเจ้าข้า\n7. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ว่า\nจักษุวิญญาณ\nจักษุสัมผัส\nสุขเวทนา\nทุกขเวทนา\nหรือไม่ทุกข์ไม่สุขเวทนา\nที่เกิดขึ้น\nเพราะจักษุสัมผัส\nเป็นปัจจัยเที่ยงหรือไม่เที่ยง\nพระอานนท์ตอบว่า\nไม่เที่ยงพระเจ้าข้า\n8. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า\nพระอานนท์ตอบว่า\nเป็นทุกข์พระเจ้าข้า\n9. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวน\nเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระอานนท์ตอบว่า\nไม่ควรเห็นอย่างนั้น\nพระเจ้าข้า\n10. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ว่า\nใจเที่ยงหรือไม่เที่ยง\nพระอานนท์ตอบว่า\nไม่เที่ยงพระเจ้าข้า\n11. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์\nหรือเป็นสุขเล่า\nพระอานนท์ตอบว่า\nเป็นทุกข์พระเจ้าข้า\n12. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวน\nเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระอานนท์ตอบว่า\nไม่ควรเห็นอย่างนั้น\nพระเจ้าข้า\n13. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ว่า\nธรรมารมณ์\nเที่ยงหรือไม่เที่ยง\nพระอานนท์ตอบว่า\nไม่เที่ยงพระเจ้าข้า\n14. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์\nหรือเป็นสุขเล่า\nพระอานนท์ตอบว่า\nเป็นทุกข์พระเจ้าข้า\n15. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวน\nเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระอานนท์ตอบว่า\nไม่ควรเห็นอย่างนั้น\nพระเจ้าข้า\n16. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ว่า\nมโนวิญญาณ\nมโนสัมผัส\nสุขเวทนา\nทุกขเวทนา\nหรือไม่ทุกข์ไม่สุขเวทนา\nที่เกิดขึ้น\nเพราะมโนสัมผัส\nเป็นปัจจัยเที่ยง\nหรือไม่เที่ยง\nพระอานนท์ตอบว่า\nไม่เที่ยงพระเจ้าข้า\n17. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์\nหรือเป็นสุขเล่า\nพระอานนท์ตอบว่า\nเป็นทุกข์พระเจ้าข้า\n18. พระพุทธเจ้า\nทรงตรัสถาม\nพระอานนท์ต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวน\nเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระอานนท์ตอบว่า\nไม่ควรเห็นอย่างนั้น\nพระเจ้าข้า',
        'อริยสาวก\nผู้ได้สดับแล้วเห็นอยู่อย่างนี้\nย่อมเบื่อหน่อยทั้งในจักษุ\nทั้งในรูป\nทั้งในจักษุวิญญาณ\nทั้งในจักษุสัมผัส\nทั้งในสุขเวทนาทุกขเวทนา\nหรือไม่ทุกข์ไม่สุขเวทนา\nที่เกิดขึ้น\nเพราะอาศัยจักษุสัมผัส\nเป็นปัจจัยตามความเป็นจริง\nเมื่อเบื่อหน่อยย่อมคลายกำหนัด\nเพราะคลายกำหนัดจึงหลุดพ้น\nเมื่อหลุดพ้นแล้ว\nย่อมมีญาณหยั่งรู้ว่าหลุดพ้นแล้ว\nรู้ชัดว่าชาติสิ้นแล้ว\nพรหมจรรย์อยู่จบแล้ว\nกิจที่ควรทำ ทำเสร็จแล้ว\nกิจอื่นเพื่อความเป็นอย่างนี้มิได้มีอีก'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ว่าด้วยทรงแสดงธรรมเพื่อความเป็นผู้อยู่ผู้เดียว</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0308;