import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0509 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ติมพรุกขสูตร\nว่าด้วยสุขและทุกข์\nพระผู้มีพระภาค\nประทับอยู่ ณ พระเชตวัน\nอารามของท่านอนาถบิณฑิกเศรษฐี\nเขตพระนครสาวัตถี\nครั้งนั้นแลปริพาชกชื่อว่าติมพรุกขะ\nเข้าไปเฝ้าพระผู้มีพระภาคถึงที่ประทับ\nครั้นแล้วได้ปราศรัยกับพระผู้มีพระภาค\nครั้นผ่านการปราศรัย\nพอให้ระลึกถึงกันไปแล้ว\nจึงนั่งณที่ควรส่วนข้างหนึ่ง\nครั้นแล้วติมพรุกขปริพาชก\nได้ทูลถามพระผู้มีพระภาคว่า\nติมพรุกขะทูลถามพระผู้มีพระภาคว่า\nข้าแต่ท่านพระโคดม\nสุขและพวกตนกระทำเองหรือ\nพระผู้มีพระภาคตรัสตอบว่า\nอย่ากล่าวอย่างนั้นติมพรุกขะ\nติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า\nสุขและทุกข์ผู้อื่นกระทำให้หรือท่านพระโคดม\nพระผู้มีพระภาคตรัสตอบว่า\nอย่ากล่าวอย่างนั้นติมพรุกขะ\nติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า\nสุขและทุกข์ตนกระทำเองด้วย\nผู้อื่นกระทำให้ด้วยหรือท่านพระโคดม\nพระผู้มีพระภาคตรัสตอบว่า\nอย่ากล่าวอย่างนั้นติมพรุกขะ\nติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า\nสุขและทุกข์บังเกิดขึ้น\nเพราะอาศัยการที่มิใช่ตนเองกระทำ\nมิใช่ผู้อื่นกระทำให้หรือท่านพระโคดม\nพระผู้มีพระภาคตรัสตอบว่า\nอย่ากล่าวอย่างนั้นติมพรุกขะ\nติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า\nสุขและทุกข์ไม่มีหรือท่านพระโคดม\nพระผู้มีพระภาคตรัสตอบว่า\nสุขและทุกข์ไม่มีหาไม่ได้\nสุขและทุกข์มีอยู่ติมพรุกขะ\nติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า\nถ้าอย่างนั้นท่านพระโคดม\nย่อมไม่รู้ไม่เห็นสุขและทุกข์\nพระผู้มีพระภาคตรัสตอบว่า\nเราย่อมไม่รู้ไม่เห็นสุขและทุกข์หาไม่ได้\nเรารู้เห็นสุขและทุกข์อยู่ติมพรุกขะ\nเมื่อข้าพเจ้าถามว่า\nข้าแต่ท่านพระโคดมสุขและทุกข์\nตนกระทำเองหรือ\nท่านตรัสว่าอย่ากล่าวอย่างนั้นติมพรุกขะ\nเมื่อข้าพเจ้าถามว่า\nสุขและทุกข์ผู้อื่นกระทำให้หรือ\nท่านพระโคดม\nท่านตรัสว่า\nอย่ากล่าวอย่างนั้นติมพรุกขะ\nเมื่อข้าพเจ้าถามว่า\nสุขและทุกข์ตนกระทำเองด้วย\nผู้อื่นกระทำให้ด้วยหรือท่านพระโคดม\nท่านตรัสว่าอย่ากล่าวอย่างนั้นติมพรุกขะ\nเมื่อข้าพเจ้าถามว่าสุขและทุกข์บังเกิดขึ้น\nเพราะอาศัยการที่ไม่ใช่ตนเองกระทำ\nไม่ใช่ผู้อื่นกระทำให้หรือท่านพระโคดม\nท่านตรัสว่าอย่ากล่าวอย่างนั้นติมพรุกขะ\nเมื่อข้าพเจ้าถามว่าสุขและทุกข์ไม่มีหรือ\nท่านตรัสว่าสุขและทุกข์ไม่มีหาไม่ได้\nสุขและทุกข์มีอยู่ติมพรุกขะ\nเมื่อข้าพเจ้าถามว่า\nถ้าอย่างนั้นท่านพระโคดม\nย่อมไม่รู้ไม่เห็นสุขและทุกข์\nท่านตรัสว่า\nเราย่อมไม่รู้ไม่เห็นสุขและทุกข์หาไม่ได้\nเราเห็นสุขและทุกข์อยู่ติมพรุกขะ\nท่านพระโคดมจงตรัสบอกสุขและทุกข์\nแก่ข้าพเจ้าขอท่านพระโคดม\nจงทรงแสดงสุขและทุกข์แก่ข้าพเจ้า',
        'พระผู้มีพระภาคตรัสว่า\nดูกรติมพรุกขะ\nเมื่อบุคคลถืออยู่ว่านั่นเวทนา\nนั่นผู้เสวยดังนี้\nแต่เราไม่กล่าวอย่างนี้ว่า\nสุขและทุกข์ตนกระทำเอง\nเมื่อบุคคลถูกเวทนาทิ่มแทงอยู่ว่า\nเวทนาอย่างหนึ่งผู้เสวยเป็นอีกคนหนึ่งดังนี้\nแต่เราไม่กล่าวอย่างนี้ว่า\nสุขและทุกข์ผู้อื่นกระทำให้\nดูกรติมพรุกขะตถาคตแสดงธรรม\nโดยสายกลาง\nไม่เข้าไปใกล้ส่วนสุดทั้งสองนั้นว่า\nเพราะอวิชชาเป็นปัจจัยจึงมีสังขาร\nเพราะสังขารเป็นปัจจัยจึงมีวิญญาณ\nความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้\nย่อมมีด้วยประการอย่างนี้\nเพราะอวิชชานั่นแหละดับ\nด้วยสำรอกโดยไม่เหลือ\nสังขารจึงดับ\nเพราะสังขารดับวิญญาณจึงดับ\nความดับแห่งกองทุกข์ทั้งมวลนี้\nย่อมมีด้วยประการอย่างนี้\nพระผู้มีพระภาคตรัสอย่างนี้แล้ว\nติมพรุกขะปริพาชก\nได้กราบทูลพระผู้มีพระภาคว่า\nข้าแต่ท่านพระโคดม\nภาษิตของพระองค์แจ่มแจ้งนัก\nข้าแต่ท่านพระโคดม\nภาษิตของพระองค์แจ่มแจ้งนัก\nพระผู้มีพระภาค\nทรงประกาศธรรมโดยอเนกปริยาย\nเปรียบเหมือนบุคคล\nหงายของที่คว่ำเปิดของที่ปิด\nบอกทางแก่คนหลงทาง\nหรือตามประทีปในที่มืด\nด้วยประสงค์ว่าผู้มีจักษุ\nจักเห็นรูปฉะนั้น\nข้าพระองค์ขอถึงท่านพระโคดม\nกับทั้งพระธรรมและพระภิกษุสงฆ์\nเป็นสรณะ\nขอท่านพระโคดม\nจงทรงจำข้าพระองค์\nว่าเป็นอุบาสกถึงผู้ถึงสรณะ\nจนตลอดชีวิตจำเดิมแต่วันนี้เป็นต้นไป'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ติมพรุกขสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0509;