import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0307 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ตาเห็นรูปการเคลื่อนไหวทางตา^500\nเกิดขึ้นแล้ว^500\nเพราะโลกและชีวิตกระทบสัมผัสกัน^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตนหรือจากของของตน',
        'หูได้ยินเสียงการเคลื่อนไหวทางหู^500\nเกิดขึ้นแล้ว^500\nเพราะโลกและชีวิตกระทบสัมผัสกัน^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตนหรือจากของของตน',
        'จมูกได้กลิ่นการเคลื่อนไหวทางจมูก^500\nเกิดขึ้นแล้ว^500\nเพราะโลกและชีวิตกระทบสัมผัสกัน^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตนหรือจากของของตน',
        'ลิ้นได้รสการเคลื่อนไหวทางลิ้น^500\nเกิดขึ้นแล้ว^500\nเพราะโลกและชีวิตกระทบสัมผัสกัน^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตน^500\nหรือจากของของตน',
        'กายสัมผัสการเคลื่อนไหวทางกาย^500\nเกิดขึ้นแล้ว^500\nเพราะโลกและชีวิตกระทบสัมผัสกัน^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตน^500\nหรือจากของของตน',
        'ใจคิดนึกการเคลื่อนไหวทางใจ^500\nเกิดขึ้นแล้ว^500\nเพราะโลกและชีวิตกระทบสัมผัสกัน^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่น^500\nว่านั่นเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตน^500\nหรือจากของของตน'      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ว่าด้วยความเป็นอนัตตาแห่งอายตนะภายนอก</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0307;