import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0510 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ปริวีมังสนสูตร^500\nว่าด้วยการพิจารณา^500\nเพื่อความสิ้นทุกข์โดยชอบ^500\nข้าพเจ้าสดับมาแล้วอย่างนี้^500\nสมัยหนึ่งพระผู้มีพระภาค^500\nประทับอยู่ ณ พระเชตวัน^500\nอารามของท่านอนาถบิณฑิกเศรษฐี^500\nเขตพระนครสาวัตถี^500\nณ ที่นั้นแลพระผู้มีพระภาค^500\nตรัสเรียกภิกษุทั้งหลายว่า^500\nดูกรภิกษุทั้งหลาย^500\nภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคว่า^500\nพระพุทธเจ้าข้า^500\nพระผู้มีพระภาคได้ตรัสว่า^500\nดูกรภิกษุทั้งหลายด้วยเหตุเท่าไรหนอแล^500\nภิกษุเมื่อพิจารณาพึงพิจารณา^500\nเพื่อความสิ้นทุกข์โดยชอบ^500\nโดยประการทั้งปวง^500\nภิกษุเหล่านั้นทูลว่าพระพุทธเจ้าข้า^500\nธรรมทั้งหลายของพวกข้าพระองค์^500\nมีพระผู้มีพระภาคเป็นที่ตั้ง^500\nมีพระผู้มีพระภาคเป็นผู้นำ^500\nมีพระผู้มีพระภาคเป็นที่พึ่ง^500\nได้โปรดเถิดพระพุทธเจ้าข้า^500\nขอเนื้อความแห่งภาษิตนี้จงแจ่มแจ้ง^500\nกะพระผู้มีพระภาคเถิด^500\nภิกษุทั้งหลายได้ฟัง^500\nต่อพระผู้มีพระภาคแล้ว^500\nจะทรงจำไว้^500\nพระผู้มีพระภาคตรัสว่า^500\nดูกรภิกษุทั้งหลายถ้าเช่นนั้น^500\nเธอทั้งหลายจงฟังจงใส่ใจให้ดี^500\nเราจักกล่าว^500\nภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคแล้ว^500\nพระผู้มีพระภาคได้ตรัสว่า^500\nดูกรภิกษุทั้งหลายภิกษุในธรรมวินัยนี้^500\nเมื่อพิจารณาย่อมพิจารณาว่า^500\nทุกข์คือชราและมรณะ^500\nมีประการต่างๆมากมายเกิดขึ้นในโลก^500\nทุกข์นี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นสมุทัย^500\nมีอะไรเป็นกรรม^500\nมีอะไรเป็นแดนเกิดหนอแล^500\nเมื่ออะไรมีชราและมรณะจึงมี^500\nเมื่ออะไรไม่มีชราและมรณะจึงไม่มี^500\nภิกษุนั้นพิจารณาอยู่ย่อมรู้ประจักษ์ว่า^500\nทุกข์คือชราและมรณะ^500\nมีประการต่างๆมากมายเกิดขึ้นในโลก^500\nทุกข์นี้แลมีชาติเป็นเหตุ^500\nมีชาติเป็นสมุทัย^500\nมีชาติเป็นกำเนิด^500\nมีชาติเป็นแดนเกิด^500\nเมื่อชาติมีชราและมรณะจึงมี^500\nเมื่อชาติไม่มีชราและมรณะจึงไม่มี^500\nภิกษุนั้นย่อมรู้ประจักษ์ชราและมรณะ^500\nย่อมรู้ประจักษ์เหตุเกิดชราและมรณะ^500\nย่อมรู้ประจักษ์ความดับแห่งชราและมรณะ^500\nย่อมรู้ประจักษ์ปฏิปทาอันสมควร^500\nที่ให้ถึงความดับแห่งชราและมรณะ^500\nและย่อมเป็นผู้ปฏิบัติอย่างนั้น^500\nเป็นผู้ประพฤติธรรมอันสมควร^500\nดูกรภิกษุทั้งหลาย^500\nภิกษุนี้เราเรียกว่า^500\nเป็นผู้ปฏิบัติเพื่อความสิ้นทุกข์โดยชอบ^500\nโดยประการทั้งปวง^500\nเพื่อความดับแห่งชราและมรณะ^500\nอีกประการหนึ่ง^500\nภิกษุเมื่อพิจารณาย่อมพิจารณาว่า^500\nก็ชาตินี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นสมุทัย^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด^500\nเมื่ออะไรมี ชาติจึงมี^500\nเมื่ออะไรไม่มี ชาติจึงไม่มี^500\nภิกษุนั้นพิจารณาอยู่ย่อมรู้ประจักษ์ว่า^500\nชาติมีภพเป็นเหตุ^500\nมีภพเป็นสมุทัย^500\nมีภพเป็นกำเนิด^500\nมีภพเป็นแดนเกิด^500\nเมื่อภพมีชาติจึงมี^500\nเมื่อภพไม่มีชาติจึงไม่มี^500\nภิกษุนั้นย่อมรู้ประจักษ์ชาติ^500\nย่อมรู้ประจักษ์เหตุเกิดแห่งชาติ^500\nย่อมรู้ประจักษ์ความดับแห่งชาติ^500\nย่อมรู้ประจักษ์ปฏิปทาอันสมควร^500\nที่ให้ถึงความดับแห่งชาติ^500\nและย่อมเป็นผู้ปฏิบัติอย่างนั้น^500\nเป็นผู้ประพฤติธรรมอันสมควร^500\nภิกษุนี้เราเรียกว่า^500\nเป็นผู้ปฏิบัติเพื่อความสิ้นทุกข์โดยชอบ^500\nโดยประการทั้งปวง^500\nเพื่อความดับแห่งชาติ',
        'อีกประการหนึ่งภิกษุเมื่อพิจารณา^500\nย่อมพิจารณาว่า^500\nก็ภพนี้มีอะไรเป็นเหตุ ฯลฯ^500\nก็อุปาทานนี้มีอะไรเป็นเหตุ ฯลฯ^500\nก็ตัณหานี้มีอะไรเป็นเหตุ ฯลฯ^500\nก็เวทนานี้มีอะไรเป็นเหตุ​ ฯลฯ^500\nก็ผัสสะนี้มีอะไรเป็นเหตุ ฯลฯ^500\nก็สฬายตนะนี้มีอะไรเป็นเหตุ ฯลฯ^500\nก็นามรูปนี้มีอะไรเป็นเหตุ ฯลฯ^500\nก็วิญญาณนี้มีอะไรเป็นเหตุ ฯลฯ^500\nก็สังขารนี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นสมุทัย^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด^500\nเมื่ออะไรมีสังขารจึงมี^500\nเมื่ออะไรไม่มีสังขารจึงไม่มี^500\nภิกษุนั้นเมื่อพิจารณาย่อมรู้ประจักษ์ว่า^500\nสังขารมีอวิชชาเป็นเหตุ^500\nมีอวิชชาเป็นสมุทัยมีอวิชชาเป็นกำเนิด^500\nมีอวิชชาเป็นแดนเกิด^500\nเมื่ออวิชามีสังขารจึงมี^500\nเมื่ออวิชชาไม่มีสังขารจึงไม่มี^500\nภิกษุนั้นย่อมรู้ประจักษ์สังขาร^500\nย่อมรู้ประจักษ์เหตุเกิดแห่งสังขาร^500\nย่อมรู้ประจักษ์ความดับแห่งสังขาร^500\nย่อมรู้ประจักษ์ปฏิปทาอันสมควร^500\nที่ให้ถึงความดับแห่งสังขาร^500\nและย่อมเป็นผู้ปฏิบัติอย่างนั้น^500\nเป็นผู้ประพฤติธรรมอันสมควร^500\nภิกษุนี้เราเรียกว่า^500\nเป็นผู้ปฏิบัติเพื่อความสิ้นทุกข์โดยชอบ^500\nโดยประการทั้งปวง^500\nเพื่อความดับแห่งสังขาร^500\nดูกรภิกษุทั้งหลาย^500\nบุคคลตกอยู่ในอวิชชา^500\nสังขารที่เป็นบุญปรุงแต่ง^500\nวิญญาณก็เข้าถึงบุญ^500\nถ้าสังขารที่เป็นบาปปรุงแต่ง^500\nวิญญาณก็เข้าถึงบาป^500\nถ้าสังขารที่เป็นอเนญชาปรุงแต่ง^500\nวิญญาณก็เข้าถึงอเนญชา^500\nดูกรภิกษุทั้งหลาย^500\nในกาลใดแลภิกษุละอวิชชาได้แล้ว^500\nวิชชาเกิดขึ้นแล้วในกาลนั้น^500\nภิกษุนั้นก็ไม่ทำกรรมเป็นบุญ^500\nไม่ทำกรรมเป็นบาป^500\nไม่ทำการเป็นอเนญชา^500\nเพราะสำรอกอวิชชาเสีย^500\nเพราะมีวิชชาเกิดขึ้น^500\nเมื่อไม่ทำเมื่อไม่คิด^500\nก็ไม่ถือมั่นอะไรๆในโลก^500\nเมื่อไม่ถือมั่นก็ไม่สะดุ้งกลัว^500\nเมื่อไม่สะดุ้งกลัวก็ปรินิพพาน^500\nย่อมรู้ชัดว่าชาติสิ้นแล้ว^500\nพรหมจรรย์อยู่จบแล้ว^500\nกิจที่ควรทำ ทำเสร็จแล้ว^500\nกิจอื่นเพื่อความเป็นอย่างนี้มิได้มี^500\nภิกษุนั้นถ้าเสวยสุขเวทนา^500\nก็รู้ชัดว่าสุขเวทนานั้นไม่เที่ยง^500\nอันตนไม่ยึดถือแล้วด้วยตัณหา^500\nอันตนไม่เพลิดเพลินแล้วด้วยตัณหา^500\nถ้าเสวยทุกขเวทนาก็รู้ชัดว่า^500\nทุกขเวทนานั้นไม่เที่ยง^500\nอันตนไม่ยึดถือแล้วด้วยตัณหา^500\nอันตนไม่เพลิดเพลินแล้วด้วยตัณหา^500\nถ้าเสวยไม่ทุกข์ไม่สุขเวทนา^500\nก็รู้ชัดว่าไม่ทุกข์ไม่สุขเวทนานั้นไม่เที่ยง^500\nอันตนไม่ยึดถือแล้วด้วยตัณหา^500\nอันตนไม่เพลิดเพลินแล้วด้วยตัณหา^500\nภิกษุนั้นถ้าเสวยสุขเวทนา^500\nก็วางใจเฉยเสวยไป^500\nถ้าเสวยทุกขเวทนา^500\nก็วางใจเฉยเสวยไป^500\nถ้าเสวยไม่ทุกข์ไม่สุขเวทนา^500\nก็วางใจเฉยเสวยไป^500\nภิกษุนั้นเมื่อเสวยเวทนา^500\nที่ปรากฏทางกาย^500\nก็รู้ชัดว่าเราเสวยเวทนา^500\nที่ปรากฏทางกาย^500\nเมื่อเสวยเวทนา^500\nที่ปรากฏทางชีวิต^500\nก็รู้ชัดว่าเราเสวยเวทนา^500\nที่ปรากฏทางชีวิต^500\nก็รู้ชัดว่าเวทนาทั้งปวง^500\nอันตัณหาไม่เพลิดเพลินแล้ว^500\nจักเป็นของเย็น^500\nสรีระธาตุจักเหลืออยู่ในโลกนี้เท่านั้น^500\nเบื้องหน้าตั้งแต่สิ้นชีวิต^500\nเพราะความแตกแห่งกาย',
        'ดูกรภิกษุทั้งหลาย^500\nบุรุษยกหม้อที่ยังร้อนออกจากเตาเผา^500\nเมื่อวางไว้ที่พื้นดินอันเรียบ^500\nไออุ่นที่หม้อนั้นพึงหายไป^500\nกระเบื้องหม้อยังเหลืออยู่ที่พื้นดินนั้นนั่นแหละ^500\nแม้ฉันใดภิกษุทั้งหลาย^500\nภิกษุเมื่อเสวยเวทนาที่ปรากฏทางกาย^500\nก็รู้ชัดว่าเราเสวยเวทนาที่ปรากฏทางกาย^500\nเมื่อเสวยเวทนาที่ปรากฏทางชีวิต^500\nก็รู้ชัดว่าเราเสวยเวทนาที่ปรากฏทางชีวิต^500\nก็รู้ชัดว่าเวทนาทั้งปวง^500\nอันตัณหาไม่เพลิดเพลินแล้ว^500\nจะเป็นของเย็น^500\nสรีระธาตุจักเหลืออยู่ในโลกนี้เท่านั้น^500\nเบื้องหน้าตั้งแต่สิ้นชีวิต^500\nเพราะความแตกแห่งกายฉันนั้นเหมือนกัน',
        'ดูกรภิกษุทั้งหลาย^500\nพวกเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายว่า^500\nภิกษุผู้ขีณาสพพึงทำกรรมเป็นบุญบ้าง^500\nทำกรรมเป็นบาปบ้าง^500\nทำกรรมเป็นเนญชาบ้างหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อสังขารไม่มี^500\nโดยประการทั้งปวง^500\nเพราะสังขารดับวิญญาณพึงปรากฎหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อวิญญาณไม่มี^500\nโดยประการทั้งปวง^500\nเพราะวิญญาณดับนามรูปพึงปรากฎหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อนามรูปไม่มี^500\nโดยประการทั้งปวง^500\nเพราะนามรูปดับสฬายตนะพึงปรากฎหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อสฬายตนะไม่มี^500\nโดยประการทั้งปวง^500\nเพราะสฬายตนะดับผัสสะพึงปรากฏหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อผัสสะไม่มี^500\nโดยประการทั้งปวง^500\nเพราะผัสสะดับเวทนาพึงปรากฏหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อเวทนาไม่มี^500\nโดยประการทั้งปวง^500\nเพราะเวทนาดับตัณหาพึงปรากฏหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อเวทนาไม่มี^500\nโดยประการทั้งปวง^500\nเพราะเวทนาดับตัณหาพึงปรากฏหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อตัณหาไม่มี^500\nโดยประการทั้งปวง^500\nเพราะตัณหาดับอุปาทานพึงปรากฏหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่ออุปาทานไม่มี^500\nโดยประการทั้งปวง^500\nเพราะอุปาทานดับภพพึงปรากฏหรือหนอ^500\nภิกษุทั้งหลายทูลตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อภพไม่มี^500\nโดยประการทั้งปวง^500\nเพราะภพดับชาติพึงปรากฏหรือหนอ^500\nภิกษุทั้งหลายควรตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nพระพุทธเจ้า^500\nทรงตรัสถามภิกษุทั้งหลายต่อไปว่า^500\nก็อีกอย่างหนึ่งเมื่อชาติไม่มี^500\nโดยประการทั้งปวง^500\nเพราะชาติดับชราและมรณะพึงปรากฏหรือหนอ^500\nภิกษุทั้งหลายควรตอบว่า^500\nไม่เป็นอย่างนั้นพระเจ้าข้า^500\nดีละๆภิกษุทั้งหลาย^500\nพวกเธอจงสำคัญ^500\nจงเชื่อซึ่งข้อนั้นไว้อย่างนั้นเถิด^500\nพวกเธอจงน้อมใจไปสู่ข้อนั้นอย่างนั้นเถิด^500\nจงหมดความเคลือบแคลงสงสัยในข้อนั้นเถิด^500\nนั่นเป็นที่สุดทุกข์'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ปริวีมังสนสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0510;