import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0210 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ตาเห็นรูปโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nตัวฉันโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน',
        'หูได้ยินเสียงโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nตัวฉันโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน',
        'จมูกได้กลิ่นโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nตัวฉันโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน',
        'ลิ้นได้รสโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nตัวฉันโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน',
        'กายสัมผัสโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nตัวฉันโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน',
        'ใจคิดนึกโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nตัวฉันโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตไม่ว่า^500\nเป็นอดีต อนาคต และปัจจุบัน^500\nภายในหรือภายนอก^500\nหยาบหรือละเอียด^500\nเลวหรือประณีต^500\nไกลหรือใกล้^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>พิจารณาขันธ์ 5 อินทรีย์ 6 (ยถาภูตญาณทัสสนะ + ดับไม่เหลือ)</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0210;