import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0301 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'พระพุทธเจ้าตรัสไว้ว่า^500\nจักษุเป็นของไม่เที่ยง^500\nสิ่งใดไม่เที่ยงสิ่งนั้นเป็นทุกข์^500\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา^500\nสิ่งนั้นท่านทั้งหลาย^500\nพึงเห็นด้วยปัญญา^500\nอันชอบตามความเป็นจริง^500\nอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตน^500\nหรือจากของๆตน',
        'หูเป็นของไม่เที่ยง^500\nสิ่งใดไม่เที่ยงสิ่งนั้นเป็นทุกข์^500\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา^500\nสิ่งนั้นท่านทั้งหลาย^500\nพึงเห็นด้วยปัญญา^500\nอันชอบตามความเป็นจริง^500\nอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตน^500\nหรือจากของๆตน',
        'จมูกเป็นของไม่เที่ยง^500\nสิ่งใดไม่เที่ยงสิ่งนั้นเป็นทุกข์^500\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา^500\nสิ่งนั้นท่านทั้งหลาย^500\nพึงเห็นด้วยปัญญา^500\nอันชอบตามความเป็นจริง^500\nอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตน^500\nหรือจากของๆตน',
        'ลิ้นเป็นของไม่เที่ยง^500\nสิ่งใดไม่เที่ยงสิ่งนั้นเป็นทุกข์^500\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา^500\nสิ่งนั้นท่านทั้งหลาย^500\nพึงเห็นด้วยปัญญา^500\nอันชอบตามความเป็นจริง^500\nอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตน^500\nหรือจากของๆตน',
        'กายเป็นของไม่เที่ยง^500\nสิ่งใดไม่เที่ยงสิ่งนั้นเป็นทุกข์^500\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา^500\nสิ่งนั้นท่านทั้งหลาย^500\nพึงเห็นด้วยปัญญา^500\nอันชอบตามความเป็นจริง^500\nอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตน^500\nหรือจากของๆตน',
        'ใจเป็นของไม่เที่ยง^500\nสิ่งใดไม่เที่ยงสิ่งนั้นเป็นทุกข์^500\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา^500\nสิ่งนั้นท่านทั้งหลาย^500\nพึงเห็นด้วยปัญญา^500\nอันชอบตามความเป็นจริง^500\nอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nว่างเปล่าจากตน^500\nหรือจากของๆตน',
        'อริยสาวก^500\nผู้ได้สดับแล้วเห็นอยู่อย่างนี้^500\nย่อมเบื่อหน่ายแม้ในจักษุ^500\nย่อมเบื่อหน่ายแม้ในหู^500\nย่อมเบื่อหน่ายแม้ในจมูก^500\nย่อมเบื่อหน่ายแม้ในลิ้น^500\nย่อมเบื่อหน่ายแม้ในกาย^500\nย่อมเบื่อหน่ายแม้ในใจ^500\nเมื่อเบื่อหน่ายย่อมคลายกำหนัด^500\nเพราะคลายกำหนัดย่อมหลุดพ้น^500\nเมื่อหลุดพ้นแล้ว^500\nย่อมมีญาณหยั่งรู้ว่าหลุดพ้นแล้ว^500\nรู้ชัดว่าชาติสิ้นแล้ว^500\nพรหมจรรย์อยู่จบแล้ว^500\nกิจที่ควรทำ ทำเสร็จแล้ว^500\nกิจอื่นเพื่อความเป็นอย่างนี้มิได้มี'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ว่าด้วยความเป็นอนิจจังแห่งอายตนะภายใน</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0301;