import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0312 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'พระพุทธเจ้าตรัสไว้\nว่าย่อมเป็นผู้มีสติอย่างไร\nย่อมเป็นผู้มีปกติ\nเห็นกายในกายอยู่\nมีความเพียรมีสัมปชัญญะมีสติ\nกำจัดอภิชฌา\nและโทมนัสในโลกเสีย\nย่อมเป็นผู้มีปกติ\nเห็นเวทนาในเวทนาอยู่\nมีความเพียรมีสัมปชัญญะมีสติ\nกำจัดอภิชฌา\nและโทมนัสในโลกเสีย\nย่อมเป็นผู้มีปกติ\nเห็นจิตในจิตอยู่\nมีความเพียร\nมีสัมปชัญญะมีสติ\nกำจัดอภิชฌา\nและโทมนัสในโลกเสีย\nย่อมเป็นผู้มีปกติเห็นธรรมในธรรม\nมีความเพียรมีสัมปชัญญะมีสติ\nกำจัดอภิชฌา\nและโทมนัสในโลกเสีย\nย่อมเป็นผู้มีสติอย่างนี้แล',
        'ย่อมเป็นผู้มีสัมปชัญญะอย่างไร\nย่อมเป็นผู้มีปกติทำความรู้สึกตัว\nในก้าวไปในการถอยกลับ\nย่อมเป็นผู้มีปกติทำความรู้สึกตัว\nในการแลในการเหลียว\nย่อมเป็นผู้มีปกติทำความรู้สึกตัว\nในการคู้เข้าเหยียดออก\nย่อมเป็นผู้มีปกติทำความรู้สึกตัว\nทรงผ้าสังฆาฏิบาตรและจีวร\nย่อมเป็นผู้มีปกติทำความรู้สึกตัว\nในการกิน ดื่ม เคี้ยว ลิ้ม\nย่อมเป็นผู้มีปกติทำความรู้สึกตัว\nในการถ่ายอุจจาระปัสสาวะ\nย่อมเป็นผู้มีปกติทำความรู้สึกตัว\nในการเดินในการ\nยืน นั่ง หลับ ตื่น พูด นิ่ง\nย่อมเป็นผู้มีสติสัมปชัญญะอย่างนี้แล',
        'ถ้าเมื่อนั้นมีสติสัมปชัญญะ\nเป็นผู้ไม่ประมาท\nมีความเพียรมีใจเด็ดเดี่ยว\nอยู่อย่างนี้\nสุขเวทนาย่อมบังเกิดขึ้น\nเธอย่อมรู้ชัดอย่างนี้\nว่าสุขเวทนานี้\nบังเกิดขึ้นแล้วแก่เราแล\nก็แต่ว่าสุขเวทนานั้น\nอาศัยจึงเกิดขึ้น\nไม่อาศัยไม่เกิดขึ้น\nอาศัยอะไรอาศัยกายนี้เอง\nก็กายนี้แลไม่เที่ยง\nอันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น\nก็สุขเวทนาอันอาศัยกายอันไม่เที่ยง\nปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น\nแล้วจึงบังเกิดขึ้นจะเที่ยงแต่ที่ไหน\nดังนี้เธอย่อมพิจารณา\nเห็นความไม่เที่ยง\nความเสื่อมไป\nความคลายไป\nความดับความสละคืน\nในกายและในสุขเวทนาอยู่\nเมื่อเธอพิจารณา\nเห็นความไม่เที่ยง\nความเสื่อมไป\nความคลายไป\nความดับความสละคืน\nในกายและในสุขเวทนาอยู่\nย่อมละราคานุสัยในกาย\nและในสุขเวทนาเสียได้',
        'ถ้าเมื่อนั้นมีสติสัมปชัญญะ\nเป็นผู้ไม่ประมาท\nมีความเพียร\nมีใจเด็ดเดี่ยวอยู่อย่างนี้\nทุกขเวทนาย่อมบังเกิดขึ้น\nเธอย่อมรู้ชัดอย่างนี้ว่า\nทุกขเวทนานี้\nบังเกิดขึ้นแล้วแก่เราแล\nก็แต่ว่าทุกขเวทนานั้น\nอาศัยจึงเกิดขึ้น\nไม่อาศัยไม่เกิดขึ้น\nอาศัยอะไรอาศัยกายนี้เอง\nก็กายนี้แลไม่เที่ยง\nอันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น\nก็ทุกขเวทนา\nอันอาศัยกายอันไม่เที่ยง\nปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น\nแล้วจึงบังเกิดขึ้นจะเที่ยงแต่ที่ไหน\nดังนี้เธอย่อมพิจารณา\nเห็นความไม่เที่ยง\nความเสื่อมไป\nความคลายไป\nความดับความสละคืนในกาย\nและในทุกขเวทนาอยู่\nเมื่อเธอพิจารณา\nเห็นความไม่เที่ยง\nความเสื่อมไป\nความคลายไป\nความดับความสละคืนในกาย\nและในทุกขเวทนาอยู่\nย่อมละปฏิฆานุสัยในกาย\nและในทุกขเวทนาเสียได้',
        'ถ้าเมื่อนั้นมีสติสัมปชัญญะเป็นผู้ไม่ประมาท\nมีความเพียรมีใจเด็ดเดี่ยวอยู่อย่างนี้\nไม่ทุกข์ไม่สุขเวทนา ย่อมบังเกิดขึ้น\nเธอย่อมรู้ชัดอย่างนี้ว่า\nไม่ทุกข์ไม่สุขเวทนานี้\nบังเกิดขึ้นแล้วแก่เราแล\nก็แต่ว่าไม่ทุกข์ไม่สุขเวทนา\nนั้นอาศัยจึงเกิดขึ้น\nไม่อาศัยไม่เกิดขึ้น\nอาศัยอะไรอาศัยกายนี้เอง\nก็กลายนี้แหละไม่เที่ยง\nอันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น\nอาศัยอะไรอาศัยกายนี้เอง\nก็กายนี้แลไม่เที่ยง\nอันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น\nก็ไม่ทุกข์ไม่สุขเวทนา\nอาศัยกายอันไม่เที่ยง\nปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น\nแล้วจึงบังเกิดขึ้นจักเที่ยงแต่ที่ไหน\nดังนี้เธอย่อมพิจารณา\nเห็นความไม่เที่ยง\nความเสื่อมไป\nความคลายไป\nความดับความสละคืน\nในกายและในไม่ทุกข์ไม่สุขเวทนาอยู่\nเมื่อเธอพิจารณาเห็นความไม่เที่ยง\nความเสื่อมไป\nความคลายไป\nความดับความสละคืน\nในกายและในไม่ทุกข์ไม่สุขเวทนาอยู่\nความดับ ความสละคืนในกาย\nและในไม่ทุกข์ไม่สุขเวทนาอยู่\nย่อมละอวิชชานุสัยในกาย\nและในไม่ทุกข์ไม่สุขเวทนาเสียได้',
        'ถ้าเมื่อนั้นเสวยสุขเวทนา\nก็รู้ชัดว่า\nสุขเวทนาไม่เที่ยง\nไม่น่าหมกมุ่น\nไม่น่าเพลิดเพลิน\nถ้าเสวยทุกขเวทนาก็รู้ชัดว่า\nทุกขเวทนาไม่เที่ยง\nไม่น่าหมกมุ่น\nไม่น่าเพลิดเพลิน\nถ้าเสวยไม่ทุกข์ไม่สุขเวทนา\nก็รู้ชัดว่า\nไม่ทุกข์ไม่สุขเวทนา\nไม่เที่ยงไม่น่าหมกมุ่น\nไม่น่าเพลิดเพลิน',
        'ถ้าเธอเสวยสุขเวทนา\nย่อมเป็นผู้ปราศจากกิเลส\nเสวยสุขเวทนานั้น\nถ้าเธอเสวยทุกขเวทนา\nย่อมเป็นผู้ปราศจากกิเลส\nเสวยทุกขเวทนานั้น\nถ้าเธอเสวยไม่ทุกข์ไม่สุขเวทนา\nย่อมเป็นผู้ปราศจากกิเลส\nเสวยไม่ทุกข์ไม่สุขเวทนานั้น\nเมื่อเสวยเวทนามีกายเป็นที่สุด\nก็รู้ชัดว่า\nเราเสวยเวทนามีกายเป็นที่สุด\nเมื่อเสวยเวทนามีชีวิตเป็นที่สุด\nก็รู้ชัดว่า\nเราเสวยเวทนามีชีวิตเป็นที่สุด\nย่อมรู้ชัดว่าเมื่อตายไป\nเวทนาทั้งปวงอัน\nไม่น่าเพลิดเพลิน\nจักเป็นความเย็นในโลกนี้ทีเดียว',
        'เปรียบเหมือนประทีปน้ำมัน\nอาศัยน้ำมัน\nและไส้จึงลูกโพลงอยู่ได้\nเพราะสิ้นน้ำมันและไส้ประทีปนั้น\nไม่มีเชื้อพึงดับไป\nฉันใดก็ฉันนั้นเหมือนกัน\nเมื่อเสวยเวทนามีกายเป็นที่สุด\nย่อมรู้ชัดว่า\nเราเสวยเวทนามีกายเป็นที่สุด\nเมื่อเสวยเวทนามีชีวิตเป็นที่สุด\nย่อมรู้ชัดว่า\nเราเสวยเวทนามีชีวิตเป็นที่สุด\nย่อมรู้ชัดว่าเมื่อตายไป\nเวทนาทั้งปวง\nอันไม่น่าเพลิดเพลิน\nจักเป็นความเย็นในโลกนี้ทีเดียว'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ว่าด้วยควรเป็นผู้มีสติสัมปชัญญะ</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0312;