import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0604 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'สมัยหนึ่ง\nท่านพระสารีบุตร^500\nอยู่ที่พระวิหารเชตวัน\nอารามของท่านอนาถบิณฑิกเศรษฐี^500\nใกล้พระนครสาวัตถี^500\nก็โดยสมัยนั้นแล\nยมกภิกษุเกิดทิฏฐิอันชั่วช้า^500\nเห็นปานนี้ว่า^500\nเราย่อมรู้ทั่วถึงธรรม\nตามที่พระผู้มีพระภาค\nทรงแสดงแล้วว่า^500\nพระขีณาสพเมื่อตายไปแล้ว\nย่อมขาดสูญ^500\nย่อมพินาศ^500\nย่อมไม่เกิดอีก^500\nภิกษุหลายรูป^500\nได้ฟังแล้วว่า^500\nได้ยินว่า\nยมกภิกษุเกิดทิฏฐิอันชั่วช้า\nเป็นปานนี้ว่า^500\nเรารู้ทั่วถึงธรรม^500\nตามที่พระผู้มีพระภาค^500\nทรงแสดงแล้วว่า^500\nพระขีณาสพเมื่อตายไปแล้ว^500\nย่อมขาดสูญ^500\nย่อมพินาศ^500\nย่อมไม่เกิดอีก^500\nครั้งนั้น ภิกษุเหล่านั้น^500\nจึงพากันเข้าไปหา\nท่านยมกภิกษุถึงที่อยู่^500\nได้สนทนาปราศรัย\nกับท่านยมกภิกษุ^500\nครั้นผ่านการสนทนาปราศรัย\nชวนให้ระลึกถึงกันไปแล้ว^500\nจึงนั่ง ณ ที่ควรส่วนข้างหนึ่ง^500\nครั้นแล้ว\nจึงถามท่านยมกภิกษุว่า^500\nดูกรท่านยมกะ\nทราบว่า ท่านเกิดทิฏฐิอันชั่วช้า\nเห็นปานนี้ว่า^500\nเรารู้ว่าทั่วถึงธรรม^500\nตามที่พระผู้มีพระภาค^500\nทรงแสดงแล้วว่า^500\nพระขีณาสพเมื่อตายไปแล้ว\nย่อมขาดสูญ^500\nย่อมพินาศ^500\nย่อมไม่เกิดอีกจริงหรือ?^500\nท่านยมกะกล่าวว่า\nอย่างนั้น อาวุโส^500\nภิ ดูกรอาวุโสยมกะ^500\nท่านอย่าได้พูดอย่างนั้น^500\nอย่าได้กล่าวตู่พระผู้มีพระภาค^500\nเพราะการกล่าวตู่พระผู้มีพระภาค\nไม่ดีเลย^500\nเพราะพระผู้มีพระภาค\nไม่พึงตรัสอย่างนี้ว่า^500\nพระขีณาสพเมื่อตายไปแล้ว\nย่อมขาดสูญ^500\nย่อมพินาศ^500\nย่อมไม่เกิดอีก^500\nท่านยมกะ^500\nเมื่อถูกภิกษุเหล่านั้น\nกล่าวแม้อย่างนี้^500\nยังขืนกล่าวถือทิฏฐิอันชั่วช้านั้น\nอย่างหนักแน่นอย่างนั้นว่า^500\nเรารู้ทั่วถึงธรรม\nตามที่พระผู้มีพระภาค^500\nทรงแสดงแล้วว่า^500\nพระขีณาสพเมื่อตายไปแล้ว\nย่อมขาดสูญ^500\nย่อมพินาศ^500\nย่อมไม่เกิดอีก^500\nภิกษุเหล่านั้น\nย่อมไม่อาจเพื่อจะยังท่านยมกะ^500\nให้ถอนทิฏฐิอันชั่วช้านั้นได้^500\nจึงลุกจากอาสนะ^500\nเข้าไปหาท่านพระสารีบุตร\nจนถึงที่อยู่',
        'ครั้นแล้ว\nจึงกล่าวกะท่านพระสารีบุตรว่า^500\nข้าแต่ท่านสารีบุตร^500\nยมกภิกษุเกิดทิฏฐิอันชั่วช้า\nเห็นปานนี้ว่า^500\nเรารู้ทั่วถึงธรรม\nตามที่พระผู้มีพระภาค\nทรงแสดงแล้วว่า^500\nพระขีณาสพเมื่อตายไปแล้ว\nย่อมขาดสูญ\nย่อมพินาศ\nย่อมไม่เกิดอีก^500\nขอโอกาสนิมนต์ท่านพระสารีบุตร\nไปหายมกภิกษุถึงที่อยู่^500\nเพื่ออนุเคราะห์เถิด^500\nท่านพระสารีบุตรรับนิมนต์\nโดยดุษณีภาพ^500\nครั้งนั้น เวลาเย็น\nท่านพระสารีบุตร^500\nออกจากที่พักผ่อนแล้ว^500\nเข้าไปหาท่านยมกะถึงที่อยู่^500\nได้สนทนาปราศรัยกับท่านยมกะ^500\nครั้นผ่านการสนทนาปราศรัย^500\nพอให้ระลึกถึงกันไปแล้ว^500\nจึงนั่ง ณ ที่ควรส่วนข้างหนึ่งแล้ว^500\nได้ถามท่านยมกะว่า^500\nดูกรอาวุโสยมกะ^500\nทราบว่า ท่านเกิดทิฏฐิอันชั่วช้า\nเห็นปานนี้ว่า^500\nเรารู้ทั่วถึงธรรม^500\nตามที่พระผู้มีพระภาค\nทรงแสดงแล้วว่า^500\nพระขีณาสพ\nเมื่อตายไปแล้ว\nย่อมขาดสูญ\nย่อมพินาศ\nย่อมไม่เกิดอีก^500\nดังนี้จริงหรือ?^500\nท่านยมกะตอบว่า\nอย่างนั้นแล ท่านสารีบุตร',
        'สา ดูกรท่านยมกะ^500\nท่านจะสำคัญความข้อนั้นเป็นไฉน^500\nรูปเที่ยงหรือไม่เที่ยง?^500\nย ไม่เที่ยง ท่าน ฯลฯ^500\nสา เวทนา สัญญา\nสังขาร วิญญาณ\nเที่ยงหรือไม่เที่ยง?^500\nย ไม่เที่ยง ท่าน ฯลฯ^500\nสา เพราะเหตุนี้นั้นแล ยมกะ^500\nพระอริยสาวกผู้ใดสดับแล้ว^500\nเห็นอยู่อย่างนี้ ฯลฯ^500\nรู้ชัดว่า ฯลฯ^500\nกิจอื่นเพื่อความเป็นอย่างนี้มิได้มีอีก^500\nสา ดูกรท่านยมกะ^500\nท่านจะสำคัญความข้อนั้นเป็นไฉน^500\nท่านเห็นรูปว่าเป็น\nสัตว์เป็นบุคคลหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นเวทนาว่า\nเป็นสัตว์เป็นบุคคลหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นสัญญาว่า\nเป็นสัตว์เป็นบุคคลหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นสังขารว่า\nเป็นสัตว์เป็นบุคคลหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นวิญญาณว่า\nเป็นสัตว์เป็นบุคคลหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ดูกรท่านยมกะ^500\nท่านจะสำคัญความข้อนั้นเป็นไฉน^500\nท่านเห็นว่าสัตว์บุคคล\nมีในรูปหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นว่า\nสัตว์บุคคลอื่นจากรูปหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นว่า\nสัตว์บุคคลมีในเวทนาหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นว่า\nสัตว์บุคคลอื่นจากเวทนาหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นว่า\nสัตว์บุคคลมีในสัญญาหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นว่า\nสัตว์บุคคลมีในสังขารหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นว่า\nสัตว์บุคคลอื่นจากสังขารหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นว่า\nสัตว์บุคคลมีในวิญญาณหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ท่านเห็นว่า\nสัตว์บุคคลอื่นจากวิญญาณหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ดูกรยมกะ^500\nท่านจะสำคัญ^500\nความข้อนั้นเป็นไฉน^500\nท่านเห็นรูป เวทนา\nสัญญา สังขาร วิญญาณ\nว่าเป็นสัตว์บุคคลหรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ดูกรท่านยมกะ^500\nท่านจะสำคัญ\nความข้อนั้นเป็นไฉน^500\nท่านเห็นว่า\nสัตว์บุคคลนี้นั้นไม่มีรูป\nไม่มีเวทนา\nไม่มีสัญญา\nไม่มีสังขาร\nไม่มีวิญญาณ หรือ?^500\nย ไม่ใช่อย่างนั้น ท่าน^500\nสา ดูกรท่านยมกะ^500\nก็โดยที่จริง โดยที่แท้^500\nท่านจะค้นหาสัตว์บุคคล\nในขันธ์ ๕ เหล่านี้\nในปัจจุบันไม่ได้เลย^500\nควรแลหรือที่ท่านจะยืนยันว่า\nเรารู้ทั่วถึงธรรม^500\nตามที่พระผู้มีพระภาค\nทรงแสดงแล้วว่า^500\nพระขีณาสพเมื่อตายไปแล้ว\nย่อมขาดสูญ\nย่อมพินาศ\nย่อมไม่เกิดอีก^500\nย ข้าแต่ท่านพระสารีบุตร^500\nเมื่อก่อนผมไม่รู้อย่างนี้\nจึงได้เกิดทิฏฐิอันชั่วช้าอย่างนั้น^500\nแต่เดี๋ยวนี้^500\nผมละทิฏฐิอันชั่วช้านั้นได้แล้ว^500\nและผมก็ได้บรรลุธรรมแล้ว^500\nเพราะฟังธรรมเทศนานี้^500\nของท่านพระสารีบุตร',
        'สา ดูกรท่านยมกะ^500\nถ้าชนทั้งหลาย\nพึงถามท่านอย่างนี้ว่า^500\nท่านยมกะภิกษุ^500\nผู้ที่เป็นพระอรหันตขีณาสพ^500\nเมื่อตายไปแล้ว\nย่อมเป็นอะไร^500\nท่านถูกถามอย่างนั้น^500\nจะพึงกล่าวแก้ว่าอย่างไร?^500\nย ข้าแต่ท่านสารีบุตร^500\nถ้าเขาถามอย่างนั้น^500\nผมพึงกล่าวแก้อย่างนี้ว่า^500\nรูปแลไม่เที่ยง^500\nสิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์^500\nสิ่งใดเป็นทุกข์\nสิ่งนั้นดับไปแล้ว^500\nถึงแล้วซึ่งการตั้งอยู่ไม่ได้^500\nเวทนา สัญญา\nสังขาร วิญญาณไม่เที่ยง^500\nสิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์^500\nสิ่งใดเป็นทุกข์\nสิ่งนั้นดับไปแล้ว^500\nถึงแล้วซึ่งการตั้งอยู่ไม่ได้^500\nข้าแต่ท่านสารีบุตร^500\nผมถูกเขาถามอย่างนั้น^500\nพึงกล่าวแก้อย่างนี้^500\nสา ดีละๆ ยมกะ^500\nถ้าอย่างนั้น\nเราจักอุปมาให้ท่านฟัง^500\nเพื่อหยั่งรู้ความข้อนั้นให้ยิ่งๆขึ้น',
        'ดูกรท่านยมกะ^500\nเปรียบเหมือนคฤหบดี^500\nหรือบุตรของคฤหบดีผู้มั่งคั่ง^500\nมีทรัพย์มาก มีโภคะมาก^500\nและเขารักษาตัวกวดขัน^500\nเกิดมีบุรุษคนหนึ่ง^500\nประสงค์ความพินาศ^500\nประสงค์ความไม่เป็นประโยชน์^500\nประสงค์ความไม่ปลอดภัย^500\nอยากจะปลงชีวิตเขาเสีย^500\nเขาพึงมีความคิดอย่างนี้ว่า^500\nคฤหบดีและบุตรคฤหบดีนี้^500\nเป็นคนมั่งคั่ง มีทรัพย์มาก\nมีโภคะมาก^500\nและเขามีการรักษาอย่างกวดขัน^500\nการที่จะอุกอาจปลงชีวิตนี้^500\nไม่ใช่เป็นการทำได้ง่ายเลย^500\nอย่ากระนั้นเลย^500\nเราพึงใช้อุบายปลงชีวิต\nบุรุษนั้น^500\nพึงเข้าไปหาคฤหบดี^500\nหรือบุตรคฤหบดีนั้นแล้ว^500\nพึงกล่าวอย่างนี้ว่า^500\nผมขอเป็นคนรับใช้ท่าน^500\nคฤหบดีหรือบุตรคฤหบดีนั้น^500\nพึงรับบุรุษนั้นไว้ใช้^500\nเขาพึงรับใช้เรียบร้อยดีทุกประการ^500\nคือ มีปรกติตื่นก่อน\nนอนภายหลัง^500\nคอยฟังคำสั่ง\nประพฤติให้เป็นที่พอใจ^500\nกล่าวแต่วาจาเป็นที่รักใคร่^500\nคฤหบดีหรือบุตรคฤหบดีนั้น\nเชื่อเขาโดยความเป็นมิตร\nโดยความเป็นสหาย^500\nและถึงความไว้วางใจในเขา^500\nเมื่อใด บุรุษนั้นพึงคิดว่า^500\nคฤหบดีหรือบุตรคฤหบดี\nไว้ใจเราดีแล้ว^500\nเมื่อนั้น บุรุษนั้นรู้ว่า^500\nคฤหบดีหรือบุตรคฤหบดีอยู่ในที่ลับ^500\nพึงปลงชีวิตเสียด้วยศาตราอันคม^500\nท่านยมกะ^500\nท่านจะสำคัญความข้อนั้นเป็นไฉน^500\nในกาลใด บุรุษนั้นเข้าไปหา\nคฤหบดีหรือบุตรคฤหบดีโน้นแล้ว^500\nกล่าวอย่างนี้ว่า^500\nผมขอรับใช้ท่านแม้ในกาลนั้น^500\nเขาก็ชื่อว่าเป็นผู้ฆ่าอยู่แล้ว^500\nก็แต่คฤหบดีหรือบุตรคฤหบดีนั้น^500\nหารู้จักบุรุษผู้ฆ่าว่า\nเป็นผู้ฆ่าเราไม่^500\nในกาลใด\nบุรุษนั้นตื่นก่อน\nนอนภายหลัง^500\nคอยฟังคำสั่ง\nประพฤติให้เป็นที่พอใจ^500\nกล่าวแต่วาจาเป็นที่รักใคร่^500\nแม้ในกาลนั้น^500\nเขาก็ชื่อว่าเป็นผู้ฆ่าอยู่แล้ว^500\nก็แต่คฤหบดีหรือบุตรคฤหบดีนั้น^500\nหารู้จักบุรุษผู้ฆ่านั้นว่า\nเป็นผู้ฆ่าเราไม่^500\nและในกาลใด^500\nบุรุษนั้นรู้ว่า^500\nคฤหบดีหรือบุตรคฤหบดี\nนั้นอยู่ในที่ลับ^500\nจึงปลงชีวิตเสีย\nด้วยศาตราอันคม^500\nแม้ในกาลนั้น\nเขาเป็นผู้ฆ่านั่นเอง^500\nก็แต่คฤหบดีหรือบุตรคฤหบดีนั้น^500\nหารู้จักบุรุษนั้นว่าเป็นผู้ฆ่าเราไม่^500\nย อย่างนั้น ท่าน',
        'สา ดูกรท่านยมกะ^500\nข้ออุปมานี้ฉันใด^500\nปุถุชนผู้มิได้สดับ\nไม่ได้เห็นพระอริยะทั้งหลาย^500\nไม่ฉลาดในอริยธรรม^500\nไม่ได้รับแนะนำในอริยธรรม^500\nไม่ได้เห็นสัตบุรุษทั้งหลาย^500\nไม่ฉลาดในสัปปุริสธรรม^500\nไม่ได้รับแนะนำ\nในสัปปุริสธรรม^500\nก็ฉันนั้นเหมือนกัน^500\nย่อมเห็นรูป โดยความเป็นตน\nย่อมเห็นตนมีรูป\nย่อมเห็นรูปในตน\nหรือย่อมเห็นตนในรูป^500\nย่อมเห็นเวทนา\nโดยความเป็นตน ฯลฯ^500\nย่อมเห็นสัญญา\nโดยความเป็นตน ฯลฯ^500\nย่อมเห็นสังขาร\nโดยความเป็นตน ฯลฯ^500\nย่อมเห็นวิญญาณ\nโดยความเป็นตน\nย่อมเห็นตนมีวิญญาณ\nย่อมเห็นวิญญาณในตน\nหรือย่อมเห็นตนในวิญญาณ^500\nเขาย่อมไม่รู้ชัด\nตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ^500\nอันไม่เที่ยงว่า ไม่เที่ยง^500\nย่อมไม่รู้ชัด\nตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ^500\nอันเป็นทุกข์ว่า เป็นทุกข์^500\nย่อมไม่รู้ชัด\nตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ^500\nอันเป็นอนัตตา\nว่าเป็นอนัตตา^500\nย่อมไม่รู้ชัด\nตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ^500\nอันปัจจัยปรุงแต่งว่า\nอันปัจจัยแต่ง^500\nย่อมไม่รู้ชัด\nตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ^500\nอันเป็นผู้ฆ่า ว่าเป็นผู้ฆ่า^500\nเขาย่อมเข้าไปถือมั่น\nยึดมั่น ซึ่งรูป เวทนา\nสัญญา สังขาร วิญญาณว่า\nเป็นตัวตนของเรา^500\nอุปาทานขันธ์ ๕ เหล่านี้^500\nอันปุถุชนนั้นเข้าไปถือมั่น\nยึดมั่นแล้ว^500\nย่อมเป็นไป\nเพื่อสิ่งมิใช่ประโยชน์เกื้อกูล^500\nเพื่อทุกข์ตลอดกาลนาน',
        'ดูกรท่านยมกะ^500\nส่วนพระอริยสาวกผู้สดับแล้ว^500\nได้เห็นพระอริยะทั้งหลาย^500\nฉลาดในอริยธรรม\nได้รับแนะนำ\nในอริยธรรมดีแล้ว^500\nได้เห็นสัตบุรุษทั้งหลาย^500\nฉลาดในสัปปุริสธรรม^500\nได้รับแนะนำ\nในสัปปุริสธรรมดีแล้ว ^500\nย่อมไม่เห็นรูป\nโดยความเป็นตน\nย่อมไม่เห็นตนมีรูป\nย่อมไม่เห็นรูปในตน\nหรือย่อมไม่เห็นตนในรูป^500\nย่อมไม่เห็นเวทนา\nโดยความเป็นตน ฯลฯ^500\nย่อมไม่เห็นสัญญา\nโดยความเป็นตน ฯลฯ^500\nย่อมไม่เห็นสังขาร\nโดยความเป็นตน ฯลฯ^500\nย่อมไม่เห็นวิญญาณ\nโดยความเป็นตน^500\nย่อมไม่เห็นตนมีวิญญาณ\nย่อมไม่เห็นวิญญาณในตน\nหรือย่อมไม่เห็นตนในวิญญาณ^500\nเขาย่อมรู้ชัดตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ^500\nอันไม่เที่ยงว่าไม่เที่ยง^500\nย่อมรู้ชัดตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ^500\nอันเป็นทุกข์ว่าเป็นทุกข์^500\nย่อมรู้ชัด\nตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ\nอันเป็นอนัตตาว่าเป็นอนัตตา^500\nย่อมรู้ชัด\nตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ\nอันปัจจัยปรุงแต่ง\nว่าปัจจัยปรุงแต่ง^500\nย่อมรู้ชัด\nตามความเป็นจริงซึ่ง\nรูป เวทนา สัญญา\nสังขาร วิญญาณ\nอันเป็นผู้ฆ่า ว่าเป็นผู้ฆ่า^500\nเขาย่อมไม่เข้าไปถือมั่น\nยึดมั่น ซึ่งรูป เวทนา\nสัญญา สังขาร\nวิญญาณว่า\nเป็นตัวตนของเรา^500\nอุปาทานขันธ์ ๕ เหล่านี้^500\nอันอริยสาวกนั้น\nไม่เข้าไปถือมั่น\nยึดมั่นแล้ว ย่อมเป็นไป^500\nเพื่อประโยชน์เกื้อกูล^500\nเพื่อสุขตลอดกาลนาน^500\nย ข้าแต่ท่านสารีบุตร^500\nข้อที่เพื่อนพรหมจรรย์ทั้งหลาย^500\nของท่านผู้มีอายุทั้งหลาย^500\nผู้เช่นนั้น เป็นผู้อนุเคราะห์^500\nใคร่ประโยชน์^500\nเป็นผู้ว่ากล่าวพร่ำสอน^500\nย่อมเป็นอย่างนั้นแท้^500\nก็แลจิตของผมหลุดพ้นแล้ว^500\nจากอาสวะทั้งหลาย\nไม่ถือมั่น^500\nเพราะได้ฟังธรรมเทศนานี้\nของท่านสารีบุตร'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i className="bi bi-x-lg" />
            </button>
            <a href="/lesson0605">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" />
              </button>
            </a>

            <h2 style={{display: 'inline-block'}}>ยมกสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0604;