import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0206 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'เท้าเดิน โลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าเท้าเดิน^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าโลกและชีวิต^500\nมีตัวตนเป็นของตนเอง^500\nเป็นความเห็นผิด^500\nความจริงเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nเพราะเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nความรู้สึกว่าสิ่งนี้มี^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nกำหนดรู้สุขถาวรเกิดขึ้นแล้ว^500\nเก็บสุขถาวรไว้ทันที',
        'เหลียวซ้าย โลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าเหลียวซ้าย^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าโลกและชีวิต^500\nมีตัวตนเป็นของตนเอง^500\nเป็นความเห็นผิด^500\nความจริงเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nเพราะเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nความรู้สึกว่าสิ่งนี้มี^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nกำหนดรู้สุขถาวรเกิดขึ้นแล้ว^500\nเก็บสุขถาวรไว้ทันที',
        'เหลียวขวา โลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าเหลียวขวา^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าโลกและชีวิต^500\nมีตัวตนเป็นของตนเอง^500\nเป็นความเห็นผิด^500\nความจริงเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nเพราะเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nความรู้สึกว่าสิ่งนี้มี^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nกำหนดรู้สุขถาวรเกิดขึ้นแล้ว^500\nเก็บสุขถาวรไว้ทันที',
        'เงยหน้า โลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าเงยหน้า^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าโลกและชีวิต^500\nมีตัวตนเป็นของตนเอง^500\nเป็นความเห็นผิด^500\nความจริงเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nเพราะเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nความรู้สึกว่าสิ่งนี้มี^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nกำหนดรู้สุขถาวรเกิดขึ้นแล้ว^500\nเก็บสุขถาวรไว้ทันที',
        'ก้มหน้า โลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าก้มหน้า^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าโลกและชีวิต^500\nมีตัวตนเป็นของตนเอง^500\nเป็นความเห็นผิด^500\nความจริงเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nเพราะเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nความรู้สึกว่าสิ่งนี้มี^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nกำหนดรู้สุขถาวรเกิดขึ้นแล้ว^500\nเก็บสุขถาวรไว้ทันที',
        'การเคลื่อนไหว คือโลกและชีวิต^500\nเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าการเคลื่อนไหว^500\nคือโลกและชีวิตมีตัวตนเป็นของตนเอง^500\nเป็นความเห็นผิด^500\nความจริงเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nเพราะเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nกำหนดรู้สุขถาวรเกิดขึ้นแล้ว^500\nเก็บสุขถาวรไว้ทันที',
        'รูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์^500\nคือโลกเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่า^500\nรูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์^500\nคือโลกมีตัวตนเป็นของตนเอง^500\nเป็นความเห็นผิด^500\nความจริงเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน',
        'ตา หู จมูก ลิ้่น กาย ใจ^500\nคือชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าตา หู จมูก ลิ้น กาย ใจ^500\nคือชีวิตมีตัวตนเป็นของตนเอง^500\nเป็นความเห็นผิด^500\nความจริงเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน',
        'โลกและชีวิตกระทบสัมผัส^500\nผลต่อเนื่องที่เกิดขึ้นเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ^500\nความรู้สึกว่าโลกและชีวิตกระทบสัมผัส^500\nผลต่อเนื่องที่เกิดขึ้นมีตัวตนเป็นของตนเอง^500\nเป็นความเห็นผิด^500\nความจริงเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nดับไม่เหลือเหมือนกัน^500\nกำหนดรู้สุขถาวรเกิดขึ้นแล้ว^500\nเก็บสุขถาวรไว้ทันที'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ฝึกตามทันกายกรรม</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0206;