import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0311 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ราหุลสูตร\nว่าด้วยสิ่งใดไม่เที่ยงสิ่งนั้นก็เป็นทุกข์\nสมัยหนึ่งพระผู้มีพระภาค\nประทับอยู่ ณ พระวิหารเชตวัน\nอารามของท่านอนาถบิณฑิกเศรษฐี\nใกล้พระนครสาวัตถี\nครั้งนั้นพระผู้มีพระภาค\nทรงหลีกเร้นอยู่ในที่สงัด\nทรงเกิดปริวิตก\nแห่งพระหฤทัยอย่างนี้ว่า\nธรรมที่เป็นเครื่องบ่มวิมุติ\nของราหุลแก่กล้าแล้ว\nถ้ากระไรเราควรแนะนำราหุล\nในธรรมเป็นที่สิ้นไป\nแห่งอาสวะยิ่งขึ้นไปเถิด\nครั้นทรงพระดำริฉะนี้แล้ว\nในเวลาเช้าพระผู้มีพระภาค\nทรงครองอันตรวาสก\nทรงถือบาตรและจีวร\nเสด็จเข้าไปบิณฑบาต\nยังพระนครสาวัตถี\nครั้นเวลาภายหลัง\nเสด็จกลับจากบิณฑบาตแล้ว\nตรัสเรียกท่านพระราหุลมาตรัสว่า\nราหุลเธอจงถือผ้านิสีทนะ\nไปสู่ป่าอันธวันด้วยกัน\nเพื่อพักผ่อนในเวลากลางวัน',
        'ท่านพระราหุลทูลรับพระดำรัส\nพระผู้มีพระภาค\nแล้วได้ถือผ้านิสีทนะ\nตามเสด็จพระผู้มีพระภาคไปข้างหลัง\nก็สมัยนั้นพวกเทวดาหลายพัน\nติดตามพระผู้มีพระภาคไปด้วยกัน\nคิดว่าวันนี้พระผู้มีพระภาค\nจักทรงแนะนำท่านพระราหุล\nในธรรมเป็นที่สิ้นอาสวะยิ่งขึ้นไป\nครั้งนั้นพระผู้มีพระภาค\nเสด็จเข้าไปสู่ป่าอันธวัน\nประทับ ณ พุทธอาสน์\nที่พระราหุลปูลาดถวาย\nที่ควงตันไม้แห่งหนึ่ง\nฝ่ายท่านพระราหุล\nถวายอภิวาทพระผู้มีพระภาคแล้ว\nนั่ง ณ ที่ควรส่วนข้างหนึ่ง',
        '1. พระพุทธเจ้า\nทรงตรัสถามพระราหุลว่า\nจักษุเที่ยงหรือไม่เที่ยง\nพระราหุลตอบว่า\nไม่เที่ยงพระเจ้าข้า\n2. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า\nพระราหุลตอบว่า\nเป็นทุกข์พระเจ้าข้า\n3. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวนเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระราหุลตอบว่า\nไม่ควรเห็นอย่างนั้นพระเจ้าข้า\n4. พระพุทธเจ้า\nทรงตรัสถามพระราหุลว่า\nรูปเที่ยงหรือไม่เที่ยง\nพระราหุลตอบว่า\nไม่เที่ยงพระเจ้าข้า\n5. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า\nพระราหุลตอบว่า\nเป็นทุกข์พระเจ้าข้า\n6. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวนเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระราหุลตอบว่า\nไม่ควรเห็นอย่างนั้นพระเจ้าข้า\n7. พระพุทธเจ้า\nทรงตรัสถามพระราหุลว่า\nจักษุวิญญาณ\nจักษุสัมผัส\nเวทนา สัญญา สังขาร วิญญาณ\nที่เกิดขึ้นเพราะจักษุสัมผัส\nเป็นปัจจัยเที่ยงหรือไม่เที่ยง\nพระราหุลตอบว่า\nไม่เที่ยงพระเจ้าข้า\n8. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า\nพระราหุลตอบว่า\nเป็นทุกข์พระเจ้าข้า\n9. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวนเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระราหุลตอบว่า\nไม่ควรเห็นอย่างนั้นพระเจ้าข้า\n10. พระพุทธเจ้า\nทรงตรัสถามพระราหุลว่า\nใจเที่ยงหรือไม่เที่ยง\nพระราหุลตอบว่า\nไม่เที่ยงพระเจ้าข้า\n11. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า\nพระราหุลตอบว่า\nเป็นทุกข์พระเจ้าข้า\n12. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวนเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระราหุลตอบว่า\nไม่ควรเห็นอย่างนั้นพระเจ้าข้า\n13. พระพุทธเจ้า\nทรงตรัสถามพระราหุลว่า\nธรรมารมณ์เที่ยงหรือไม่เที่ยง\nพระราหุลตอบว่า\nไม่เที่ยงพระเจ้าข้า\n14. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า\nพระราหุลตอบว่า\nเป็นทุกข์พระเจ้าข้า\n15. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวนเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระราหุลตอบว่า\nไม่ควรเห็นอย่างนั้นพระเจ้าข้า\n16. พระพุทธเจ้า\nทรงตรัสถามพระราหุลว่า\nมโนวิญญาณเที่ยงหรือไม่เที่ยง\nพระราหุลตอบว่า\nไม่เที่ยงพระเจ้าข้า\n17. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า\nพระราหุลตอบว่า\nเป็นทุกข์พระเจ้าข้า\n18. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวนเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระราหุลตอบว่า\nไม่ควรเห็นอย่างนั้นพระเจ้าข้า\n19. พระพุทธเจ้า\nทรงตรัสถามพระราหุลว่า\nมโนสัมผัสเที่ยงหรือไม่เที่ยง\nพระราหุลตอบว่า\nไม่เที่ยงพระเจ้าข้า\n20. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า\nพระราหุลตอบว่า\nเป็นทุกข์พระเจ้าข้า\n21. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวนเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระราหุลตอบว่า\nไม่ควรเห็นอย่างนั้นพระเจ้าข้า\n22. พระพุทธเจ้า\nทรงตรัสถามพระราหุลว่า\nเวทนา สัญญา สังขาร วิญญาณ\nที่เกิดขึ้นเพราะมโนสัมผัส\nเป็นปัจจัยเที่ยงหรือไม่เที่ยง\nพระราหุลตอบว่า\nไม่เที่ยงพระเจ้าข้า\n23. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า\nพระราหุลตอบว่า\nเป็นทุกข์พระเจ้าข้า\n24. พระพุทธเจ้า\nทรงตรัสถามพระราหุลต่อไปว่า\nก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวนเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nพระราหุลตอบว่า\nไม่ควรเห็นอย่างนั้นพระเจ้าข้า\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้\nย่อมเบื่อหน่ายทั้งในจักษุ\nทั้งในรูป\nทั้งในจักษุวิญญาณ\nทั้งในจักษุสัมผัส\nทั้งในเวทนา สัญญา สังขาร วิญญาณ\nที่เกิดขึ้นเพราะจักษุสัมผัสเป็นปัจจัย\nย่อมเบื่อหน่ายทั้งในใจ\nทั้งในธรรมารมณ์\nทั้งในมโนวิญญาณ\nทั้งในมโนสัมผัส\nทั้งในเวทนา สัญญา สังขาร วิญญาณ\nที่เกิดขึ้นเพราะมโนสัมผัสเป็นปัจจัย\nเมื่อเบื่อหน่ายย่อมคลายกำหนัด\nเพราะคลายกำหนัดจิตย่อมหลุดพ้น\nเมื่อจิตหลุดพ้นแล้ว\nย่อมมีญาณหยั่งรู้ว่าหลุดพ้นแล้ว\nรู้ชัดว่าชาติสิ้นแล้ว\nพรหมจรรย์อยู่จบแล้ว\nกิจที่ควรทำ ทำเสร็จแล้ว\nกิจอื่นเพื่อความเป็นอย่างนี้มิได้มี\nพระผู้มีพระภาคเจ้า\nตรัสพระสูตรนี้จบลงแล้ว\nท่านพระราหุลชื่นชมยินดี\nพระภาษิตของพระผู้มีพระภาคเจ้า\nอนึ่งเมื่อพระผู้มีพระภาคเจ้า\nตรัสไวยากรณ์ภาษิตนี้อยู่\nจิตของท่านพระราหุลหลุดพ้นแล้ว\nจากอาสวะไม่ถือมั่นด้วยอุปาทาน\nฝ่ายเทวดาหลานพัน\nก็เกิดธรรมจักษุ\nอันปราศจากธุลีปราศจากมลทิน\nว่าสิ่งใดสิ่งหนึ่ง\nมีความเกิดขึ้นเป็นธรรมดา\nสิ่งนั้นทั้งมวลล้วนมีความดับไปเป็นธรรมดา'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ราหุลสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0311;