import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0408 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'อาพาธสูตร^500\nว่าด้วยหายอาพาธ^500\nด้วยสัญญา 10 ประการ^500\nสมัยหนึ่งพระผู้มีพระภาค^500\nประทับอยู่ ณ พระวิหารเชตวัน^500\nอารามของท่านอนาถบิณฑิกเศรษฐี^500\nใกล้พระนครสาวัตถี^500\nก็สมัยนั้นแล^500\nท่านพระคิริมานนท์อาพาธ^500\nได้รับทุกข์เป็นไข้หนัก^500\nครั้งนั้นแลท่านพระอานนท์^500\nเข้าไปเฝ้าพระผู้มีพระภาค^500\nถึงที่ประทับ^500\nถวายบังคมพระผู้มีพระภาค^500\nแล้วนั่ง ณ ที่ควรส่วนข้างหนึ่ง^500\nครั้นแล้ว^500\nได้กราบทูลพระผู้มีพระภาคว่า^500\nข้าแต่พระองค์ผู้เจริญ^500\nท่านพระคิริมานนท์อาพาธ^500\nได้รับทุกข์เป็นไข้หนัก^500\nขอประทานพระวโรกาส^500\nขอพระผู้มีพระภาค^500\nได้โปรดอนุเคราะห์^500\nเสด็จเยี่ยมท่านพระคิริมานนท์^500\nยังที่อยู่เถิดพระเจ้าข้า^500\nพระผู้มีพระภาคตรัสว่า',
        'ดูกรอานนท์ถ้าเธอพึงเข้าไปหา^500\nแล้วกล่าวสัญญา 10 ประการ^500\nแก่คิริมานนท์ภิกษุไซร้^500\nข้อที่อาพาธของคิริมานนท์ภิกษุ^500\nจะพึงสงบระงับโดยพลัน^500\nเพราะได้ฟังสัญญา 10 ประการนั้น^500\nเป็นฐานะที่จะมีได้^500\nสัญญา 10 ประการเป็นไฉน^500\nคืออนิจจสัญญา 1^500\nอนัตตสัญญา 1^500\nอสุภสัญญา 1^500\nอาทีนวสัญญา 1^500\nปหานสัญญา 1^500\nวิราคสัญญา 1 ^500\nนิโรธสัญญา 1^500\nสัพพโลเกอนภิรตสัญญา 1^500\nสัพพสังขาเรสุอนิจจสัญญา 1^500\nอานาปานสติ 1',
        'ก็อนิจจสัญญาเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nอยู่ในป่าก็ดี^500\nอยู่ที่โคนไม้ก็ดี^500\nอยู่ในเรือนว่างเปล่าก็ดี^500\nย่อมพิจารณาเห็นดังนี้ว่า^500\nรูปไม่เที่ยง^500\nเวทนาไม่เที่ยง^500\nสัญญาไม่เที่ยง^500\nสังขารทั้งหลายไม่เที่ยง^500\nวิญญาณไม่เที่ยง^500\nย่อมพิจารณา^500\nเห็นโดยความเป็นของไม่เที่ยง^500\nในอุปาทานขันธ์ 5 เหล่านี้^500\nด้วยประการอย่างนี้^500\nดูกรอานนท์นี้เรียกว่าอนิจจสัญญา',
        'ดูกรอานนท์ก็อนัตตสัญญาเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nอยู่ในป่าก็ดี^500\nอยู่ที่โคนไม้ก็ดี^500\nอยู่ในเรือนว่างเปล่าก็ดี^500\nย่อมพิจารณาเห็นดังนี้ว่า^500\nจักษุเป็นอนัตตา^500\nรูปเป็นอนัตตา^500\nหูเป็นอนัตตา^500\nเสียงเป็นอนัตตา^500\nจมูกเป็นอนัตตา^500\nกลิ่นเป็นอนัตตา^500\nลิ้นเป็นอนัตตา^500\nรสเป็นอนัตตา^500\nกายเป็นอนัตตา^500\nโผฏฐัพพะเป็นอนัตตา^500\nใจเป็นอนัตตา^500\nธรรมารมณ์เป็นอนัตตา^500\nย่อมพิจารณาเห็นโดยความเป็นอนัตตา^500\nในอายตนะทั้งหลาย^500\nทั้งภายในและภายนอก ^500\n6 ประการเหล่านี้ด้วยประการอย่างนี้^500\nดูกรอานนท์นี้เรียกว่าอนัตตสัญญา',
        'ดูกรอานนท์ก็อสุภสัญญาเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nย่อมพิจารณาเห็นกายนี้นั่นแล^500\nเบื้องบนแต่พื้นเท้าขึ้นไป^500\nเบื้องต่ำแต่ปลายผมลงมา^500\nมีหนังหุ้มอยู่โดยรอบ^500\nเต็มด้วยของไม่สะอาด^500\nมีประการต่างๆว่า^500\nในกายนี้มีผม ขน เล็บ ฟัน หนัง^500\nเนื้อ เอ็น กระดูก เยื่อในกระดูก ^500\nม้าม เนื้อหัวใจ ตับ พังผืด^500\nไต ปอด ไส้ใหญ่ ไส้น้อย^500\nอาหารใหม่ อาหารเก่า^500\nดี เสลด หนอง เลือด เหงื่อ^500\nมันข้น น้ำตา เปลวมัน น้ำลาย^500\nน้ำมูก ไขข้อ มูตร^500\nย่อมพิจารณาเห็นโดย^500\nความเป็นของไม่งามในกายนี้^500\nด้วยประการดังนี้^500\nดูกรอานนท์นี้เรียกว่าอสุภสัญญา',
        'ดูกรอานนท์ก็อาทีนวสัญญาเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nอยู่ในป่าก็ดีอยู่ที่โคนไม้ก็ดี^500\nอยู่ในเรือนว่างเปล่าก็ดี^500\nย่อมพิจารณาเห็นดังนี้ว่า^500\nกายนี้มีทุกข์มาก มีโทษมาก^500\nเพราะฉะนั้นอาพาธต่างๆ^500\nจึงเกิดขึ้นในกายนี้^500\nคือโรคตา โรคหู โรคจมูก^500\nโรคลิ้น โรคกาย โรคศีรษะ^500\nโรคที่ใบหู โรคปาก โรคฟัน^500\nโรคไต โรคหืด โรคไข้หวัด^500\nโรคไข้พิษ โรคไข้เซื่องซึม โรคในท้อง^500\nโรคลมสลบ โลกบิด โรคจุกเสียด^500\nโลกลงราก โลกเรื้อน โลกฝี^500\nโรคมองคล่อ โรคลมบ้าหมู^500\nโรคหิดเปื่อย โรคหิดด้าน^500\nโรคคุดทะราด โรคละอองบวม^500\nโรคอาเจียนโลหิต โรคดีเดือด^500\nโรคเบาหวาน โรคเริม^500\nโรคพุพอง โรคริดสีดวง^500\nอาพาธมีดีเป็นสมุฏฐาน^500\nอาพาธมีเสมหะเป็นสมุฏฐาน^500\nอาพาธมีลมเป็นสมุฏฐาน^500\nอาพาธมีไข้สันนิบาต^500\nอาพาธอันเกิดแต่ฤดูแปรปรวน^500\nอาพาธอันเกิดแต่การบริหารไม่สม่ำเสมอ^500\nอาพาธอันเกิดแต่ความเพียรเกินกำลัง^500\nอาพาธอันเกิดแต่วิบากของกรรม^500\nความหนาว ความร้อน^500\nความหิว ความกระหาย^500\nปวดอุจจาระ ปวดปัสสาวะ^500\nย่อมพิจารณาเห็นโดยความเป็นโทษ^500\nในกายนี้ด้วยประการดังนี้^500\nดูกรอานนท์นี้เรียกว่าอาทีนวสัญญา',
        'ดูกรอานนท์ก็ปหานสัญญาเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nย่อมไม่ยินดี ย่อมละ ย่อมบรรเทา^500\nย่อมทำให้หมดสิ้นไป ^500\nย่อมทำให้ถึงความไม่มี^500\nซึ่งพยาบาทวิตกอันเกิดขึ้นแล้ว^500\nย่อมไม่ยินดี ย่อมละ ย่อมบรรเทา^500\nย่อมทำให้หมดสิ้นไป^500\nย่อมทำให้ถึงความไม่มี^500\nซึ่งพยาบาทวิตกอันเกิดขึ้นแล้ว^500\nย่อมไม่ยินดี ย่อมละ ย่อมบรรเทา^500\nย่อมทำให้หมดสิ้นไป^500\nย่อมทำให้ถึงความไม่มี^500\nซึ่งวิหิงสาวิตกอันเกิดขึ้นแล้ว^500\nย่อมไม่ยินดี ย่อมละ ย่อมบรรเทา^500\nย่อมทำให้หมดสิ้นไป^500\nย่อมทำให้ถึงความไม่มี^500\nซึ่งอกุศลธรรมทั้งหลาย^500\nอันชั่วช้าอันเกิดขึ้นแล้วเกิดขึ้นแล้ว^500\nดูกรอานนท์นี้เรียกว่าปหานสัญญา',
        'ดูกรอานนท์ก็วิราคสัญญาเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nอยู่ในป่าก็ดีอยู่ที่โคนไม้ก็ดี^500\nอยู่ในเรือนว่างเปล่าก็ดี^500\nย่อมพิจารณาเห็นดังนี้ว่า^500\nธรรมชาตินั่นสงบ^500\nธรรมชาตินั่นประณีต^500\nคือธรรมเป็นที่ระงับสังขารทั้งปวง^500\nธรรมเป็นที่สละคืนอุปธิทั้งปวง^500\nธรรมเป็นที่สิ้นไปแห่งตัณหา^500\nธรรมเป็นที่สำรอกกิเลส^500\nธรรมชาติเป็นที่ดับกิเลสและกองทุกข์^500\nดูกรอานนท์นี้เรียกว่าริราคสัญญา',
        'ดูกรอานนท์นิโรธสัญญาเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nอยู่ในป่าก็ดี^500\nอยู่ที่โคนไม้ก็ดี^500\nอยู่ในเรือนว่างเปล่าก็ดี^500\nย่อมพิจารณาเห็นดังนี้ว่า^500\nธรรมชาตินั่นสงบ^500\nธรรมชาตินั่นประณีต^500\nคือธรรมเป็นที่ระงับสังขารทั้งปวง^500\nธรรมเป็นที่สละคืนอุปธิทั้งปวง^500\nธรรมเป็นที่สิ้นไปแห่งตัณหา^500\nธรรมเป็นที่ดับโดยไม่เหลือ^500\nธรรมชาติเป็นที่ดับกิเลสและกองทุกข์^500\nดูกรอานนท์นี้เรียกว่านิโรธสัญญา',
        'ดูกรอานนท์^500\nสัพพโลเกอนภิรตสัญญาเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nละอุบายและอุปาทานในโลก^500\nอันเป็นเหตุตั้งมั่นถือมั่น^500\nและเป็นอนุสัยแห่งจิต^500\nย่อมงดเว้น ไม่ถือมั่น^500\nดูกรอานนท์นี้เรียกว่า^500\nสัพพโลเกอนภิรตสัญญา',
        'ดูกรอานนท์^500\nสัพพสังขาเรสุอนิจจสัญญาเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nย่อมอึดอัด ย่อมระอา^500\nย่อมเกลียดชังแต่สังขารทั้งปวง^500\nดูกรอานนท์นี้เรียกว่า^500\nสัพพสังขาเรสุอนิจจสัญญา',
        'ดูกรอานนท์อานาปานสติเป็นไฉน^500\nดูกรอานนท์ภิกษุในธรรมวินัยนี้^500\nอยู่ในป่าก็ดี^500\nอยู่ที่โคนไม้ก็ดี^500\nอยู่ในเรือนว่างเปล่าก็ดี^500\nนั่งคู้บัลลังก์ตั้งกายให้ตรง^500\nดำรงสติไว้เฉพาะหน้า^500\nเธอเป็นผู้มีสติหายใจออก^500\nเป็นผู้มีสติหายใจเข้า^500\nเมื่อหายใจออกยาว^500\nก็รู้ชัดว่าหายใจออกยาว^500\nหรือเมื่อหายใจเข้ายาว^500\nก็รู้ชัดว่าหายใจเข้ายาว^500\nเมื่อหายใจออกสั้น^500\nก็รู้ชัดว่าหายใจออกสั้น^500\nหรือเมื่อหายใจเข้าสั้น^500\nก็รู้ชัดว่าหายใจเข้าสั้น^500\nย่อมศึกษาว่าจักเป็นผู้กำหนดรู้^500\nกายทั้งปวงหายใจออก^500\nย่อมศึกษาว่าจักเป็นผู้กำหนดรู้^500\nกายทั้งปวงหายใจเข้า^500\nย่อมศึกษาว่าจักระงับ^500\nกายสังขารหายใจออก^500\nย่อมศึกษาว่าจักระงับ^500\nกายสังขารหายใจเข้า^500\nย่อมศึกษาว่าจักกำหนดรู้^500\nปิติหายใจออก^500\nย่อมศึกษาว่าจักกำหนดรู้^500\nปิติหายใจเข้า^500\nย่อมศึกษาว่าจักกำหนดรู้^500\nสุขหายใจออก^500\nย่อมศึกษาว่าจักกำหนดรู้^500\nสุขหายใจเข้า^500\nย่อมศึกษาว่าจักกำหนดรู้^500\nจิตตสังขารหายใจออก^500\nย่อมศึกษาว่าจักกำหนดรู้^500\nจิตตสังขารหายใจเข้า^500\nย่อมศึกษาว่าจักระงับจิตตสังขาร^500\nหายใจออก^500\nย่อมศึกษาว่าจักระงับจิตตสังขาร^500\nหายใจเข้า^500\nย่อมศึกษาว่าจักกำหนดรู้^500\nจิตหายใจออก^500\nย่อมศึกษาว่าจักกำหนดรู้^500\nจิตหายใจเข้า^500\nย่อมศึกษาว่าจักยังจิต^500\nให้บันเทิงหายใจออก^500\nย่อมศึกษาว่าจักยังจิต^500\nให้บันเทิงหายใจเข้า^500\nย่อมศึกษาว่าจักตั้งจิต^500\nให้มั่นหายใจออก^500\nย่อมศึกษาว่าจักตั้งจิต^500\nให้มั่นหายใจเข้า^500\nย่อมศึกษาว่าจักเปลื้องจิต^500\nหายใจออก^500\nย่อมศึกษาว่าจักเปลื้องจิต^500\nหายใจเข้า^500\nย่อมศึกษาว่าจักเป็นผู้พิจารณา^500\nเห็นโดยความเป็นของไม่เที่ยง^500\nหายใจออก^500\nย่อมศึกษาว่าจักเป็นผู้พิจารณา^500\nเห็นโดยความเป็นของไม่เที่ยง^500\nหายใจเข้า^500\nย่อมศึกษาว่าจักเป็นผู้พิจารณา^500\nเห็นโดยความคลายกำหนัดหายใจออก^500\nย่อมศึกษาว่าจักเป็นผู้พิจารณา^500\nโดยความคลายกำหนัดหายใจเข้า^500\nย่อมศึกษาว่าจักเป็นผู้พิจารณา^500\nเห็นโดยความดับสนิทหายใจออก^500\nย่อมศึกษาว่าจักเป็นผู้พิจารณา^500\nเห็นโดยความดับสนิทหายใจเข้า^500\nย่อมศึกษาว่าจักเป็นผู้พิจารณา^500\nเห็นโดยความสละคืนหายใจออก^500\nย่อมศึกษาว่าจักเป็นผู้พิจารณา^500\nเห็นโดยความสละคืนหายใจเข้า^500\nดูกรอานนท์นี้เรียกว่าอานาปานสติ',
        'ดูกรอานนท์ถ้าเธอพึงเข้าไปหา^500\nแล้วกล่าวสัญญา 10 ประการนี้^500\nแก่คิริมานนท์ภิกษุไซร้^500\nข้อที่อาพาธของคิริมานนท์ภิกษุ^500\nจะพึงสงบระงับโดยพลัน^500\nเพราะได้ฟังสัญญา 10 ประการนี้^500\nเป็นฐานะที่จะมีได้',
        'ลำดับนั้นแลท่านพระอานนท์^500\nได้เรียนสัญญา 10 ประการนี้^500\nในสำนักของพระผู้มีพระภาคแล้ว^500\nได้เข้าไปหาท่านพระคิริมานนท์ยังที่อยู่^500\nครั้นแล้วได้กล่าวสัญญา 10 ประการ^500\nแก่ท่านพระคิริมานนท์^500\nครั้งนั้นแลอาพาธนั้น^500\nของท่านพระคิริมานนท์สงบระงับโดยพลัน^500\nเพราะได้ฟังสัญญา 10 ประการนี้^500\nท่านพระคิริมานนท์^500\nหายจากอาพาธนั้นก็แล^500\nอาพาธนั้น^500\nเป็นโรคอันพระคิริมานนท์ละได้แล้ว^500\nด้วยประการนั้นแล'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อาพาธสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0408;