import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0511 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'สัมมสนสูตรที่ 2\nว่าด้วยปัจจัยให้ชราและมรณะ\nสมัยหนึ่งท่านพระสารีบุตร\nและท่านพระมหาโกฏฐิตะ\nอยู่ ณ ป่าอิสิปตนมฤคทายวัน\nเขตพระนครพาราณสี\nครั้งนั้นแลเป็นเวลาเย็น\nท่านพระมหาโกฏฐิตะ\nออกจากที่พักผ่อน\nเข้าไปหาพระสารีบุตรถึงที่อยู่\nได้ปราศรัยกับท่านพระสารีบุตร\nครั้นผ่านการปราศรัย\nพอให้ระลึกถึงกันไปแล้ว\nจึงนั่งณที่ควรส่วนข้างหนึ่ง\nท่านพระมหาโกฏฐิตะ\nนั่งเรียบร้อยแล้ว\nได้กล่าวคำนี้กะท่านพระสารีบุตรว่า\nท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า\nชราและมรณะตนทำเอง\nผู้อื่นทำให้ \nทั้งตนทำเองทั้งผู้อื่นทำให้\nหรือว่าชราและมรณะบังเกิดขึ้น\nเพราะอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้\nท่านพระสารีบุตรกล่าวตอบว่า\nท่านโกลิตะชราและมรณะ\nตนทำเองก็ไม่ใช่\nผู้อื่นทำให้ก็ไม่ใช่\nทั้งต้นทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่\nบังเกิดขึ้น\nเพราะอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้ก็ไม่ใช่\nแต่ว่าเพราะชาติเป็นปัจจัย\nจึงมีชราและมรณะ\nท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า\nท่านสารีบุตรชาติตนทำเอง\nผู้อื่นทำให้\nทั้งต้นทำเองทั้งผู้อื่นทำให้\nหรือว่าชาติบังเกิดขึ้น\nเพราะอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้\nท่านพระสารีบุตรกล่าวตอบว่า\nท่านโกลิตะชาติตนทำเองก็ไม่ใช่\nผู้อื่นทำให้ก็ไม่ใช่\nทั้งตนทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่\nชาติบังเกิดขึ้น\nเพราะอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้ก็ไม่ใช่\nแต่เพราะภพเป็นปัจจัยจึงมีชาติ\nท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า\nท่านสารีบุตรภพตนทำเอง\nอุปทานตนทำเอง\nตัณหาตนทำเอง\nเวทนาตนทำเอง\nผัสสะตนทำเองทำเอง\nนามรูปตนทำเอง\nผู้อื่นทำให้\nทั้งตนทำเองทั้งผู้อื่นทำให้\nหรือว่านามรูปบังเกิดขึ้น\nเพราะอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้\nท่านพระสารีบุตรกล่าวตอบว่าท่านโกฏฐิตะ\nนามรูปตนทำเองก็ไม่ใช่\nผู้อื่นทำให้ก็ไม่ใช่\nทั้งต้นทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่\nนามรูปบังเกิดขึ้น\nเพราะอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้ก็ไม่ใช่\nแต่เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป\nท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า\nท่านสารีบุตรวิญญาณตนทำเอง\nผู้อื่นทำให้\nทั้งตนทำเอง\nทั้งผู้อื่นทำให้\nหรือว่าวิญญาณบังเกิดขึ้น\nเพราะอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้\nท่านพระสารีบุตรกล่าวตอบว่าท่านโกฏฐิตะ\nวิญญาณตนทำเองก็ไม่ใช่\nผู้อื่นทำให้ก็ไม่ใช่\nทั้งตนเองและผู้อื่นทำให้ก็ไม่ใช่\nวิญญาณบังเกิดขึ้น\nเพราะอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้ก็ไม่ใช่\nแต่เพราะนามรูปเป็นปัจจัยจึงมีวิญญาณ\nเราทั้งหลายเพิ่งรู้ชัดภาษิต\nของท่านสารีบุตรในบัดนี้เอง\nอย่างนี้ว่าท่านโกฏฐิตะ\nนามรูปตนทำเองก็ไม่ใช่\nผู้อื่นทำให้ก็ไม่ใช่\nทั้งตนทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่\nบังเกิดขึ้น\nเพราะอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้ก็ไม่ใช่\nแต่เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป\nอนึ่งเราทั้งหลายรู้ชัดภาษิต\nของท่านพระสารีบุตรในบัดนี้เอง\nอย่างนี้ว่าท่านโกฏฐิตะ\nวิญญาณตนทำเองก็ไม่ใช่\nผู้อื่นก็ทำให้ก็ไม่ใช่\nบังเกิดขึ้นเพราะ\nอาศัยตนไม่ได้ทำเอง\nผู้อื่นไม่ได้ทำให้ก็ไม่ใช่\nแต่เพราะนามรูปเป็นปัจจัย\nจึงมีวิญญาณ',
        'ท่านสารีบุตรก็เนื้อความของภาษิตนี้\nเราทั้งหลายจะพึงเห็นได้อย่างไร\nดูกรอาวุโสถ้าเช่นนั้น\nผมจะเปรียบให้ท่านฟัง\nในโลกนี้บุรุษผู้ฉลาดบางพวก\nย่อมรู้ชัดเนื้อความของภาษิต\nได้แม้ด้วยอุปมา\nอาวุโสไม้อ้อ 2 กำพึงตั้งอยู่ได้\nเพราะต่างอาศัยซึ่งกันและกันฉันใด\nเพราะนามรูปเป็นปัจจัยจึงมีวิญญาณ\nเพราะวิญญาณเป็นปัจจัยจึงมีนามรูป\nท่อนามรูปเป็นปัจจัยจึงมีสฬายตนะ\nสฬายตนะเป็นปัจจัยจึงมีผัสสะ\nความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้\nย่อมมีด้วยประการอย่างนี้ฉันนั้นแล',
        'ถ้าไม้อ้อ 2 กำนั้นพึงเอาออกเสียกำหนึ่ง\nอีกคำหนึ่งก็ล้มไป\nถ้าดึงอีกกำหนึ่งออก\nอีกคำหนึ่งก็ล้มไปฉันใด\nเพราะนามรูปดับวิญญาณจึงดับ\nเพราะวิญญาณดับนามรูปจึงดับ\nเพราะนามรูปดับสฬายตนะจึงดับ\nเพราะสฬายตนะดับผัสสะจึงดับ\nความดับแห่งกองทุกข์ทั้งมวลนี้\nย่อมมีด้วยประการอย่างนี้ฉันนั้นแล\nน่าอัศจรรย์ท่านสารีบุตรไม่เคยมีมา\nท่านสารีบุตรเท่าที่ท่านสารีบุตรกล่าวนี้\nเป็นอันกล่าวดีแล้ว\nก็แลเราทั้งหลายพลอยยินดีสุภาษิตนี้\nของท่านสารีบุตร\nด้วยเรื่อง 36 เรื่องเหล่านี้\nถ้าภิกษุแสดงธรรมเพื่อความหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับชราและมรณะ\nควรจะกล่าวว่าภิกษุธรรมกถึก\nถ้าภิกษุปฏิบัติเพื่อความหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับชราและมรณะ\nควรจะกล่าวว่า\nภิกษุปฏิบัติธรรมสมควรแก่ธรรม\nถ้าภิกษุหลุดพ้นเพราะความหน่าย\nเพราะคลายกำหนัด\nเพราะความดับ\nเพราะไม่ถือมั่นชราและมรณะ\nควรจะกล่าวว่า\nภิกษุบรรลุนิพพานในปัจจุบัน',
        'ถ้าภิกษุแสดงธรรมเพื่อความหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับชาติ ภพ อุปาทาน\nตัณหา เวทนา ผัสสะ \nสฬายตนะ นามรูป\nวิญญาณ สังขารทั้งหลาย อวิชชา\nควรจะกลับว่าภิกษุธรรมกถึก\nถ้าภิกษุปฏิบัติเพื่อความหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับอวิชชา\nควรจะกล่าวว่า\nภิกษุปฏิบัติธรรมสมควรแก่ธรรม\nถ้าภิกษุหลุดพ้น เพราะความหน่าย\nเพราะคลายกำหนัด\nเพราะความดับ\nเพราะความไม่ถือมั่นในอวิชชา\nควรจะกล่าวว่าภิกษุบรรลุนิพพานในปัจจุบัน'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>สัมมสนสูตรที่ 2</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0511;