import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0606 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'พระนครสาวัตถี\nครั้งนั้นแล\nภิกษุรูปหนึ่ง\nเข้าไปเฝ้าพระผู้มีพระภาค\nถึงที่ประทับ ฯลฯ\nครั้นแล้ว\nได้ทูลถามพระผู้มีพระภาคว่า\nข้าแต่พระองค์ผู้เจริญ\nที่เรียกว่า อวิชชา\nอวิชชา ดังนี้\nอวิชชาเป็นไฉนหนอแล\nและบุคคลเป็นผู้ประกอบ\nด้วยอวิชชาด้วยเหตุเพียงเท่าไร?\nพระผู้มีพระภาคตรัสตอบว่า\nดูกรภิกษุ\nปุถุชนผู้ไม่ได้สดับแล้วในโลกนี้\nย่อมไม่รู้ชัด\nตามความเป็นจริง\nซึ่งรูปอันมีความเกิดขึ้น\nเป็นธรรมดาว่า\nรูปมีความเกิดขึ้นเป็นธรรมดา\nย่อมไม่รู้ชัด\nตามความเป็นจริง\nซึ่งรูปอันมีความเสื่อมไป\nเป็นธรรมดาว่า\nรูปมีความเสื่อมไปเป็นธรรมดา\nย่อมไม่รู้ชัด\nตามความเป็นจริง\nซึ่งรูปอันมีความเกิดขึ้น\nและความเสื่อมไป\nเป็นธรรมดาว่า\nรูปมีความเกิดขึ้น\nและความเสื่อมไปเป็นธรรมดา\nย่อมไม่รู้ชัด\nตามความเป็นจริง\nซึ่งเวทนา\nย่อมไม่รู้ชัดตาม\nความเป็นจริง\nซึ่งสัญญา\nย่อมไม่รู้ชัด\nตามความเป็นจริง\nซึ่งสังขาร\nย่อมไม่รู้ชัด\nตามความเป็นจริง\nซึ่งวิญญาณ\nอันมีความเกิดขึ้น\nเป็นธรรมดาว่า\nวิญญาณมีความเกิดขึ้น\nเป็นธรรมดา\nย่อมไม่รู้ชัด\nตามความเป็นจริง\nซึ่งวิญญาณ\nอันมีความเสื่อมไป\nเป็นธรรมดาว่า\nวิญญาณมีความเสื่อมไป\nเป็นธรรมดา\nย่อมไม่รู้ชัด\nตามความเป็นจริง\nซึ่งวิญญาณ\nอันมีความเกิดขึ้น\nและความเสื่อมไป\nเป็นธรรมดาว่า\nวิญญาณมีความเกิดขึ้น\nและความเสื่อมไป\nเป็นธรรมดา\nดูกรภิกษุ นี้เรียกว่า\nอวิชชา และบุคคล\nเป็นผู้ประกอบด้วยอวิชชา\nด้วยเหตุเพียงเท่านี้\nเมื่อพระผู้มีพระภาค\nตรัสอย่างนี้แล้ว\nภิกษุนั้นทูลถามว่า\nข้าแต่พระองค์ผู้เจริญ\nที่เรียกว่า วิชชา\nวิชชา ดังนี้\nวิชชาเป็นไฉนหนอแล\nและบุคคล\nเป็นผู้ประกอบด้วยวิชชา\nด้วยเหตุเพียงเท่าไร?\nพระผู้มีพระภาคตรัสตอบว่า\nดูกรภิกษุ\nอริยสาวกผู้ได้สดับแล้ว\nในธรรมวินัยนี้\nย่อมรู้ชัดตามความเป็นจริง\nซึ่งรูป อันมีความเกิดขึ้น\nเป็นธรรมดาว่า\nรูปมีความเกิดขึ้น\nเป็นธรรมดา\nย่อมรู้ชัดตามความเป็นจริง\nซึ่งรูป อันมีความเสื่อมไป\nเป็นธรรมดาว่า\nรูปมีความเสื่อมไป\nเป็นธรรมดา\nย่อมรู้ชัดตามความเป็นจริง\nซึ่งรูป อันมีความเกิดขึ้น\nและความเสื่อมไป\nเป็นธรรมดาว่า\nรูปมีความเกิดขึ้น\nและความเสื่อมไป\nเป็นธรรมดา\nย่อมรู้ชัดตามความเป็นจริง\nซึ่งเวทนา\nย่อมรู้ชัดตามความเป็นจริง\nซึ่งสัญญา\nย่อมรู้ชัดตามความเป็นจริง\nซึ่งสังขาร\nย่อมรู้ชัดตามความเป็นจริง\nซึ่งวิญญาณ\nอันมีความเกิดขึ้น\nเป็นธรรมดาว่า\nวิญญาณมีความเกิดขึ้น\nเป็นธรรมดา\nย่อมรู้ชัดตามความเป็นจริง\nซึ่งวิญญาณ\nอันมีความเสื่อมไป\nเป็นธรรมดาว่า\nวิญญาณมีความเสื่อมไป\nเป็นธรรมดา\nย่อมรู้ชัดตามความเป็นจริง\nซึ่งวิญญาณ\nอันมีความเกิดขึ้น\nและความเสื่อมไป\nเป็นธรรมดาว่า\nวิญญาณมีความ\nเกิดขึ้นและเสื่อมไป\nเป็นธรรมดา\nดูกรภิกษุ นี้เรียกว่า วิชชา\nและบุคคลเป็นผู้ประกอบด้วยวิชชา\nด้วยเหตุเพียงเท่านี้แล'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>สมุทยธัมมสูตรที่ ๑</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0606;