import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0208 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'วิญญาณเกิดขึ้นอย่างไร\nวิญญาณเกิดขึ้น\nเพราะอาศัยส่วนสอง\nวิญญาณเกิดขึ้น\nเพราะอาศัยส่วนสองเป็นอย่างไร\nจักษุวิญญาณย่อมเกิดขึ้น\nเพราะอาศัยจักษุและรูป\nจักษุไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nรูปไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nส่วนสองอย่างนี้หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nจักษุวิญญาณไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งจักษุวิญญาณก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็จักษุวิญญาณที่เกิดขึ้นแล้ว\nเพราะอาศัยเหตุปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nความประจวบ\nความประชุม\nความพร้อมกันแห่งธรรมทั้งสามนี้แล\nเรียกว่าจักษุสัมผัส\nแม้จักษุสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งจักษุสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็จักษุสัมผัสที่เกิดขึ้นแล้ว\nเพราะอาศัยปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nบุคคลอันผัสสะกระทบแล้วย่อมรู้สึก\nอันผัสสะกระทบแล้วย่อมคิด\nอันผัสสะกระทบแล้วย่อมจำ\nแม้ธรรมเหล่านี้ก็หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'โสตะวิญญาณ\nย่อมเกิดขึ้น\nเพราะอาศัยหูและเสียง\nหูไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nเสียงไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nส่วนสองอย่างนี้หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nโสตวิญญาณไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งโสตวิญญาณก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็โสตวิญญาณที่เกิดขึ้นแล้ว\nเพราะอาศัยเหตุปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nความประจวบ\nความประชุม\nความพร้อมกันแห่งธรรมทั้งสามนี้แล\nเรียกว่าโสตสัมผัส',
        'แม้โสตสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งโสตสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็โสตสัมผัสที่เกิดขึ้นแล้ว\nเพราะอาศัยปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nบุคคลอันผัสสะกระทบแล้วย่อมรู้สึก\nอันผัสสะกระทบแล้วย่อมคิด\nอันผัสสะกระทบแล้วย่อมจำ\nแม้ธรรมเหล่านี้ก็หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ฆานะวิญญาณ\nย่อมเกิดขึ้น\nเพราะอาศัยจมูกและกลิ่น\nจมูกไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nกลิ่นไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nส่วนสองอย่างนี้หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nฆานวิญญาณไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งฆานวิญญาณก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็ฆานวิญญาณที่เกิดขึ้นแล้ว\nเพราะอาศัยเหตุปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nความประจวบ\nความประชุม\nความพร้อมกันแห่งธรรมทั้งสามนี้แล\nเรียกว่าฆานสัมผัส\nแม้ฆานสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งฆานสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็ฆานสัมผัสที่เกิดขึ้นแล้ว\nเพราะอาศัยปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nบุคคลอันผัสสะกระทบแล้วย่อมรู้สึก\nอันผัสสะกระทบแล้วย่อมคิด\nอันผัสสะกระทบแล้วย่อมจำ\nแม้ธรรมเหล่านี้ก็หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ชิวหาวิญญาณ\nย่อมเกิดขึ้น\nเพราะอาศัยลิ้นและรส\nลิ้นไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nรสไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nส่วนสองอย่างนี้หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nชิวหาวิญญาณไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งชิวหาวิญญาณก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็ชิวหาวิญญาณที่เกิดขึ้นแล้ว\nเพราะอาศัยเหตุปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nความประจวบ\nความประชุม\nความพร้อมกันแห่งธรรมทั้งสามนี้แล\nเรียกว่าชิวหาสัมผัส\nแม้ชิวหาสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งชิวหาสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็ชิวหาสัมผัสที่เกิดขึ้นแล้ว\nเพราะอาศัยปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nบุคคลอันผัสสะกระทบแล้วย่อมรู้สึก\nอันผัสสะกระทบแล้วย่อมคิด\nอันผัสสะกระทบแล้วย่อมจำ\nแม้ธรรมเหล่านี้ก็หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'กายวิญญาณ\nย่อมเกิดขึ้น\nเพราะอาศัยกายและสัมผัส\nกายไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nสัมผัสไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nส่วนสองอย่างนี้หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nกายวิญญาณไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งกายวิญญาณก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็กายวิญญาณที่เกิดขึ้นแล้ว\nเพราะอาศัยเหตุปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nความประจวบ\nความประชุม\nความพร้อมกันแห่งธรรมทั้งสามนี้แล\nเรียกว่ากายสัมผัส\nแม้กายสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งกายสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็กายสัมผัสที่เกิดขึ้นแล้ว\nเพราะอาศัยปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nบุคคลอันผัสสะกระทบแล้วย่อมรู้สึก\nอันผัสสะกระทบแล้วย่อมคิด\nอันผัสสะกระทบแล้วย่อมจำ\nแม้ธรรมเหล่านี้ก็หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'มโนวิญญาณ\nย่อมเกิดขึ้น\nเพราะอาศัยใจและธรรมารมณ์\nใจไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nธรรมทั้งหลายก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nส่วนสองอย่างนี้หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nมโนวิญญาณไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งมโนวิญญาณก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็มโนวิญญาณที่เกิดขึ้นแล้ว\nเพราะอาศัยเหตุปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nความประจวบ\nความประชุม\nความพร้อมกันแห่งธรรมทั้งสามนี้แล\nเรียกว่ามโนสัมผัส\nแม้มโนสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nแม้เหตุปัจจัยเพื่อความเกิดขึ้น\nแห่งมโนสัมผัสก็ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nก็มโนสัมผัสที่เกิดขึ้นแล้ว\nเพราะอาศัยปัจจัยอันไม่เที่ยง\nจักเป็นของเที่ยงได้แต่ไหน\nบุคคลอันผัสสะกระทบแล้วย่อมรู้สึก\nอันผัสสะกระทบแล้วย่อมคิด\nอันผัสสะกระทบแล้วย่อมจำ\nแม้ธรรมเหล่านี้ก็หวั่นไหว\nและอาพาธ ไม่เที่ยง\nมีความแปรปรวน\nมีความเป็นอย่างอื่น\nมโนวิญญาณย่อมเกิดขึ้น\nเพราะอาศัยส่วนสองอย่างด้วยประการฉะนี้แล'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>วิปัสสนากำหนดรู้ส่วน 2 อย่าง</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0208;