import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0309 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ถ้ามีคนพึงถามอย่างนี้ว่า\nธรรมทั้งปวงมีอะไรเป็นมูล\nธรรมทั้งปวงมีอะไรเป็นแดนเกิด\nธรรมทั้งปวงมีอะไรเป็นสมุทัย\nธรรมทั้งปวงมีอะไรเป็นที่ประชุมลง\nธรรมทั้งปวงมีอะไรเป็นประมุข\nธรรมทั้งปวงมีอะไรเป็นใหญ่\nธรรมทั้งปวงมีอะไรเป็นยิ่งกว่า\nธรรมทั้งปวงมีอะไรเป็นแก่นสาร\nให้ตอบอย่างนี้ว่า\nธรรมทั้งปวงมีอะไรเป็นมูล\nมีฉันทะเป็นมูล\nธรรมทั้งปวงมีอะไรเป็นแดนเกิด\nมีมนสิการเป็นแดนเกิด\nธรรมทั้งปวงมีอะไรเป็นสมุทัย\nมีผัสสะเป็นสมุทัย\nธรรมทั้งปวงมีอะไรเป็นที่ประชุมลง\nมีเวทนาเป็นที่ประชุมลง\nธรรมทั้งปวงมีอะไรเป็นประมุข\nมีสมาธิเป็นประมุข\nธรรมทั้งปวงมีอะไรเป็นใหญ่\nมีสติเป็นใหญ่\nธรรมทั้งปวงมีอะไรเป็นยิ่งกว่า\nมีปัญญาเป็นยิ่ง\nธรรมทั้งปวงมีอะไรเป็นแก่นสาร\nมีวิมุติเป็นแก่นสาร',
        'พระพุทธเจ้าตรัสไว้ว่า\nธรรมเป็นที่สิ้นอาสวะ 10 ประการ\nธรรม 10 ประการนี้\nอันบุคคลเจริญแล้วทำให้มากแล้ว\nย่อมเป็นไปเพื่อความสิ้นไป\nแห่งอาสวะทั้งหลาย\nธรรม 10 ประการเป็นไฉน\nคือสัมมาทิฏฐิ\nสัมมาสังกัปปะ\nสัมมาวาจา\nสัมมากัมมันตะ\nสัมมาอาชีวะ\nสัมมาวายามะ\nสัมมาสติ\nสัมมาสมาธิ\nสัมมาญาณะ\nสัมมาวิมุติ\nธรรม 10 ประการนี้\nอันบุคคลเจริญแล้วทำให้มากแล้ว\nย่อมเป็นไปเพื่อความสิ้นไป\nแห่งอาสวะทั้งหลาย',
        'พระพุทธเจ้าตรัสไว้ว่า\nการจักแสดงสิ่งที่ดี\nและสิ่งที่ไม่ดีแก่เธอทั้งหลาย\nสิ่งที่ไม่ดีเป็นไฉน\nคือมิจฉาทิฏฐิ ความเห็นผิด\nมิจฉาสังกัปปะ ความดำริผิด\nมิจฉาวาจา เจรจาผิด\nมิจฉากัมมันตะ การงานผิด\nมิจฉาอาชีวะ เลี้ยงชีพผิด\nมิจฉาวายามะ ความพยายามผิด\nมิจฉาสติ ความระลึกผิด\nมิจฉาสมาธิ ตั้งใจผิด\nมิจฉาญาณะ รู้ผิด\nมิจฉาวิมุติ หลุดพ้นผิด\nนี้เรียกว่าสิ่งที่ไม่ดี',
        'ก็สิ่งที่ดีเป็นไฉน\nคือสัมมาทิฏฐิ ความเห็นชอบ\nสัมมาสังกัปปะ ความดำริชอบ\nสัมมาวาจา เจรจาชอบ\nสัมมากัมมันตะ การงานชอบ\nสัมมาอาชีวะ เลี้ยงชีพชอบ\nสัมมาวายามะ ความเพียรชอบ\nสัมมาสติ ระลึกชอบ\nสัมมาสมาธิ ตั้งใจชอบ\nสัมมาญาณะ ความรู้ชอบ\nสัมมาวิมุติ ความหลุดพ้นชอบ\nนี้เรียกว่าสิ่งที่ดี'      
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ถ้ามีคนพึงถามอย่างนี้ว่า</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0309;