import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0407 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ขัตติยาธิปปายสูตร\nว่าด้วยความประสงค์\nของคน 6 จำพวก\nครั้งนั้นแลชานุสโสนิพราหมณ์\nเข้าไปเฝ้าพระผู้มีพระภาค\nถึงที่ประทับ\nได้ปราศรัยกับพระผู้มีพระภาค\nครั้นผ่านการปราศรัย\nพอให้ระลึกถึงกันไปแล้ว\nจึงนั่ง ณ ที่ควรส่วนข้างหนึ่ง\nครั้นแล้วได้ทูลถาม\nพระผู้มีพระภาคว่า',
        'ชานุสโสนิพราหมณ์\nถามพระพุทธเจ้าว่า\nข้าแต่พระโคดมผู้เจริญ\nกษัตริย์ทั้งหลาย\nย่อมมีความประสงค์อะไร\nนิยมอะไร\nมั่นใจอะไร\nต้องการอะไร\nมีอะไรเป็นที่สุด',
        'พระผู้มีพระภาค\nตรัสตอบว่า\nดูกรพราหมณ์\nธรรมดากษัตริย์ทั้งหลาย\nย่อมประสงค์โภคทรัพย์\nนิยมปัญญา\nมั่นใจในกำลังทหาร\nต้องการในการได้แผ่นดิน\nมีความเป็นใหญ่เป็นที่สุด',
        'ชานุสโสนิพราหมณ์\nถามพระพุทธเจ้าต่อไปว่า\nข้าแต่พระโคดมผู้เจริญ\nก็พราหมณ์ทั้งหลาย\nย่อมมีความประสงค์อะไร\nนิยมอะไร\nมั่นใจอะไร\nต้องการอะไร\nมีอะไรเป็นที่สุด\nพระผู้มีพระภาค\nตรัสตอบว่า\nดูกรพราหมณ์\nธรรมดาพราหมณ์ทั้งหลาย\nย่อมประสงค์โภคทรัพย์\nนิยมปัญญา\nมั่นใจในมนต์\nต้องการบูชายัญ\nมีพรหมโลกเป็นที่สุด',
        'ชานุสโสนิพราหมณ์\nถามพระพุทธเจ้าต่อไปว่า\nข้าแต่พระโคดมผู้เจริญ\nก็คฤหบดีทั้งหลาย\nย่อมมีความประสงค์อะไร\nนิยมอะไร\nมั่นใจในอะไร\nต้องการอะไร\nมีอะไรเป็นที่สุด',
        'พระผู้มีพระภาค\nตรัสตอบว่า\nดูกรพราหมณ์\nธรรมดาคฤหบดีทั้งหลาย\nย่อมประสงค์โภคทรัพย์\nนิยมปัญญา\nมั่นใจในศิลปะ\nต้องการการงาน\nมีการงานที่สำเร็จแล้วเป็นที่สุด',
        'ชานุสโสนิพราหมณ์\nถามพระพุทธเจ้าต่อไปว่า\nข้าแต่พระโคดมผู้เจริญ\nก็สตรีทั้งหลาย\nย่อมประสงค์อะไร\nนิยมอะไร\nมั่นใจในอะไร\nต้องการอะไร\nมีอะไรเป็นที่สุด\nพระผู้มีพระภาค\nตรัสตอบว่า\nดูกรพราหมณ์\nธรรมดาสตรีทั้งหลาย\nย่อมประสงค์บุรุษ\nนิยมเครื่องแต่งตัว\nมั่นใจในบุตร\nต้องการไม่ให้สตรีอื่นร่วมสามี\nมีความเป็นใหญ่ในบ้านเป็นที่สุด',
        'ชานุสโสนิพราหมณ์\nถามพระพุทธเจ้าต่อไปว่า\nข้าแต่พระโคดมผู้เจริญ\nก็โจรทั้งหลาย\nย่อมประสงค์อะไร\nนิยมอะไร\nมั่นใจอะไร\nต้องการอะไร\nมีอะไรเป็นที่สุด',
        'พระผู้มีพระภาค\nตรัสตอบว่า\nดูกรพราหมณ์โจรทั้งหลาย\nย่อมประสงค์ลักทรัพย์ของผู้อื่น\nนิยมที่เร้นลับ\nมั่นใจในศาสตรา\nต้องการที่มืด\nมีการที่ผู้อื่นไม่เห็นเขาเป็นที่สุด',
        'ชานุสโสนิพราหมณ์\nถามพระพุทธเจ้าต่อไปว่า\nข้าแต่พระโคดมผู้เจริญ\nก็สมณะทั้งหลาย\nย่อมประสงค์อะไร\nนิยมอะไร\nมั่นใจอะไร\nต้องการอะไร\nมีอะไรเป็นที่สุด',
        'พระผู้มีพระภาค\nตรัสตอบว่า\nดูกรพราหมณ์\nธรรมดาสมณะทั้งหลาย\nย่อมประสงค์ขันติโสรัจจะ\nนิยมปัญญา\nมั่นใจในศีล\nต้องการความไม่มีห่วงใย\nมีพระนิพพานเป็นที่สุด',
        'ข้าแต่พระโคดมผู้เจริญ\nอัศจรรย์เรื่องไม่เคยมีได้มีแล้ว\nคือท่านพระโคดม\nย่อมทรงทราบความประสงค์\nความนิยม\nความมั่นใจ\nความต้องการ\nและสิ่งที่เป็นที่สุด\nแห่งกษัตริย์ทั้งหลายฯลฯ\nแห่งพราหมณ์ทั้งหลายฯลฯ\nแห่งคฤหบดีทั้งหลายฯลฯ\nแม้แห่งสตรีทั้งหลายฯลฯ\nแม้แห่งโจรทั้งหลายฯลฯ\nย่อมทรงทราบความประสงค์\nความนิยม\nความมั่นใจ\nความต้องการ\nและสิ่งที่เป็นที่สุด\nแห่งสมณะทั้งหลาย',
        'ข้าแต่ท่านพระโคดมผู้เจริญ\nภาษิตของพระองค์แจ่มแจ้งนัก\nข้าแต่ท่านพระโคดมผู้เจริญ\nภาษิตของพระองค์แจ่มแจ้งนัก\nขอท่านพระโคดมทรงจำข้าพระองค์\nว่าเป็นอุบาสกผู้ถึงสรณะตลอดชีวิต\nตั้งแต่วันนี้เป็นต้นไป'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ขัตติยาธิปปายสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0407;