import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0402 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'อดีต อนาคต ปัจจุบัน อนิจจสูตร^500\nว่าด้วยความเป็นอนิจจัง^500\nแห่งอายตนะภายในทั้งสามกาล^500\nดูกรภิกษุทั้งหลาย^500\nจักษุที่เป็นอดีตและอนาคต^500\nเป็นของไม่เที่ยง^500\nจะกล่าวไปใยถึงจักษุ^500\nที่เป็นปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้ว^500\nเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใย^500\nในจักษุที่เป็นอดีต^500\nไม่เพลิดเพลินจักษุ^500\nที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่าย^500\nเพื่อคลายกำหนัด^500\nเพื่อดับจักษุที่เป็นปัจจุบัน^500\nหู จมูก ลิ้น กาย ใจ^500\nที่เป็นอดีตและอนาคต^500\nเป็นของไม่เที่ยง^500\nจะกล่าวไปใย^500\nถึงใจที่เป็นปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้ว^500\nเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใยในใจ^500\nที่เป็นอดีต^500\nไม่เพลิดเพลินในใจ^500\nที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่าย^500\nเพื่อคลายกำหนัด^500\nเพื่อดับซึ่งใจที่เป็นปัจจุบัน',
        'อดีต อนาคต ปัจจุบัน ทุกข์สูตร^500\nว่าด้วยความเป็นทุกข์^500\nแห่งอายตนะภายในทั้งสามกาล^500\nดูกรภิกษุทั้งหลาย^500\nจักษุที่เป็นอดีตและอนาคต^500\nเป็นทุกข์^500\nจะกล่าวไปใย^500\nถึงจักษุที่เป็นปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้ว^500\nเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใย^500\nในจักษุที่เป็นอดีต^500\nไม่เพลิดเพลินจักษุ^500\nที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่าย^500\nเพื่อคลายกำหนัด^500\nเพื่อดับจักษุที่เป็นปัจจุบัน^500\nหู จมูก ลิ้น กาย ใจ^500\nที่เป็นอดีตและอนาคต^500\nเป็นทุกข์^500\nจะกล่าวไปใยถึงใจ^500\nที่เป็นปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้ว^500\nเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใยในใจ^500\nที่เป็นอดีต^500\nไม่เพลิดเพลินในใจ^500\nที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่าย^500\nเพื่อคลายกำหนัด^500\nเพื่อดับซึ่งใจที่เป็นปัจจุบัน',
        'อดีต อนาคต ปัจจุบัน อนัตตาสูตร^500\nว่าด้วยความเป็นอนัตตา^500\nแห่งอายตนะภายใน^500\nทั้งสามกาล^500\nดูกรภิกษุทั้งหลาย^500\nจักษุที่เป็นอดีตและอนาคต^500\nเป็นอนัตตา^500\nจะกล่าวไปใย^500\nถึงจักษุที่เป็นปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้ว^500\nเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใย^500\nในจักษุที่เป็นอดีต^500\nไม่เพลิดเพลินจักษุ^500\nที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่าย^500\nเพื่อคลายกำหนัด^500\nเพื่อดับจักษุที่เป็นปัจจุบัน^500\nหู จมูก ลิ้น กาย ใจ^500\nที่เป็นอดีตและอนาคต^500\nเป็นอนัตตา^500\nจะกล่าวไปใยถึงใจ^500\nที่เป็นปัจจุบันเล่า^500\nอริยสาวกผู้ได้สดับแล้ว^500\nเห็นอยู่อย่างนี้^500\nย่อมไม่มีเยื่อใยในใจ^500\nที่เป็นอดีต^500\nไม่เพลิดเพลินในใจ^500\nที่เป็นอนาคต^500\nย่อมปฏิบัติเพื่อเบื่อหน่าย^500\nเพื่อคลายกำหนัด^500\nเพื่อดับซึ่งใจที่เป็นปัจจุบัน'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i className="bi bi-x-lg" />
            </button>
            <a href="/lesson0403">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" />
              </button>
            </a>
            <h2 style={{display: 'inline-block'}}>อดีต อนาคต ปัจจุบัน อนิจจสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0402;