import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0405 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'โนอัสสาสูตรที่ 2\nดูกรภิกษุทั้งหลาย\nถ้าคุณแห่งรูปจักไม่มีแล้วไซร้\nสัตว์ทั้งหลาย\nก็จะไม่พึงกำหนัดในรูป\nแต่เพราะคุณของรูปมีอยู่\nฉะนั้นสัตว์ทั้งหลาย\nจึงกำหนัดในรูป\nถ้าโทษแห่งรูปไม่มีแล้วไซร้\nสัตว์ทั้งหลาย\nก็จะไม่พึงเบื่อหน่ายในรูป\nแต่เพราะโทษแห่งรูปมีอยู่\nฉะนั้นสัตว์ทั้งหลาย\nจึงเบื่อหน่ายในรูป\nถ้าความสลัดออกแห่งรูป\nจักไม่มีแล้วไซร้\nสัตว์ทั้งหลาย\nก็จะไม่พึงสลัดออกจากรูป\nแต่เพราะความสลัดออกแห่งรูปมีอยู่\nฉะนั้นสัตว์ทั้งหลาย\nจึงสลัดออกแห่งรูป ฯลฯ\nแห่งเสียง ฯลฯ\nแห่งกลิ่น ฯลฯ\nแห่งรส ฯลฯ\nแห่งโผฏฐัพพะ ฯลฯ',
        'ถ้าคุณแห่งธรรมารมณ์\nจักไม่มีแล้วไซร้\nสัตว์ทั้งหลาย\nไม่พึงกำหนัดในธรรมารมณ์\nแต่เพราะคุณแห่งธรรมารมณ์มีอยู่\nฉะนั้นสัตว์ทั้งหลาย\nพึงกำหนัดในธรรมารมณ์\nถ้าโทษแห่งธรรมารมณ์\nจักไม่มีแล้วไซร้\nสัตว์ทั้งหลาย\nก็ไม่พึงเบื่อหน่ายในธรรมารมณ์\nแต่เพราะโทษแห่งธรรมารมณ์มีอยู่\nฉะนั้นสัตว์ทั้งหลาย\nจึงเบื่อหน่ายในธรรมารมณ์\nถ้าความสลัดออก\nจากธรรมารมณ์จักไม่มีแล้วไซร้\nสัตว์ทั้งหลาย\nก็จะไม่พึงสลัดออกจากธรรมารมณ์\nแต่เพราะความสลัดออก\nจากธรรมารมณ์มีอยู่\nฉะนั้นสัตว์ทั้งหลาย\nจึงสลัดออกจากธรรมารมณ์',
        'ดูกรภิกษุทั้งหลาย\nสัตว์ทั้งหลาย\nยังไม่รู้ตามความเป็นจริง\nซึ่งคุณแห่งอายตนะภายนอก 6 เหล่านี้\nโดยเป็นคุณ\nซึ่งโทษโดยความเป็นโทษ\nซึ่งความสลัดออก\nโดยเป็นความสลัดออกเพียงใด\nสัตว์ทั้งหลายก็ยังเป็นผู้ไม่ออกไป\nพรากไป\nหลุดพ้นจากโลก\nพร้อมเทวโลก มารโลก พรหมโลก\nจากหมู่สัตว์\nพร้อมทั้งสมณพราหมณ์เทวดาและมนุษย์\nมีใจหาเขตแดนไม่ได้อยู่เพียงนั้น\nแต่เมื่อใดสัตว์ทั้งหลายได้รู้ตามความเป็นจริง\nซึ่งคุณแห่งอายตนะ 6 เหล่านี้\nโดยเป็นคุณ\nซึ่งโทษโดยความเป็นโทษ\nซึ่งความสลัดออก\nโดยเป็นความสลัดออก\nเมื่อนั้นสัตว์ทั้งหลายก็เป็นผู้ออกไป\nหลุดพ้นไปจากโลก\nพร้อมทั้งเทวโลก มารโลก พรหมโลก\nจากหมู่สัตว์\nพร้อมทั้งสมณพราหมณ์\nเทวดาและมนุษย์\nมีใจอันหาเขตแดนมิได้อยู่'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>โนอัสสาสูตรที่ 2</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0405;