import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0302 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'พระพุทธเจ้าตรัสไว้ว่า\nจักษุเป็นทุกข์\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา\nสิ่งใดเป็นอนัตตา\nสิ่งนั้นท่านทั้งหลาย\nพึงเห็นด้วยปัญญา\nอันชอบตามความเป็นจริง\nอย่างนี้ว่า\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nไม่ควรเห็นว่าสิ่งนั้น\nเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ\nว่างเปล่าจากตนหรือจากของๆตน',
        'หูเป็นทุกข์\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา\nสิ่งใดเป็นอนัตตา\nสิ่งนั้นท่านทั้งหลาย\nพึงเห็นด้วยปัญญา\nอันชอบตามความเป็นจริง\nอย่างนี้ว่า\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nไม่ควรเห็นว่าสิ่งนั้น\nเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ\nว่างเปล่าจากตนหรือจากของๆตน',
        'จมูกเป็นทุกข์\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา\nสิ่งใดเป็นอนัตตา\nสิ่งนั้นท่านทั้งหลาย\nพึงเห็นด้วยปัญญา\nอันชอบตามความเป็นจริง\nอย่างนี้ว่า\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nไม่ควรเห็นว่าสิ่งนั้น\nเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ\nว่างเปล่าจากตนหรือจากของๆตน',
        'ลิ้นเป็นทุกข์\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา\nสิ่งใดเป็นอนัตตา\nสิ่งนั้นท่านทั้งหลาย\nพึงเห็นด้วยปัญญา\nอันชอบตามความเป็นจริง\nอย่างนี้ว่า\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nไม่ควรเห็นว่าสิ่งนั้น\nเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ\nว่างเปล่าจากตนหรือจากของๆตน',
        'กายเป็นทุกข์\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา\nสิ่งใดเป็นอนัตตา\nสิ่งนั้นท่านทั้งหลาย\nพึงเห็นด้วยปัญญา\nอันชอบตามความเป็นจริง\nอย่างนี้ว่า\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nไม่ควรเห็นว่าสิ่งนั้น\nเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ\nว่างเปล่าจากตนหรือจากของๆตน',
        'ใจเป็นทุกข์\nสิ่งใดเป็นทุกข์สิ่งนั้นเป็นอนัตตา\nสิ่งใดเป็นอนัตตา\nสิ่งนั้นท่านทั้งหลาย\nพึงเห็นด้วยปัญญา\nอันชอบตามความเป็นจริง\nอย่างนี้ว่า\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nไม่ควรเห็นว่าสิ่งนั้น\nเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ\nว่างเปล่าจากตนหรือจากของๆตน',
        'อริยสาวก\nผู้ได้สดับแล้วเห็นอยู่อย่างนี้\nย่อมเบื่อหน่ายแม้ในจักษุ\nย่อมเบื่อหน่ายแม้ในหู\nย่อมเบื่อหน่ายแม้ในจมูก\nย่อมเบื่อหน่ายแม้ในลิ้น\nย่อมเบื่อหน่ายแม้ในกาย\nย่อมเบื่อหน่ายแม้ในใจ\nเมื่อเบื่อหน่ายย่อมคลายกำหนัด\nเพราะคลายกำหนัดย่อมหลุดพ้น\nเมื่อหลุดพ้นแล้วย่อมมีญาณหยั่งรู้ว่าหลุดพ้นแล้ว\nรู้ชัดว่าชาติสิ้นแล้ว\nพรหมจรรย์อยู่จบแล้ว\nกิจที่ควรทำ ทำเสร็จแล้ว\nกิจอื่นเพื่อความเป็นอย่างนี้มิได้มี'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ว่าด้วยความเป็นทุกข์แห่งอายตนะภายใน</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0302;