import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0508 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'อาหารสูตร^500\nว่าด้วยอาหาร 4 อย่าง^500\nข้าพเจ้าได้สดับมาอย่างนี้^500\nสมัยหนึ่งพระผู้มีพระภาค^500\nประทับอยู่ ณ พระเชตวัน^500\nอารามของท่านอนาถบิณฑิกเศรษฐี^500\nเขตพระนครสาวัตถี',
        'พระผู้มีพระภาคได้ตรัสว่า^500\nดูกรภิกษุทั้งหลาย^500\nอาหาร 4 เหล่านี้ย่อมเป็นไป^500\nเพื่อความดำรงอยู่ของหมู่สัตว์^500\nผู้เกิดมาแล้ว^500\nหรือเพื่ออนุเคราะห์หมู่สัตว์^500\nผู้แสวงหาที่เกิด',
        'อาหาร 4 เป็นไฉน^500\nคือ 1 กวฬิงการาหารหยาบหรือละเอียด ^500\n2 ผัสสาหาร^500\n3 มโนสัญเจตนาหาร ^500\n4 วิญญาณาหาร^500\nอาหาร 4 เหล่านี้แลย่อมเป็นไป^500\nเพื่อความดำรงอยู่ของหมู่สัตว์^500\nผู้เกิดมาแล้ว^500\nหรือเพื่ออนุเคราะห์หมู่สัตว์^500\nผู้แสวงหาที่เกิด',
        'ดูกรภิกษุทั้งหลาย^500\nก็อาหาร 4 เหล่านี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นที่ตั้งขึ้น^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด^500\nอาหาร 4 เหล่านี้มีตัณหาเป็นเหตุ^500\nมีตัณหาเป็นที่ตั้งขึ้น^500\nมีตัณหาเป็นกำเนิด^500\nมีตัณหาเป็นแดนเกิด^500\nก็ตัณหานี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นที่ตั้งขึ้น^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด',
        'ตัณหามีเวทนาเป็นเหตุ^500\nมีเวทนาเป็นที่ตั้งขึ้น^500\nมีเวทนาเป็นกำเนิด^500\nมีเวทนาเป็นแดนเกิด^500\nก็เวทนานี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นที่ตั้งขึ้น^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด^500\nเวทนามีผัสสะเป็นเหตุ^500\nมีผัสสะเป็นที่ตั้งขึ้น^500\nมีผัสสะเป็นกำเนิด^500\nมีผัสสะเป็นแดนเกิด',
        'ก็ผัสสะนี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นที่ตั้งขึ้น^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด^500\nผัสสะมีสฬายตนะเป็นเหตุ^500\nมีสฬายตนะเป็นที่ตั้งขึ้น^500\nมีสฬายตนะเป็นกำเนิด^500\nมีสฬายตนะเป็นแดนเกิด^500\nก็สฬายตนะนี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นที่ตั้งขึ้น^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด^500\nสฬายตนะมีนามรูปเป็นเหตุ^500\nมีนามรูปเป็นที่ตั้งขึ้น^500\nมีนามรูปเป็นกำเนิด^500\nมีนามรูปเป็นแดนเกิด',
        'ก็นามรูปนี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นที่ตั้งขึ้น^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด^500\nนามรูปมีวิญญาณเป็นเหตุ^500\nมีวิญญาณเป็นที่ตั้งขึ้น^500\nมีวิญญาณเป็นกำเนิด^500\nมีวิญญาณเป็นแดนเกิด^500\nก็วิญญาณนี้มีอะไรเป็นเหตุ^500\nมีอะไรเป็นที่ตั้งขึ้น^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด^500\nวิญญาณมีสังขารเป็นเหตุ^500\nมีสังขารเป็นที่ตั้งขึ้น^500\nมีสังขารเป็นกำเนิด^500\nมีสังขารเป็นแดนเกิด^500\nก็สังขารเหล่านี้^500\nมีอะไรเป็นเหตุ^500\nมีอะไรเป็นที่ตั้งขึ้น^500\nมีอะไรเป็นกำเนิด^500\nมีอะไรเป็นแดนเกิด',
        'สังขารทั้งหลายมีอวิชชาเป็นเหตุ^500\nมีอวิชชาเป็นที่ตั้งขึ้น^500\nมีอวิชาเป็นกำเนิด^500\nมีวิชาเป็นแดนเกิด^500\nดูกรภิกษุทั้งหลาย^500\nเพราะอวิชชาเป็นปัจจัยจึงมีสังขาร^500\nเพราะสังขารเป็นปัจจัยจึงมีวิญญาณ^500\nดังพรรณนามาฉะนี้^500\nความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้^500\nย่อมมีด้วยประการอย่างนี้^500\nก็เพราะอวิชชานั่นแหละดับ^500\nด้วยการสำรอกโดยไม่เหลือ^500\nสังขารจึงดับ^500\nเพราะสังขารดับวิญญาณจึงดับ^500\nความดับแห่งกองทุกข์ทั้งมวลนี้^500\nย่อมมีด้วยประการอย่างนี้'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อาหารสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0508;