import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0406 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'อาฬวกสูตรที่ 12^500\nอาฬวกยักษ์ถามปัญหาพระพุทธเจ้า^500\nอาฬวกยักษ์ทูลถามว่า^500\nอะไรหนอเป็นเครื่องปลื้มใจ^500\nอันประเสริฐของคนในโลกนี้^500\nอะไรหนอบุคคลประพฤติดี^500\nนำความสุขมาให้^500\nอะไรหนอเป็นรสอันล้ำเลิศ^500\nกว่ารสทั้งหลาย^500\nนักปราชญ์ทั้งหลายกล่าวชีวิต^500\nของผู้ที่เป็นอยู่อย่างไรว่าประเสริฐสุดฯ',
        'พระผู้มีพระภาคตรัสตอบว่า^500\nศรัทธาเป็นทรัพย์^500\nอันประเสริฐของคนในโลกนี้^500\nธรรมอันบุคคลประพฤติดีแล้ว^500\nนำสุขมาให้^500\nความสัตย์แล^500\nเป็นรสอันล้ำเลิศกว่ารสทั้งหลาย^500\nนักปราชญ์ทั้งหลาย^500\nกล่าวชีวิตของผู้ที่เป็นอยู่^500\nด้วยปัญญาว่าประเสริฐสุดฯ',
        'อาฬวกยักษ์ทูลถามต่อไปว่า^500\nคนข้ามโอฆะได้อย่างไรหนอ^500\nข้ามอรรณพได้อย่างไร^500\nล่วงทุกข์ได้อย่างไร^500\nบริสุทธิ์ได้อย่างไร',
        'พระผู้มีพระภาคตรัสตอบว่า^500\nคนข้ามโอฆะได้ด้วยศรัทธา^500\nข้ามอรรณพได้ด้วยความไม่ประมาท^500\nล่วงทุกข์ได้ด้วยความเพียร^500\nบริสุทธิ์ได้ด้วยปัญญา',
        'อาฬวกยักษ์ทูลถามต่อไปว่า^500\nคนได้ปัญญาอย่างไรหนอ^500\nทำอย่างไรจึงจะหาทรัพย์ได้^500\nคนได้ชื่อเสียงอย่างไรหนอ^500\nทำอย่างไรจึงจะผูกมิตรไว้ได้^500\nคนละโลกนี้ไปสู่โลกหน้า^500\nทำอย่างไรจึงไม่เศร้าโศกฯ',
        'พระผู้มีพระภาคตรัสตอบว่า^500\nบุคคลเชื่อธรรมของพระอรหันต์^500\nเพื่อบรรลุนิพพาน^500\nฟังอยู่ด้วยดีย่อมได้ปัญญา^500\nเป็นผู้ไม่ประมาทมีวิจารณ์^500\nคนทำเหมาะเจาะไม่ทอดธุระ^500\nเป็นผู้หมั่นย่อมหาทรัพย์ได้^500\nคนย่อมได้ชื่อเสียง^500\nเพราะความสัตย์^500\nผู้ให้ย่อมผูกมิตรไว้ได้^500\nบุคคลใดผู้อยู่ครองเรือน^500\nประกอบด้วยศรัทธา^500\nมีธรรม 4 ประการนี้^500\nคือสัจจะ ธรรม ฐิติ จาคะ ^500\nบุคคลนั้นแลละโลกนี้ไป^500\nย่อมไม่เศร้าโศก^500\nเชิญถามสมณพราหมณ์เป็นอันมาก^500\nเหล่าอื่นว่า^500\nโลกนี้มีอะไรยิ่งกว่า^500\nสัจจะ ธรรม จาคะ และขันติ',
        'อาฬวกยักษ์ทูลถามว่า^500\nทำไมหนอข้าพเจ้าจึงต้องถาม^500\nสมณพราหมณ์เป็นอันมาก^500\nในบัดนี้วันนี้ข้าพเจ้ารู้ชัดถึง^500\nสัมปรายิกประโยชน์^500\nพระพุทธเจ้าเสด็จมาถึงเมืองอาฬวี^500\nวันนี้ข้าพเจ้ารู้ชัด^500\nถึงการที่บุคคลให้ในที่ใดมีผลมาก^500\nข้าพเจ้าจักเที่ยว^500\nจากบ้านไปสู่บ้าน^500\nจากบุรีไปสู่บุรี^500\nพลางนมัสการสัมมาสัมพุทธเจ้า^500\nและพระธรรมซึ่งเป็นธรรมที่ดีฯ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อาฬวกสูตรที่ 12</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0406;