import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0508 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'อาหารสูตร\nว่าด้วยอาหาร 4 อย่าง\nข้าพเจ้าได้สดับมาอย่างนี้\nสมัยหนึ่งพระผู้มีพระภาค\nประทับอยู่ ณ พระเชตวัน\nอารามของท่านอนาถบิณฑิกเศรษฐี\nเขตพระนครสาวัตถี',
        'พระผู้มีพระภาคได้ตรัสว่า\nดูกรภิกษุทั้งหลาย\nอาหาร 4 เหล่านี้ย่อมเป็นไป\nเพื่อความดำรงอยู่ของหมู่สัตว์\nผู้เกิดมาแล้ว\nหรือเพื่ออนุเคราะห์หมู่สัตว์\nผู้แสวงหาที่เกิด',
        'อาหาร 4 เป็นไฉน\nคือ 1 กวฬิงการาหารหยาบหรือละเอียด \n2 ผัสสาหาร\n3 มโนสัญเจตนาหาร \n4 วิญญาณาหาร\nอาหาร 4 เหล่านี้แลย่อมเป็นไป\nเพื่อความดำรงอยู่ของหมู่สัตว์\nผู้เกิดมาแล้ว\nหรือเพื่ออนุเคราะห์หมู่สัตว์\nผู้แสวงหาที่เกิด',
        'ดูกรภิกษุทั้งหลาย\nก็อาหาร 4 เหล่านี้มีอะไรเป็นเหตุ\nมีอะไรเป็นที่ตั้งขึ้น\nมีอะไรเป็นกำเนิด\nมีอะไรเป็นแดนเกิด\nอาหาร 4 เหล่านี้มีตัณหาเป็นเหตุ\nมีตัณหาเป็นที่ตั้งขึ้น\nมีตัณหาเป็นกำเนิด\nมีตัณหาเป็นแดนเกิด\nก็ตัณหานี้มีอะไรเป็นเหตุ\nมีอะไรเป็นที่ตั้งขึ้น\nมีอะไรเป็นกำเนิด\nมีอะไรเป็นแดนเกิด',
        'ตัณหามีเวทนาเป็นเหตุ\nมีเวทนาเป็นที่ตั้งขึ้น\nมีเวทนาเป็นกำเนิด\nมีเวทนาเป็นแดนเกิด\nก็เวทนานี้มีอะไรเป็นเหตุ\nมีอะไรเป็นที่ตั้งขึ้น\nมีอะไรเป็นกำเนิด\nมีอะไรเป็นแดนเกิด\nเวทนามีผัสสะเป็นเหตุ\nมีผัสสะเป็นที่ตั้งขึ้น\nมีผัสสะเป็นกำเนิด\nมีผัสสะเป็นแดนเกิด',
        'ก็ผัสสะนี้มีอะไรเป็นเหตุ\nมีอะไรเป็นที่ตั้งขึ้น\nมีอะไรเป็นกำเนิด\nมีอะไรเป็นแดนเกิด\nผัสสะมีสฬายตนะเป็นเหตุ\nมีสฬายตนะเป็นที่ตั้งขึ้น\nมีสฬายตนะเป็นกำเนิด\nมีสฬายตนะเป็นแดนเกิด\nก็สฬายตนะนี้มีอะไรเป็นเหตุ\nมีอะไรเป็นที่ตั้งขึ้น\nมีอะไรเป็นกำเนิด\nมีอะไรเป็นแดนเกิด\nสฬายตนะมีนามรูปเป็นเหตุ\nมีนามรูปเป็นที่ตั้งขึ้น\nมีนามรูปเป็นกำเนิด\nมีนามรูปเป็นแดนเกิด',
        'ก็นามรูปนี้มีอะไรเป็นเหตุ\nมีอะไรเป็นที่ตั้งขึ้น\nมีอะไรเป็นกำเนิด\nมีอะไรเป็นแดนเกิด\nนามรูปมีวิญญาณเป็นเหตุ\nมีวิญญาณเป็นที่ตั้งขึ้น\nมีวิญญาณเป็นกำเนิด\nมีวิญญาณเป็นแดนเกิด\nก็วิญญาณนี้มีอะไรเป็นเหตุ\nมีอะไรเป็นที่ตั้งขึ้น\nมีอะไรเป็นกำเนิด\nมีอะไรเป็นแดนเกิด\nวิญญาณมีสังขารเป็นเหตุ\nมีสังขารเป็นที่ตั้งขึ้น\nมีสังขารเป็นกำเนิด\nมีสังขารเป็นแดนเกิด\nก็สังขารเหล่านี้\nมีอะไรเป็นเหตุ\nมีอะไรเป็นที่ตั้งขึ้น\nมีอะไรเป็นกำเนิด\nมีอะไรเป็นแดนเกิด',
        'สังขารทั้งหลายมีอวิชชาเป็นเหตุ\nมีอวิชชาเป็นที่ตั้งขึ้น\nมีอวิชาเป็นกำเนิด\nมีวิชาเป็นแดนเกิด\nดูกรภิกษุทั้งหลาย\nเพราะอวิชชาเป็นปัจจัยจึงมีสังขาร\nเพราะสังขารเป็นปัจจัยจึงมีวิญญาณ\nดังพรรณนามาฉะนี้\nความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้\nย่อมมีด้วยประการอย่างนี้\nก็เพราะอวิชชานั่นแหละดับ\nด้วยการสำรอกโดยไม่เหลือ\nสังขารจึงดับ\nเพราะสังขารดับวิญญาณจึงดับ\nความดับแห่งกองทุกข์ทั้งมวลนี้\nย่อมมีด้วยประการอย่างนี้'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อาหารสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0508;