import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0606 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'พระนครสาวัตถี^500\nครั้งนั้นแล^500\nภิกษุรูปหนึ่ง^500\nเข้าไปเฝ้าพระผู้มีพระภาค^500\nถึงที่ประทับ ฯลฯ^500\nครั้นแล้ว^500\nได้ทูลถามพระผู้มีพระภาคว่า^500\nข้าแต่พระองค์ผู้เจริญ^500\nที่เรียกว่า อวิชชา^500\nอวิชชา ดังนี้^500\nอวิชชาเป็นไฉนหนอแล^500\nและบุคคลเป็นผู้ประกอบ^500\nด้วยอวิชชาด้วยเหตุเพียงเท่าไร?^500\nพระผู้มีพระภาคตรัสตอบว่า^500\nดูกรภิกษุ^500\nปุถุชนผู้ไม่ได้สดับแล้วในโลกนี้^500\nย่อมไม่รู้ชัด^500\nตามความเป็นจริง^500\nซึ่งรูปอันมีความเกิดขึ้น^500\nเป็นธรรมดาว่า^500\nรูปมีความเกิดขึ้นเป็นธรรมดา^500\nย่อมไม่รู้ชัด^500\nตามความเป็นจริง^500\nซึ่งรูปอันมีความเสื่อมไป^500\nเป็นธรรมดาว่า^500\nรูปมีความเสื่อมไปเป็นธรรมดา^500\nย่อมไม่รู้ชัด^500\nตามความเป็นจริง^500\nซึ่งรูปอันมีความเกิดขึ้น^500\nและความเสื่อมไป^500\nเป็นธรรมดาว่า^500\nรูปมีความเกิดขึ้น^500\nและความเสื่อมไปเป็นธรรมดา^500\nย่อมไม่รู้ชัด^500\nตามความเป็นจริง^500\nซึ่งเวทนา^500\nย่อมไม่รู้ชัดตาม^500\nความเป็นจริง^500\nซึ่งสัญญา^500\nย่อมไม่รู้ชัด^500\nตามความเป็นจริง^500\nซึ่งสังขาร^500\nย่อมไม่รู้ชัด^500\nตามความเป็นจริง^500\nซึ่งวิญญาณ^500\nอันมีความเกิดขึ้น^500\nเป็นธรรมดาว่า^500\nวิญญาณมีความเกิดขึ้น^500\nเป็นธรรมดา^500\nย่อมไม่รู้ชัด^500\nตามความเป็นจริง^500\nซึ่งวิญญาณ^500\nอันมีความเสื่อมไป^500\nเป็นธรรมดาว่า^500\nวิญญาณมีความเสื่อมไป^500\nเป็นธรรมดา^500\nย่อมไม่รู้ชัด^500\nตามความเป็นจริง^500\nซึ่งวิญญาณ^500\nอันมีความเกิดขึ้น^500\nและความเสื่อมไป^500\nเป็นธรรมดาว่า^500\nวิญญาณมีความเกิดขึ้น^500\nและความเสื่อมไป^500\nเป็นธรรมดา^500\nดูกรภิกษุ นี้เรียกว่า^500\nอวิชชา และบุคคล^500\nเป็นผู้ประกอบด้วยอวิชชา^500\nด้วยเหตุเพียงเท่านี้^500\nเมื่อพระผู้มีพระภาค^500\nตรัสอย่างนี้แล้ว^500\nภิกษุนั้นทูลถามว่า^500\nข้าแต่พระองค์ผู้เจริญ^500\nที่เรียกว่า วิชชา^500\nวิชชา ดังนี้^500\nวิชชาเป็นไฉนหนอแล^500\nและบุคคล^500\nเป็นผู้ประกอบด้วยวิชชา^500\nด้วยเหตุเพียงเท่าไร?^500\nพระผู้มีพระภาคตรัสตอบว่า^500\nดูกรภิกษุ^500\nอริยสาวกผู้ได้สดับแล้ว^500\nในธรรมวินัยนี้^500\nย่อมรู้ชัดตามความเป็นจริง^500\nซึ่งรูป อันมีความเกิดขึ้น^500\nเป็นธรรมดาว่า^500\nรูปมีความเกิดขึ้น^500\nเป็นธรรมดา^500\nย่อมรู้ชัดตามความเป็นจริง^500\nซึ่งรูป อันมีความเสื่อมไป^500\nเป็นธรรมดาว่า^500\nรูปมีความเสื่อมไป^500\nเป็นธรรมดา^500\nย่อมรู้ชัดตามความเป็นจริง^500\nซึ่งรูป อันมีความเกิดขึ้น^500\nและความเสื่อมไป^500\nเป็นธรรมดาว่า^500\nรูปมีความเกิดขึ้น^500\nและความเสื่อมไป^500\nเป็นธรรมดา^500\nย่อมรู้ชัดตามความเป็นจริง^500\nซึ่งเวทนา^500\nย่อมรู้ชัดตามความเป็นจริง^500\nซึ่งสัญญา^500\nย่อมรู้ชัดตามความเป็นจริง^500\nซึ่งสังขาร^500\nย่อมรู้ชัดตามความเป็นจริง^500\nซึ่งวิญญาณ^500\nอันมีความเกิดขึ้น^500\nเป็นธรรมดาว่า^500\nวิญญาณมีความเกิดขึ้น^500\nเป็นธรรมดา^500\nย่อมรู้ชัดตามความเป็นจริง^500\nซึ่งวิญญาณ^500\nอันมีความเสื่อมไป^500\nเป็นธรรมดาว่า^500\nวิญญาณมีความเสื่อมไป^500\nเป็นธรรมดา^500\nย่อมรู้ชัดตามความเป็นจริง^500\nซึ่งวิญญาณ^500\nอันมีความเกิดขึ้น^500\nและความเสื่อมไป^500\nเป็นธรรมดาว่า^500\nวิญญาณมีความ^500\nเกิดขึ้นและเสื่อมไป^500\nเป็นธรรมดา^500\nดูกรภิกษุ นี้เรียกว่า วิชชา^500\nและบุคคลเป็นผู้ประกอบด้วยวิชชา^500\nด้วยเหตุเพียงเท่านี้แล'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>สมุทยธัมมสูตรที่ ๑</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0606;