import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0507 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'วิภังคสูตร^500\nว่าด้วยจำแนกปฏิจจสมุปบาท^500\nพระผู้มีพระภาคประทับอยู่ ณ พระเชตวัน^500\nอารามของท่านอนาถบิณฑิกเศรษฐี^500\nเขตพระนครสาวัตถี^500\nพระผู้มีพระภาคได้ตรัสว่า^500\nดูกรภิกษุทั้งหลาย^500\nเราจักแสดงจักจำแนก^500\nปฏิจจสมุปบาทแก่พวกเธอ^500\nพวกเธอจงฟังปฏิจจสมุปบาทนั้น^500\nจงใส่ใจให้ดีเถิดเราจักกล่าว^500\nภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคแล้ว',
        'พระผู้มีพระภาคได้ตรัสว่า^500\nดูกรภิกษุทั้งหลาย^500\nก็ปฏิจจสมุปบาทเป็นไฉน^500\nดูกรภิกษุทั้งหลาย^500\nเพราะอวิชชาเป็นปัจจัยจึงมีสังขาร^500\nเพราะสังขารเป็นปัจจัยจึงมีวิญญาณ^500\nเพราะวิญญาณเป็นปัจจัยจึงมีนามรูป^500\nเพราะนามรูปเป็นปัจจัยจึงมีสฬายตนะ^500\nเพราะสฬายตนะเป็นปัจจัยจึงมีผัสสะ^500\nเพราะผัสสะเป็นปัจจัยจึงมีเวทนา^500\nเพราะเวทนาเป็นปัจจัยจึงมีตัณหา^500\nเพราะตัณหาเป็นปัจจัยจึงมีอุปาทาน^500\nเพราะอุปาทานเป็นปัจจัยจึงมีภพ^500\nเพราะภพเป็นปัจจัยจึงมีชาติ^500\nเพราะชาติเป็นปัจจัยจึงมีชรา^500\nและมรณะโสกะปริเทวะ^500\nทุกข์โทมนัสและอุปายาส^500\nความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้^500\nย่อมมีด้วยประการอย่างนี้',
        'ดูกรภิกษุทั้งหลาย^500\nก็ชราและมรณะเป็นไฉน^500\nความแก่ ภาวะของความแก่^500\nฟันหลุด ผมหงอก หนังเป็นเกลียว^500\nความเสื่อมแห่งอายุ ^500\nความแก่หง่อมแห่งอินทรีย์^500\nในหมู่สัตว์นั้นๆของเหล่าสัตว์นั้นๆ^500\nนี้เรียกว่าชรา^500\nก็มรณะเป็นไฉน^500\nความเคลื่อนภาวะของความเคลื่อน^500\nความทำลายความอันตรธานมฤตยู^500\nความตาย กาลกิริยา^500\nความแตกแห่งขันธ์^500\nความทอดทิ้งซากศพ^500\nความขาดแห่งชีวิตินทรีย์^500\nจากนั้นของเหล่าสัตว์นั้นๆ^500\nนี้เรียกว่ามรณะ^500\nชราและมรณะดังพรรณนามาฉะนี้^500\nเรียกว่าชราและมรณะ',
        'ก็ชาติเป็นไฉน^500\nความเกิดความบังเกิด^500\nความหยั่งลง^500\nเกิด^500\nเกิดจำเพาะ^500\nความปรากฏแห่งขันธ์^500\nความได้อายตนะครบในหมู่สัตว์นั้นๆ^500\nของเหล่าสัตว์นั้นๆ^500\nนี้เรียกว่าชาติ^500\nก็ภพเป็นไฉน^500\nภพ 3 เหล่านี้คือ^500\nกามภพ รูปภพ อรูปภพ^500\nนี้เรียกว่าภพ^500\nก็อุปาทานเป็นไฉน^500\nอุปาทาน 4 เหล่านี้^500\nคือกามุปาทาน^500\nทิฏฐุปาทาน^500\nสีลพัตตุปาทาน^500\nอัตตวาทุปาทาน^500\nนี้เรียกว่าอุปาทาน',
        'ก็ตัณหาเป็นไฉน^500\nตัณหา 6 หมวดเหล่านี้คือ^500\nรูปตัณหา สัททตัณหา^500\nคันธตัณหา รสตัณหา^500\nโผฏฐัพพะตัณหา ธัมมตัณหา^500\nนี้เรียกว่าตัณหา^500\nก็เวทนาเป็นไฉน^500\nเวทนา 6 หมวดเหล่านี้คือ^500\nจักขุสัมผัสสชาเวทนา^500\nโสตสัมผัสสชาเวทนา^500\nฆานสัมมผัสสชาเวทนา^500\nชิวหาสัมผัสสชาเวทนา^500\nกายสัมผัสสชาเวทนา^500\nมโนสัมผัสสชาเวทนา^500\nนี้เรียกว่าเวทนา^500\nก็ผัสสะเป็นไฉน^500\nผัสสะ 6 หมวดเหล่านี้คือ^500\nจักขุสัมผัส^500\nโสตะสัมผัส^500\nฆานสัมผัส^500\nชิวหาสัมผัส^500\nกายสัมผัส^500\nมโนสัมผัส^500\nนี้เรียกว่าผัสสะ',
        'ก็สฬายตนะเป็นไฉน^500\nสฬายตนะคือ^500\nตา หู จมูก^500\nลิ้น กาย ใจ^500\nนี้เรียกว่าสฬายตนะ^500\nก็นามรูปเป็นไฉน^500\nเวทนา สัญญา เจตนา^500\nผัสสะ มนสิการ^500\nนี้เรียกว่านาม^500\nมหาภูตรูป 4^500\nและรูปที่อาศัยมหาภูตรูป 4^500\nนี้เรียกว่ารูป^500\nนามและรูปดังพรรณนามาฉะนี้^500\nเรียกว่านามรูป^500\nก็วิญญาณเป็นไฉน^500\nวิญญาณ 6 หมวดเหล่านี้คือ^500\nจักขุวิญญาณ^500\nโสตะวิญญาณ^500\nฆานวิญญาณ^500\nชิวหาวิญญาณ^500\nกายวิญญาณ^500\nมโนวิญญาณ^500\nนี้เรียกว่าวิญญาณ',
        'ก็สังขารเป็นไฉน^500\nสังขาร 3 เหล่านี้คือ^500\nกายสังขาร^500\nวจีสังขาร^500\nจิตสังขาร^500\nนี้เรียกว่าสังขาร^500\nก็อวิชชาเป็นไฉน^500\nความไม่รู้ในทุกข์^500\nความไม่รู้ในเหตุเกิดแห่งทุกข์^500\nความไม่รู้ในความดับทุกข์^500\nความไม่รู้ในปฏิปทา^500\nที่จะให้ถึงความดับทุกข์^500\nนี้เรียกว่าอวิชา^500\nดูกรภิกษุทั้งหลาย^500\nเพราะอวิชชาเป็นปัจจัยจึงมีสังขาร^500\nเพราะสังขารเป็นปัจจัยจึงมีวิญญาณ^500\nดังพรรณนามาฉะนี้^500\nความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้^500\nย่อมมีด้วยประการอย่างนี้^500\nก็เพราะอวิชชานั่นแหละ^500\nดับด้วยการสำรอกโดยไม่เหลือ^500\nสังขารจึงดับ^500\nเพราะสังขารดับวิญญาณจึงดับ^500\nความดับแห่งกองทุกข์ทั้งมวลนี้^500\nย่อมมีด้วยประการอย่างนี้'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>วิภังคสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0507;