import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0406 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'อาฬวกสูตรที่ 12\nอาฬวกยักษ์ถามปัญหาพระพุทธเจ้า\nอาฬวกยักษ์ทูลถามว่า\nอะไรหนอเป็นเครื่องปลื้มใจ\nอันประเสริฐของคนในโลกนี้\nอะไรหนอบุคคลประพฤติดี\nนำความสุขมาให้\nอะไรหนอเป็นรสอันล้ำเลิศ\nกว่ารสทั้งหลาย\nนักปราชญ์ทั้งหลายกล่าวชีวิต\nของผู้ที่เป็นอยู่อย่างไรว่าประเสริฐสุดฯ',
        'พระผู้มีพระภาคตรัสตอบว่า\nศรัทธาเป็นทรัพย์\nอันประเสริฐของคนในโลกนี้\nธรรมอันบุคคลประพฤติดีแล้ว\nนำสุขมาให้\nความสัตย์แล\nเป็นรสอันล้ำเลิศกว่ารสทั้งหลาย\nนักปราชญ์ทั้งหลาย\nกล่าวชีวิตของผู้ที่เป็นอยู่\nด้วยปัญญาว่าประเสริฐสุดฯ',
        'อาฬวกยักษ์ทูลถามต่อไปว่า\nคนข้ามโอฆะได้อย่างไรหนอ\nข้ามอรรณพได้อย่างไร\nล่วงทุกข์ได้อย่างไร\nบริสุทธิ์ได้อย่างไร',
        'พระผู้มีพระภาคตรัสตอบว่า\nคนข้ามโอฆะได้ด้วยศรัทธา\nข้ามอรรณพได้ด้วยความไม่ประมาท\nล่วงทุกข์ได้ด้วยความเพียร\nบริสุทธิ์ได้ด้วยปัญญา',
        'อาฬวกยักษ์ทูลถามต่อไปว่า\nคนได้ปัญญาอย่างไรหนอ\nทำอย่างไรจึงจะหาทรัพย์ได้\nคนได้ชื่อเสียงอย่างไรหนอ\nทำอย่างไรจึงจะผูกมิตรไว้ได้\nคนละโลกนี้ไปสู่โลกหน้า\nทำอย่างไรจึงไม่เศร้าโศกฯ',
        'พระผู้มีพระภาคตรัสตอบว่า\nบุคคลเชื่อธรรมของพระอรหันต์\nเพื่อบรรลุนิพพาน\nฟังอยู่ด้วยดีย่อมได้ปัญญา\nเป็นผู้ไม่ประมาทมีวิจารณ์\nคนทำเหมาะเจาะไม่ทอดธุระ\nเป็นผู้หมั่นย่อมหาทรัพย์ได้\nคนย่อมได้ชื่อเสียง\nเพราะความสัตย์\nผู้ให้ย่อมผูกมิตรไว้ได้\nบุคคลใดผู้อยู่ครองเรือน\nประกอบด้วยศรัทธา\nมีธรรม 4 ประการนี้\nคือสัจจะ ธรรม ฐิติ จาคะ \nบุคคลนั้นแลละโลกนี้ไป\nย่อมไม่เศร้าโศก\nเชิญถามสมณพราหมณ์เป็นอันมาก\nเหล่าอื่นว่า\nโลกนี้มีอะไรยิ่งกว่า\nสัจจะ ธรรม จาคะ และขันติ',
        'อาฬวกยักษ์ทูลถามว่า\nทำไมหนอข้าพเจ้าจึงต้องถาม\nสมณพราหมณ์เป็นอันมาก\nในบัดนี้วันนี้ข้าพเจ้ารู้ชัดถึง\nสัมปรายิกประโยชน์\nพระพุทธเจ้าเสด็จมาถึงเมืองอาฬวี\nวันนี้ข้าพเจ้ารู้ชัด\nถึงการที่บุคคลให้ในที่ใดมีผลมาก\nข้าพเจ้าจักเที่ยว\nจากบ้านไปสู่บ้าน\nจากบุรีไปสู่บุรี\nพลางนมัสการสัมมาสัมพุทธเจ้า\nและพระธรรมซึ่งเป็นธรรมที่ดีฯ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อาฬวกสูตรที่ 12</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0406;