import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0605 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'สมัยหนึ่งพระผู้มีพระภาค^500\nประทับอยู่ ณ กูฏาคารศาลา^500\nป่ามหาวัน^500\nใกล้พระนครเวสาลี^500\nก็สมัยนั้น^500\nท่านพระอนุราธะ^500\nอยู่ที่กระท่อมในป่า^500\nไม่ไกลพระผู้มีพระภาค^500\nครั้งนั้น^500\nอัญญเดียรถีย์ปริพาชก^500\nพากันเข้าไปหา^500\nท่านพระอนุราธะจนถึงที่อยู่^500\nได้สนทนาปราศรัย^500\nกับท่านพระอนุราธะ^500\nครั้นผ่านการสนทนาปราศรัย^500\nพอให้ระลึกถึงกันแล้ว^500\nจึงนั่ง ณ ที่ควรส่วนข้างหนึ่งแล้ว^500\nจึงได้กล่าวกะท่านอนุราธะว่า^500\nดูกรท่านอนุราธะ^500\nพระตถาคตเป็นอุดมบุรุษ^500\nเป็นยอดบุรุษ^500\nทรงถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะทรงบัญญัติ^500\nย่อมทรงบัญญัติ^500\nในฐานะ ๔ นี้^500\nคือสัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑^500\nย่อมไม่เกิดอีก ๑^500\nย่อมเกิดอีกก็มี^500\nย่อมไม่เกิดอีกก็มี ๑^500\nย่อมไม่เกิดอีก^500\nอีกก็หามิได้ ๑^500\nเมื่อพวกปริพาชก^500\nกล่าวอย่างนั้นแล้ว^500\nท่านพระอนุราธะ^500\nได้กล่าวกะอัญญเดียรถีย์^500\nปริพาชกเหล่านั้นว่า^500\nดูกรท่านทั้งหลาย^500\nพระตถาคตทรงเป็นอุดมบุรุษ^500\nทรงเป็นยอดบุรุษ^500\nทรงถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะทรงบัญญัติ^500\nย่อมทรงบัญญัติ^500\nนอกจากฐานะ ๔ เหล่านี้^500\nคือ สัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑^500\nย่อมไม่เกิดอีก ๑^500\nย่อมเกิดอีกก็มี^500\nย่อมไม่เกิดก็มี ๑^500\nย่อมเกิดอีกก็หามิได้^500\nย่อมไม่เกิดก็หามิได้^500\nย่อมไม่เกิดอีกก็หามิได้ ๑^500\nเมื่อท่านพระอนุราธะ^500\nกล่าวอย่างนั้นแล้ว^500\nอัญญเดียรถีย์ปริพาชก^500\nเหล่านั้นได้กล่าว^500\nกะท่านพระอนุราธะว่า^500\nภิกษุนี้จักเป็นภิกษุใหม่^500\nบวชแล้วไม่นาน^500\nก็หรือว่าเป็นภิกษุเถระ^500\nแต่โง่เขลาไม่ฉลาด^500\nครั้งนั้น^500\nพวกอัญญเดียรถีย์ปริพาชกกล่าว^500\nรุกรานท่านพระอนุราธะ^500\nด้วยวาทะว่าเป็นภิกษุใหม่^500\nและเป็นผู้โง่เขลาแล้ว^500\nพากันลุกจากอาสนะหลีกไป',
        'เมื่ออัญญเดียรถีย์^500\nปริพาชกเหล่านั้น^500\nหลีกไปแล้วไม่นาน^500\nท่านพระอนุราธะได้มี^500\nความคิดว่า^500\nถ้าอัญญเดียรถีย์^500\nปริพาชกเหล่านั้น^500\nพึงถามเราต่อไป^500\nเมื่อเราพยากรณ์อย่างไร^500\nจึงจะชื่อว่า^500\nไม่เป็นผู้กล่าว^500\nตามที่อัญญเดียรถีย์ปริพาชก^500\nเหล่านั้นกล่าวแล้ว^500\nและชื่อว่าเป็นผู้กล่าวตาม^500\nที่พระผู้มีพระภาคตรัสแล้ว^500\nไม่พึงกล่าวตู่พระผู้มีพระภาค^500\nด้วยคำอันไม่จริง^500\nและพึงพยากรณ์ธรรม^500\nสมควรแก่ธรรม^500\nทั้งการคล้อยตามวาทะที่ถูกไรๆ^500\nจะไม่พึงถึงฐานะ^500\nอันวิญญูชนจะติเตียนได้^500\nลำดับนั้น^500\nท่านพระอนุราธะ^500\nจึงเข้าไปเฝ้าพระผู้มีพระภาค^500\nจนถึงที่ประทับ ฯลฯ^500\nแล้วกราบทูลพระผู้มีพระภาคว่า^500\nข้าแต่พระองค์ผู้เจริญ^500\nขอประทานพระวโรกาส^500\nข้าพระองค์อยู่ที่กระท่อมในป่า^500\nไม่ไกลพระผู้มีพระภาค^500\nครั้งนั้น^500\nพวกอัญญเดียรถีย์^500\nปริพาชกเป็นอันมาก^500\nพากันเข้าไปหาข้าพระองค์ถึงที่อยู่ ฯลฯ^500\nกล่าวกะข้าพระองค์ว่า^500\nดูกรท่านพระอนุราธะ^500\nพระตถาคตทรงเป็นอุดมบุรุษ^500\nทรงเป็นยอดบุรุษ^500\nทรงถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะทรงบัญญัติ^500\nในฐานะ ๔ เหล่านี้^500\nคือ สัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑^500\nย่อมไม่เกิดอีก ๑^500\nย่อมเกิดอีกก็มี^500\nย่อมไม่เกิดอีกก็มี ๑^500\nย่อมเกิดก็หามิได้^500\nย่อมไม่เกิดก็หามิได้ ๑^500\nข้าแต่พระองค์ผู้เจริญ^500\nเมื่อพวกอัญญเดียรถีย์^500\nปริพาชกกล่าวอย่างนี้แล้ว^500\nข้าพระองค์จึงได้กล่าว^500\nกะพวกเขาว่า^500\nดูกรท่านทั้งหลาย^500\nพระตถาคตทรงเป็นอุดมบุรุษ^500\nทรงเป็นยอดบุรุษ^500\nทรงถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะทรงบัญญัติ^500\nย่อมทรงบัญญัติ^500\nนอกจากฐานะ ๔ เหล่านี้ คือ^500\nสัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑^500\nย่อมไม่เกิดอีก ๑^500\nย่อมเกิดอีกก็มี^500\nย่อมไม่เกิดอีกก็มี ๑^500\nย่อมเกิดอีกก็หามิได้^500\nย่อมไม่เกิดอีกก็หามิได้ ๑^500\nข้าแต่พระองค์ผู้เจริญ^500\nเมื่อข้าพระองค์^500\nกล่าวอย่างนั้นแล้ว^500\nอัญญเดียรถีย์ปริพาชกเหล่านั้น^500\nได้กล่าวกะข้าพระองค์ว่า^500\nภิกษุนี้จักเป็นภิกษุใหม่^500\nบวชไม่นาน^500\nก็หรือว่าเป็นเถระ^500\nแต่โง่เขลาไม่ฉลาด^500\nข้าแต่พระองค์ผู้เจริญ^500\nอัญญเดียรถีย์ปริพาชกเหล่านั้น^500\nรุกรานข้าพระองค์ด้วยวาทะว่า^500\nเป็นผู้ใหม่^500\nเป็นผู้เขลาแล้ว^500\nลุกจากอาสนะหลีกไป^500\nเมื่ออัญญเดียรถีย์^500\nปริพาชกเหล่านั้น^500\nหลีกไปแล้วไม่นาน^500\nข้าพระองค์เกิดความคิดว่า^500\nถ้าอัญญเดียรถีย์^500\nปริพาชกเหล่านั้น^500\nพึงถามเราต่อไป^500\nเมื่อเราพยากรณ์อย่างไร^500\nจึงจะชื่อว่าไม่เป็นผู้กล่าว^500\nตามที่อัญญเดียรถีย์ปริพาชก^500\nเหล่านั้นกล่าวแล้ว^500\nและชื่อว่าเป็นผู้กล่าว^500\nตามที่พระผู้มีพระภาคตรัสแล้ว^500\nไม่พึงกล่าวตู่พระผู้มีพระภาค^500\nด้วยคำอันไม่จริง^500\nและพยากรณ์ธรรมสมควรแก่ธรรม^500\nทั้งการคล้อยตามวาทะที่ถูกไรๆ^500\nจะไม่พึงถึงฐานะ^500\nอันวิญญูชนจะติเตียนได้^500\nพระผู้มีพระภาคตรัสถามว่า^500\nดูกรอนุราธะ^500\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nรูปเที่ยงหรือไม่เที่ยง?^500\nอ ไม่เที่ยง พระเจ้าข้า^500\nพ ก็สิ่งใดไม่เที่ยง^500\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า?^500\nอ เป็นทุกข์ พระเจ้าข้า^500\nพ ก็สิ่งใดไม่เที่ยง^500\nเป็นทุกข์^500\nมีความแปรปรวนเป็นธรรมดา^500\nควรหรือหนอ^500\nที่จะตามเห็นสิ่งนั้นว่า^500\nนั่นของเรา^500\nนั่นเป็นเรา^500\nนั่นเป็นตัวตนของเรา?^500\nอ ไม่ควรเห็นอย่างนั้น^500\nพระเจ้าข้า^500\nพ เวทนา สัญญา^500\nสังขาร วิญญาณ^500\nเที่ยงหรือไม่เที่ยง?^500\nอ ไม่เที่ยง พระเจ้าข้า^500\nพ เพราะเหตุนี้แล ฯลฯ^500\nอริยสาวกผู้ได้สดับแล้ว^500\nเห็นอยู่อย่างนี้ ฯลฯ^500\nย่อมรู้ชัดว่า ฯลฯ^500\nกิจอื่นเพื่อความเป็นอย่างนี้มิได้มี^500\nพ ดูกรอนุราธะ^500\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nเธอย่อมเห็นรูป^500\nว่าเป็นสัตว์บุคคลหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นเวทนา สัญญา^500\nสังขาร วิญญาณว่า^500\nเป็นสัตว์บุคคลหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ ดูกรอนุราธะ^500\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nเธอย่อมเห็นว่า^500\nสัตว์บุคคลในรูปหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า^500\nสัตว์บุคคลอื่นจากรูปหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า^500\nสัตว์บุคคลในเวทนาหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า^500\nสัตว์บุคคลอื่นจากเวทนาหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า^500\nสัตว์บุคคลในสัญญาหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า^500\nสัตว์บุคคลอื่นจากสัญญาหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า^500\nสัตว์บุคคลในสังขารหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า^500\nสัตว์บุคคลอื่นจากสังขารหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า^500\nสัตว์บุคคลในวิญญาณหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า^500\nสัตว์บุคคลอื่นจากวิญญาณหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ ดูกรอนุราธะ^500\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nเธอย่อมเห็นว่า สัตว์บุคคล^500\nมีรูป^500\nมีเวทนา^500\nมีสัญญา^500\nมีสังขาร^500\nมีวิญญาณ^500\nอย่างนั้นหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ ดูกรอนุราธะ^500\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nเธอย่อมเห็นว่า^500\nสัตว์บุคคลนี้ไม่มีรูป^500\nไม่มีเวทนา^500\nไม่มีสัญญา^500\nไม่มีสังขาร^500\nไม่มีวิญญาณ^500\nอย่างนั้นหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ ดูกรอนุราธะ^500\nก็โดยที่จริง โดยที่แท้^500\nเธอค้นหาสัตว์บุคคล^500\nในขันธ์ ๕ เหล่านี้^500\nในปัจจุบันไม่ได้เลย^500\nควรแลหรือที่เธอจะพยากรณ์ว่า^500\nพระตถาคตเป็นอุดมบุรุษ^500\nเป็นยอดบุรุษ^500\nถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะบัญญัติ ย่อมบัญญัติ^500\nเว้นจากฐานะ ๔ เหล่านี้^500\nคือ สัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑^500\nย่อมไม่เกิดอีก ๑^500\nย่อมเกิดอีกก็มี^500\nย่อมไม่เกิดอีกก็มี ๑^500\nย่อมเกิดอีกก็หามิได้^500\nย่อมไม่เกิดอีกก็หามิได้ ๑?^500\nอ ข้อนั้นไม่ควรเลย พระเจ้าข้า^500\nพ ถูกละๆ อนุราธะ^500\nทั้งเมื่อก่อนและทั้งบัดนี้^500\nเราย่อมบัญญัติทุกข์^500\nและความดับทุกข์'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อนุราธสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0605;