import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0605 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'สมัยหนึ่งพระผู้มีพระภาค\nประทับอยู่ ณ กูฏาคารศาลา\nป่ามหาวัน^500\nใกล้พระนครเวสาลี^500\nก็สมัยนั้น^500\nท่านพระอนุราธะ\nอยู่ที่กระท่อมในป่า^500\nไม่ไกลพระผู้มีพระภาค^500\nครั้งนั้น^500\nอัญญเดียรถีย์ปริพาชก\nพากันเข้าไปหา\nท่านพระอนุราธะจนถึงที่อยู่^500\nได้สนทนาปราศรัย\nกับท่านพระอนุราธะ^500\nครั้นผ่านการสนทนาปราศรัย\nพอให้ระลึกถึงกันแล้ว^500\nจึงนั่ง ณ ที่ควรส่วนข้างหนึ่งแล้ว^500\nจึงได้กล่าวกะท่านอนุราธะว่า^500\nดูกรท่านอนุราธะ^500\nพระตถาคตเป็นอุดมบุรุษ\nเป็นยอดบุรุษ^500\nทรงถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะทรงบัญญัติ^500\nย่อมทรงบัญญัติ^500\nในฐานะ ๔ นี้\nคือสัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดอีกก็มี ๑\nย่อมไม่เกิดอีก\nก็หามิได้ ๑^500\nเมื่อพวกปริพาชก\nกล่าวอย่างนั้นแล้ว^500\nท่านพระอนุราธะ\nได้กล่าวกะอัญญเดียรถีย์\nปริพาชกเหล่านั้นว่า^500\nดูกรท่านทั้งหลาย^500\nพระตถาคตทรงเป็นอุดมบุรุษ\nทรงเป็นยอดบุรุษ^500\nทรงถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะทรงบัญญัติ\nย่อมทรงบัญญัติ^500\nนอกจากฐานะ ๔ เหล่านี้^500\nคือ สัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดก็มี ๑\nย่อมเกิดอีกก็หามิได้\nย่อมไม่เกิดก็หามิได้\nย่อมไม่เกิดอีกก็หามิได้ ๑^500\nเมื่อท่านพระอนุราธะ\nกล่าวอย่างนั้นแล้ว^500\nอัญญเดียรถีย์ปริพาชก\nเหล่านั้นได้กล่าว\nกะท่านพระอนุราธะว่า^500\nภิกษุนี้จักเป็นภิกษุใหม่\nบวชแล้วไม่นาน^500\nก็หรือว่าเป็นภิกษุเถระ^500\nแต่โง่เขลาไม่ฉลาด^500\nครั้งนั้น\nพวกอัญญเดียรถีย์ปริพาชกกล่าว\nรุกรานท่านพระอนุราธะ^500\nด้วยวาทะว่าเป็นภิกษุใหม่\nและเป็นผู้โง่เขลาแล้ว^500\nพากันลุกจากอาสนะหลีกไป',
        'เมื่ออัญญเดียรถีย์\nปริพาชกเหล่านั้น\nหลีกไปแล้วไม่นาน^500\nท่านพระอนุราธะได้มี\nความคิดว่า^500\nถ้าอัญญเดียรถีย์\nปริพาชกเหล่านั้น^500\nพึงถามเราต่อไป\nเมื่อเราพยากรณ์อย่างไร^500\nจึงจะชื่อว่า\nไม่เป็นผู้กล่าว\nตามที่อัญญเดียรถีย์ปริพาชก\nเหล่านั้นกล่าวแล้ว^500\nและชื่อว่าเป็นผู้กล่าวตาม\nที่พระผู้มีพระภาคตรัสแล้ว^500\nไม่พึงกล่าวตู่พระผู้มีพระภาค\nด้วยคำอันไม่จริง^500\nและพึงพยากรณ์ธรรม\nสมควรแก่ธรรม^500\nทั้งการคล้อยตามวาทะที่ถูกไรๆ^500\nจะไม่พึงถึงฐานะ\nอันวิญญูชนจะติเตียนได้',
        'ลำดับนั้น\nท่านพระอนุราธะ\nจึงเข้าไปเฝ้าพระผู้มีพระภาค\nจนถึงที่ประทับ ฯลฯ^500\nแล้วกราบทูลพระผู้มีพระภาคว่า\nข้าแต่พระองค์ผู้เจริญ^500\nขอประทานพระวโรกาส^500\nข้าพระองค์อยู่ที่กระท่อมในป่า\nไม่ไกลพระผู้มีพระภาค^500\nครั้งนั้น\nพวกอัญญเดียรถีย์\nปริพาชกเป็นอันมาก^500\nพากันเข้าไปหาข้าพระองค์ถึงที่อยู่ ฯลฯ^500\nกล่าวกะข้าพระองค์ว่า\nดูกรท่านพระอนุราธะ^500\nพระตถาคตทรงเป็นอุดมบุรุษ\nทรงเป็นยอดบุรุษ^500\nทรงถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะทรงบัญญัติ\nในฐานะ ๔ เหล่านี้^500\nคือ สัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดอีกก็มี ๑\nย่อมเกิดก็หามิได้\nย่อมไม่เกิดก็หามิได้ ๑^500\nข้าแต่พระองค์ผู้เจริญ^500\nเมื่อพวกอัญญเดียรถีย์\nปริพาชกกล่าวอย่างนี้แล้ว^500\nข้าพระองค์จึงได้กล่าว\nกะพวกเขาว่า^500\nดูกรท่านทั้งหลาย^500\nพระตถาคตทรงเป็นอุดมบุรุษ\nทรงเป็นยอดบุรุษ^500\nทรงถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะทรงบัญญัติ\nย่อมทรงบัญญัติ^500\nนอกจากฐานะ ๔ เหล่านี้ คือ\nสัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดอีกก็มี ๑\nย่อมเกิดอีกก็หามิได้\nย่อมไม่เกิดอีกก็หามิได้ ๑^500\nข้าแต่พระองค์ผู้เจริญ^500\nเมื่อข้าพระองค์\nกล่าวอย่างนั้นแล้ว^500\nอัญญเดียรถีย์ปริพาชกเหล่านั้น\nได้กล่าวกะข้าพระองค์ว่า^500\nภิกษุนี้จักเป็นภิกษุใหม่\nบวชไม่นาน^500\nก็หรือว่าเป็นเถระ\nแต่โง่เขลาไม่ฉลาด^500\nข้าแต่พระองค์ผู้เจริญ^500\nอัญญเดียรถีย์ปริพาชกเหล่านั้น\nรุกรานข้าพระองค์ด้วยวาทะว่า\nเป็นผู้ใหม่^500\nเป็นผู้เขลาแล้ว^500\nลุกจากอาสนะหลีกไป^500\nเมื่ออัญญเดียรถีย์\nปริพาชกเหล่านั้น\nหลีกไปแล้วไม่นาน^500\nข้าพระองค์เกิดความคิดว่า\nถ้าอัญญเดียรถีย์\nปริพาชกเหล่านั้น^500\nพึงถามเราต่อไป^500\nเมื่อเราพยากรณ์อย่างไร^\nจึงจะชื่อว่าไม่เป็นผู้กล่าว^500\nตามที่อัญญเดียรถีย์ปริพาชก\nเหล่านั้นกล่าวแล้ว^500\nและชื่อว่าเป็นผู้กล่าว\nตามที่พระผู้มีพระภาคตรัสแล้ว^500\nไม่พึงกล่าวตู่พระผู้มีพระภาค\nด้วยคำอันไม่จริง^500\nและพยากรณ์ธรรมสมควรแก่ธรรม^500\nทั้งการคล้อยตามวาทะที่ถูกไรๆ\nจะไม่พึงถึงฐานะ\nอันวิญญูชนจะติเตียนได้',
        'พระผู้มีพระภาคตรัสถามว่า^500\nดูกรอนุราธะ\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nรูปเที่ยงหรือไม่เที่ยง?^500\nอ ไม่เที่ยง พระเจ้าข้า^500\nพ ก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า?^500\nอ เป็นทุกข์ พระเจ้าข้า^500\nพ ก็สิ่งใดไม่เที่ยง\nเป็นทุกข์^500\nมีความแปรปรวนเป็นธรรมดา^500\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้นว่า\nนั่นของเรา\nนั่นเป็นเรา\nนั่นเป็นตัวตนของเรา?^500\nอ ไม่ควรเห็นอย่างนั้น\nพระเจ้าข้า^500\nพ เวทนา สัญญา\nสังขาร วิญญาณ\nเที่ยงหรือไม่เที่ยง?^500\nอ ไม่เที่ยง พระเจ้าข้า^500\nพ เพราะเหตุนี้แล ฯลฯ^500\nอริยสาวกผู้ได้สดับแล้ว\nเห็นอยู่อย่างนี้ ฯลฯ^500\nย่อมรู้ชัดว่า ฯลฯ^500\nกิจอื่นเพื่อความเป็นอย่างนี้มิได้มี^500\nพ ดูกรอนุราธะ^500\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nเธอย่อมเห็นรูป\nว่าเป็นสัตว์บุคคลหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นเวทนา สัญญา\nสังขาร วิญญาณว่า\nเป็นสัตว์บุคคลหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ ดูกรอนุราธะ^500\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nเธอย่อมเห็นว่า\nสัตว์บุคคลในรูปหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากรูปหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลในเวทนาหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากเวทนาหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลในสัญญาหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากสัญญาหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลในสังขารหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากสังขารหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลในวิญญาณหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากวิญญาณหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ ดูกรอนุราธะ^500\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nเธอย่อมเห็นว่า สัตว์บุคคล\nมีรูป\nมีเวทนา\nมีสัญญา\nมีสังขาร\nมีวิญญาณ\nอย่างนั้นหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า^500\nพ ดูกรอนุราธะ^500\nเธอจะสำคัญความข้อนั้นเป็นไฉน^500\nเธอย่อมเห็นว่า\nสัตว์บุคคลนี้ไม่มีรูป\nไม่มีเวทนา\nไม่มีสัญญา\nไม่มีสังขาร\nไม่มีวิญญาณ\nอย่างนั้นหรือ?^500\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า',
        'พ ดูกรอนุราธะ^500\nก็โดยที่จริง โดยที่แท้\nเธอค้นหาสัตว์บุคคล\nในขันธ์ ๕ เหล่านี้\nในปัจจุบันไม่ได้เลย^500\nควรแลหรือที่เธอจะพยากรณ์ว่า^500\nพระตถาคตเป็นอุดมบุรุษ\nเป็นยอดบุรุษ^500\nถึงความบรรลุชั้นเยี่ยม^500\nเมื่อจะบัญญัติ ย่อมบัญญัติ^500\nเว้นจากฐานะ ๔ เหล่านี้^500\nคือ สัตว์เบื้องหน้าแต่ตายแล้ว^500\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดอีกก็มี ๑\nย่อมเกิดอีกก็หามิได้\nย่อมไม่เกิดอีกก็หามิได้ ๑?^500\nอ ข้อนั้นไม่ควรเลย พระเจ้าข้า^500\nพ ถูกละๆ อนุราธะ^500\nทั้งเมื่อก่อนและทั้งบัดนี้^500\nเราย่อมบัญญัติทุกข์\nและความดับทุกข์'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i className="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อนุราธสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0605;