import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0209 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'พระพุทธเจ้าตรัสไว้ดังนี้ว่า^500\nบุคคลเมื่อไม่รู้ไม่เห็นจักษุ^500\nตามความเป็นจริง^500\nเมื่อไม่รู้ไม่เห็นรูป^500\nตามความเป็นจริง^500\nเมื่อไม่รู้ไม่เห็นจักษุวิญญาณ^500\nตามความเป็นจริง^500\nเมื่อไม่รู้ไม่เห็นจักษุสัมผัส^500\nตามความเป็นจริง^500\nเมื่อไม่รู้ไม่เห็นความเสวยอารมณ์^500\nเป็นสุขก็ตาม^500\nเป็นทุกข์ก็ตาม^500\nมิใช่ทุกข์ มิใช่สุขก็ตาม^500\nที่เกิดขึ้นเพราะจักษุสัมผัส^500\nเป็นปัจจัยตามความเป็นจริง^500\nย่อมกำหนัดในจักษุ^500\nกำหนัดในรูป^500\nกำหนัดในจักษุวิญญาณ^500\nกำหนัดในจักษุสัมผัส^500\nกำหนัดในเสวยอารมณ์^500\nเป็นสุขก็ตามเป็นทุกข์ก็ตาม^500\nมิใช่ทุกข์มิใช่สุขก็ตาม^500\nที่เกิดขึ้นเพราะจักษุสัมผัสเป็นปัจจัย^500\nเมื่อบุคคลนั้นกำหนัดนักแล้ว^500\nประกอบพร้อมแล้ว^500\nลุ่มหลงเล็งเห็นคุณอยู่^500\nย่อมมีอุปทานขันธ์ 5^500\nถึงความพอกพูนต่อไป^500\nและเขาจะมีตัณหาที่นำไปสู่ภพใหม่^500\nร่วมกันด้วยความกำหนัด^500\nด้วยอำนาจความยินดี^500\nอันมีความเพลิดเพลิน^500\nในอารมณ์นั้นๆ เจริญทั่ว^500\nจะมีความกระวนกระวาย^500\nแม้ทางกายแม้ทางใจเจริญทั่ว^500\nมีความเดือดร้อน^500\nแม้ทางกายแม้ทางใจเจริญทั่ว^500\nมีความเร่าร้อน^500\nแม้ทางกายแม้ทางใจเจริญทั่ว^500\nเขาย่อมเสวยทุกข์ทางกายบ้างทุกข์ทางใจบ้าง',
        'ส่วนบุคคลเมื่อรู้เมื่อเห็นจักษุ^500\nตามความเป็นจริง^500\nเมื่อรู้เมื่อเห็นรูป^500\nตามความเป็นจริง^500\nเมื่อรู้เมื่อเห็นจักษุวิญญาณ^500\nตามความเป็นจริง^500\nเมื่อรู้เมื่อเห็นจักษุสัมผัส^500\nตามความเป็นจริง^500\nเมื่อรู้เมื่อเห็นความเสวยอารมณ์^500\nเป็นสุขก็ตามเป็นทุกข์ก็ตาม^500\nมิใช่ทุกข์ มิใช่สุขก็ตาม^500\nที่เกิดขึ้นเพราะจักษุสัมผัส^500\nเป็นปัจจัยตามความเป็นจริง^500\nย่อมไม่กำหนัดในจักษุ^500\nไม่กำหนัดในรูป^500\nไม่กำหนัดในจักษุวิญญาณ^500\nไม่กำหนัดในจักษุสัมผัส^500\nไม่กำหนัดในความเสวยอารมณ์^500\nเป็นสุขก็ตามเป็นทุกข์ก็ตาม^500\nมิใช่ทุกข์มิใช่สุขก็ตาม^500\nที่เกิดขึ้นเพราะจักษุสัมผัสเป็นปัจจัย^500\nเมื่อบุคคลนั้นไม่กำหนัดนักแล้ว^500\nไม่ประกอบพร้อมแล้ว^500\nไม่ลุ่มหลงเล็งเห็นโทษอยู่^500\nย่อมมีอุปทานขันธ์ 5 ไม่พอกพูนต่อไป^500\nและเขาละตัณหาที่นำไปสู่ภพใหม่^500\nร่วมกันด้วยความกำหนัด^500\nด้วยอำนาจความยินดี^500\nอันมีความเพลิดเพลินในอารมณ์นั้นๆได้^500\nจะละความกระวนกระวาย^500\nแม้ทางกายแม้ทางใจได้^500\nจะละความเดือดร้อน^500\nแม้ทางกายแม้ทางใจได้^500\nจะละความเร่าร้อน^500\nแม้ทางกายแม้ทางใจได้^500\nเขาย่อมเสวยสุขทางกายบ้างสุขทางใจบ้าง^500\nบุคคลผู้เป็นเช่นนั้นแล้ว^500\nมีความเห็นอันใด^500\nความเห็นอันนั้นย่อมเป็นสัมมาทิฏฐิ^500\nมีความดำริอันใด^500\nความดำริอันนั้นย่อมเป็นสัมมาสังกัปปะ^500\nมีความพยายามอันใด^500\nความพยายามอันนั้นย่อมเป็นสัมมาวายามะ^500\nมีความระลึกอันใด^500\nความระลึกอันนั้นย่อมเป็นสัมมาสติ^500\nมีความตั้งใจอันใด^500\nความตั้งใจอันนั้นย่อมเป็นสัมมาสมาธิ^500\nส่วนกายกรรม^500\nวจีกรรม^500\nอาชีวะของเขา^500\nย่อมบริสุทธิ์ดีในเบื้องต้น^500\nเที่ยงด้วยอาการอย่างนี้^500\nเขาชื่อว่าอัฏฐังคิกมรรค^500\nอันประเสริฐถึงความเจริญบริบูรณ์',
        'เมื่อบุคคลนั้นเจริญอัฏฐังคิกมรรคนี้อยู่อย่างนี้^500\nชื่อว่ามีสติปัฏฐาน 4^500\nสัมมัปปธาน 4^500\nอิทธิบาท 4^500\nอินทรีย์ 5^500\nพละ 5^500\nโพชฌงค์ 7^500\nถึงความเจริญบริบูรณ์^500\nบุคคลนั้นเมื่อมีธรรมทั้ง 2 ดังนี้^500\nคือสมถะและวิปัสสนาคู่เคียงกันเป็นไป^500\nเขาชื่อว่ากำหนดรู้ธรรม^500\nที่ควรกำหนดรู้ด้วยปัญญาอันยิ่ง^500\nละธรรมที่ควรละด้วยปัญญาอันยิ่ง^500\nเจริญธรรมที่ควรเจริญด้วยปัญญาอันยิ่ง^500\nทำให้แจ้งธรรมที่ควรทำให้แจ้งด้วยปัญญาอันยิ่ง',
        'กามคุณ 5^500\nกามคุณนี้มี 5 อย่างแล^500\n5 อย่างเป็นไฉน^500\nรูปที่เห็นด้วยจักษุ^500\nอันน่าปรารถนา น่าใคร่ น่าพอใจ^500\nเป็นที่รักประกอบด้วยกาม^500\nเป็นที่ตั้งแห่งความกำหนัด^500\nเสียงที่รู้ได้ด้วยโสต^500\nอันน่าปรารถนา น่าใคร่ น่าพอใจ^500\nเป็นที่รักประกอบด้วยกาม^500\nเป็นที่ตั้งแห่งความกำหนัด^500\nกลิ่นที่รู้ได้ด้วยฆานะ^500\nอันน่าปรารถนา น่าใคร่ น่าพอใจ^500\nเป็นที่รักประกอบด้วยกาม^500\nเป็นที่ตั้งแห่งความกำหนัด^500\nรสที่รู้ได้ด้วยชิวหา^500\nอันน่าปรารถนา น่าใคร่ น่าพอใจ^500\nเป็นที่รักประกอบด้วยกาม^500\nเป็นที่ตั้งแห่งความกำหนัด^500\nโผฏฐัพพะที่รู้ด้วยกาย^500\nอันน่าปรารถนา น่าใคร่ น่าพอใจ^500\nเป็นที่รักประกอบด้วยกาม^500\nเป็นที่ตั้งแห่งความกำหนัด นี้แลกามคุณ 5 อย่าง'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>กำหนดรู้ธรรมที่เนื่องด้วยอายตนะ 6</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0209;