import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0203 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ตาเห็นรูป รูปไม่เที่ยงเกิดดับ\nจักขุ ว่างเปล่าจากตนหรือจากของๆตน\nรูป ว่างเปล่าจากตนหรือจากของๆตน\nจักขุวิญญาณ\nว่างเปล่าจากตนหรือจากของๆตน\nจักขุสัมผัส\nว่างเปล่าจากตนหรือจากของๆตน\nทุกข์สุข ไม่ทุกข์ไม่สุข\nที่เกิดจากจักขุสัมผัส\nเป็นปัจจัยก็ว่างเปล่า\nจากตนหรือจากของๆตน\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nดังนั้นโลกนี้จึงว่างเปล่า\nจากตนหรือจากของๆตน\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล\nที่จะไปยึดมั่นถือมั่น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ\nโสตะ ว่างเปล่าจากตนหรือจากของๆตน\nเสียง ว่างเปล่าจากตนหรือจากของๆตน\nโสตะวิญญาณ\nว่างเปล่าจากตนหรือจากของๆตน\nโสตะสัมผัส\nว่างเปล่าจากตนหรือจากของๆตน\nทุกข์สุข ไม่ทุกข์ไม่สุข\nที่เกิดจากโสตะสัมผัส\nเป็นปัจจัยก็ว่างเปล่า\nจากตนหรือจากของๆตน\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nดังนั้นโลกนี้จึงว่างเปล่า\nจากตนหรือจากของๆตน\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล\nที่จะไปยึดมั่นถือมั่น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ\nฆานะ ว่างเปล่าจากตนหรือจากของๆตน\nกลิ่น ว่างเปล่าจากตนหรือจากของๆตน\nฆานะวิญญาณ\nว่างเปล่าจากตนหรือจากของๆตน\nฆานะสัมผัส\nว่างเปล่าจากตนหรือจากของๆตน\nทุกข์สุข ไม่ทุกข์ไม่สุข\nที่เกิดจากฆานะสัมผัส\nเป็นปัจจัยก็ว่างเปล่า\nจากตนหรือจากของๆตน\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nดังนั้นโลกนี้จึงว่างเปล่า\nจากตนหรือจากของๆตน\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล\nที่จะไปยึดมั่นถือมั่น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ลิ้นได้รส รสไม่เที่ยงเกิดดับ\nชิวหา ว่างเปล่าจากตนหรือจากของๆตน\nรส ว่างเปล่าจากตนหรือจากของๆตน\nชิวหาวิญญาณ\nว่างเปล่าจากตนหรือจากของๆตน\nชิวหาสัมผัส\nว่างเปล่าจากตนหรือจากของๆตน\nทุกข์สุข ไม่ทุกข์ไม่สุข\nที่เกิดจากชิวหาสัมผัส\nเป็นปัจจัยก็ว่างเปล่า\nจากตนหรือจากของๆตน\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nดังนั้นโลกนี้จึงว่างเปล่า\nจากตนหรือจากของๆตน\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล\nที่จะไปยึดมั่นถือมั่น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ\nกาย ว่างเปล่าจากตนหรือจากของๆตน\nสัมผัส ว่างเปล่าจากตนหรือจากของๆตน\nกายวิญญาณ\nว่างเปล่าจากตนหรือจากของๆตน\nกายสัมผัส\nว่างเปล่าจากตนหรือจากของๆตน\nทุกข์สุข ไม่ทุกข์ไม่สุข\nที่เกิดจากกายสัมผัส\nเป็นปัจจัยก็ว่างเปล่า\nจากตนหรือจากของๆตน\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nดังนั้นโลกนี้จึงว่างเปล่า\nจากตนหรือจากของๆตน\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล\nที่จะไปยึดมั่นถือมั่น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ\nมโน ว่างเปล่าจากตนหรือจากของๆตน\nธรรมารมณ์ ว่างเปล่าจากตนหรือจากของๆตน\nมโนวิญญาณ\nว่างเปล่าจากตนหรือจากของๆตน\nมโนสัมผัส\nว่างเปล่าจากตนหรือจากของๆตน\nทุกข์สุข ไม่ทุกข์ไม่สุข\nที่เกิดจากมโนสัมผัส\nเป็นปัจจัยก็ว่างเปล่า\nจากตนหรือจากของๆตน\nเพราะทั้งหมดเป็นธรรมชาติชนิดหนึ่ง\nเกิดจากเหตุปัจจัย\nมาประชุมปรุงแต่งกันชั่วคราว\nแล้วแตกสลาย\nไม่มีตัวตนเป็นของตนเอง\nดังนั้นโลกนี้จึงว่างเปล่า\nจากตนหรือจากของๆตน\nไม่มีวัตถุ สิ่งของ สัตว์ บุคคล\nที่จะไปยึดมั่นถือมั่น\nว่านั่นเป็นของเรา\nเป็นเรา\nเป็นตัวตนของเรา\nไม่เที่ยงเกิดดับ ดับไม่เหลือ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>กำหนดรู้โลกและชีวิตกระทบสัมผัสว่างจากตนหรือของของตน</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0203;