import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0410 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ฐานสูตร\nว่าด้วยฐานะ\nที่ควรพิจารณาเนืองๆ 5 ประการ\nดูกรภิกษุทั้งหลายฐานะ 5 ประการนี้\nอันสตรี บุรุษ คฤหัสถ์หรือบรรพชิต\nควรพิจารณาเนืองๆ 5 ประการเป็นไฉน\nคือ สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต\nควรพิจารณาเนืองๆว่า\nเรามีความแก่เป็นธรรมดา\nไม่ล่วงพ้นความแก่ไปได้ 1 \nเรามีความเจ็บไข้เป็นธรรมดา\nไม่ล่วงพ้นความเจ็บไข้ไปได้ 1 \nเรามีความตายเป็นธรรมดา\nไม่ล่วงพ้นความตายไปได้ 1\nเราต้องพลัดพรากจากของรัก\nของชอบใจทั้งสิ้น 1 \nเรามีกรรมเป็นของตน\nเป็นทายาทแห่งกรรม\nมีกรรมเป็นกำเนิด\nมีกรรมเป็นเผ่าพันธุ์\nมีกรรมเป็นที่พึ่ง \nจะทำกรรมใดไว้ดีก็ตาม\nชั่วก็ตาม\nเราจะเป็นผู้รับผลของกรรมนั้น 1',
        'ดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์อะไร\nสตรี บุรุษ คฤหัสถ์ หรือบรรพชิต\nควรพิจารณาเนืองๆว่า\nเรามีความแก่เป็นธรรมดา\nไม่ล่วงพ้นความแก่ไปได้\nดูกรภิกษุทั้งหลาย\nความมัวเมาในความเป็นหนุ่มสาว\nมีอยู่แก่สัตว์ทั้งหลาย\nซึ่งเป็นเหตุให้สัตว์ทั้งหลาย\nประพฤติทุจริตด้วยกายวาจาใจ\nเมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ\nย่อมละความมัวเมา\nในความเป็นหนุ่มสาวนั้นได้\nโดยสิ้นเชิง\nหรือทำให้เบาบางลงได้',
        'ดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์นี้แล\nสตรี บุรุษ คฤหัสถ์ หรือบรรพชิต\nควรพิจารณาเนืองๆว่า\nเรามีความแก่เป็นธรรมดา\nไม่ล่วงพ้นความแก่ไปได้\nดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์อะไร\nสตรี บุรุษ คฤหัสถ์ หรือบรรพชิต\nควรพิจารณาเนืองๆว่า\nเรามีความเจ็บไข้เป็นธรรมดา\nไม่ล่วงพ้นความเจ็บไข้ไปได้\nดูกรภิกษุทั้งหลาย\nความมัวเมาในความไม่มีโรค\nมีอยู่แก่สัตว์ทั้งหลาย\nซึ่งเป็นเหตุให้สัตว์ทั้งหลาย\nประพฤติทุจริตด้วยกายวาจาใจ\nเมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ\nย่อมละความมัวเมา\nในความไม่มีโรคนั้นได้\nโดยสิ้นเชิง\nหรือทำให้เบาบางลงได้',
        'ดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์นี้แล\nสตรี บุรุษ คฤหัสถ์หรือบรรพชิต\nควรพิจารณาเนืองๆว่า\nเรามีความเจ็บไข้เป็นธรรมดา\nไม่ล่วงพ้นความเจ็บไข้ไปได้\nดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์อะไร\nสตรี บุรุษ คฤหัสถ์หรือบรรพชิต\nควรพิจารณาเนืองๆว่า\nเรามีความตายเป็นธรรมดา\nไม่ล่วงพ้นความตายไปได้\nดูกรภิกษุทั้งหลาย\nความเมาในชีวิตมีอยู่แก่สัตว์ทั้งหลาย\nซึ่งเป็นเหตุให้สัตว์ทั้งหลาย\nประพฤติทุจริตด้วยกายวาจาใจ\nเมื่อเข้าพิจารณาฐานะนั้นอยู่เนืองๆ\nย่อมละความมัวเมาในชีวิตนั้นได้\nโดยสิ้นเชิง\nหรือทำให้เบาบางลงได้',
        'ดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์นี้แล\nสตรี บุรุษ คฤหัสถ์ หรือบรรพชิต\nควรพิจารณาเนืองๆว่า\nเรามีความตายเป็นธรรมดา\nไม่ล่วงพ้นความตายไปได้\nดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์อะไร\nสตรี บุรุษ คฤหัสถ์ หรือบรรพชิต\nจึงควรพิจารณาเนืองๆว่า\nเราจะต้องพลัดพรากจากของรัก\nของชอบใจทั้งสิ้น\nดูกรภิกษุทั้งหลาย\nความพอใจ ความรักใคร่\nในของรักมีอยู่แก่สัตว์ทั้งหลาย\nซึ่งเป็นเหตุให้สัตว์ทั้งหลาย\nประพฤติทุจริตด้วยกายวาจาใจ\nเมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ\nย่อมละความพอใจความรักใคร่นั้นได้\nโดยสิ้นเชิง\nหรือทำให้เบาบางลงได้',
        'ดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์นี้แล\nสตรี บุรุษ คฤหัสถ์ หรือบรรพชิต\nควรพิจารณาเนืองๆว่า\nเราจะต้องพลัดพรากจากของรัก\nของชอบใจทั้งสิ้น\nดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์อะไร\nสตรี บุรุษ คฤหัสถ์ หรือบรรพชิต\nควรพิจารณาเนืองๆว่า\nเรามีกรรมเป็นของตน\nเป็นทายาทแห่งกรรม\nมีกรรมเป็นกำเนิด\nมีกรรมเป็นเผ่าพันธุ์\nมีกรรมเป็นที่พึ่ง\nจะทำกรรมใดดีก็ตามชั่วก็ตาม\nเราจะเป็นผู้รับผลของกรรมนั้น\nดูกรภิกษุทั้งหลาย\nกายทุจริตวจีทุจริตมโนทุจริต\nมีอยู่แก่สัตว์ทั้งหลาย\nเมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ\nย่อมละทุจริตได้โดยสิ้นเชิง\nหรือทำให้เบาบางลงได้',
        'ดูกรภิกษุทั้งหลาย\nเพราะอาศัยอำนาจประโยชน์นี้แล\nสตรี บุรุษ คฤหัสถ์หรือบรรพชิต\nจึงควรพิจารณาเนืองๆว่า\nเรามีกรรมเป็นของตน\nเป็นทายาทแห่งกรรม\nมีกรรมเป็นกำเนิด\nมีกรรมเป็นเผ่าพันธุ์\nมีกรรมเป็นที่พึ่ง\nจะทำกรรมใดดีก็ตามชั่วก็ตาม\nเราจะเป็นผู้รับผลของกรรมนั้น\n\nว่าด้วยผลแห่งการพิจารณาฐานะ 5\nดูกรภิกษุทั้งหลาย\nอริยสาวกนั้นย่อมพิจารณา\nเห็นดังนี้ว่าไม่ใช่เราแต่ผู้เดียวเท่านั้น\nที่มีความแก่เป็นธรรมดา\nไม่ล่วงพ้นความแก่ไปได้\nโดยที่แท้สัตว์ทั้งปวงบรรดา\nที่มีการมาการไปการจุติการอุปบัติ\nล้วนมีความแก่เป็นธรรมดา\nไม่ล่วงพ้นความแก่ไปได้',
        'เมื่ออริยสาวกนั้น\nพิจารณาฐานะนั้นอยู่เนืองๆ\nมรรคย่อมเกิดขึ้น\nอริยสาวกนั้นย่อมเสพอบรม\nทำให้มากซึ่งมรรคนั้น\nเมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่\nย่อมละสังโยชน์ได้\nอนุสัยย่อมสิ้นไป\nอริยสาวกนั้นย่อมพิจารณา\nเห็นดังนี้ว่าไม่ใช่เราแต่ผู้เดียวเท่านั้น\nที่มีความเจ็บไข้เป็นธรรมดา\nไม่ล่วงพ้นความเจ็บไข้ไปได้\nโดยที่แท้สัตว์ทั้งปวง\nบรรดาที่มีการมาการไปการจุติการอุปบัติ\nล้วนมีความเจ็บไข้เป็นธรรมดา\nไม่ล่วงพ้นความเจ็บไข้ไปได้\nเมื่ออริยสาวกนั้นพิจารณาฐานะ\nนั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น\nอริยสาวกนั้นย่อมเสพอบรม\nทำให้มากซึ่งมรรคนั้น\nเมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่\nย่อมละสังโยชน์ได้อนุสัยย่อมสิ้นไป',
        'อริยสาวกนั้นย่อมพิจารณา\nเห็นดังนี้ว่าไม่ใช่เราแต่ผู้เดียวเท่านั้น\nที่มีความตายเป็นธรรมดา\nไม่ล่วงพ้นความตายไปได้\nโดยที่แท้สัตว์ทั้งปวง\nบรรดาที่มีการมาการไปการจุติการอุปบัติ\nล้วนมีความตายเป็นธรรมดา\nไม่ล่วงพ้นความตายไปได้เมื่อ\nอริยสาวกนั้นพิจารณาฐานะ\nนั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น\nอริยสาวกนั้นย่อมเสพอบรม\nทำให้มากซึ่งมรรคนั้น\nเมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่\nย่อมละสังโยชน์ได้อนุสัยย่อมสิ้นไป\nอริยสาวกนั้นย่อมพิจารณาเห็นดังนี้ว่า\nไม่ใช่เราแต่ผู้เดียวเท่านั้นที่จะต้อง\nพลัดพรากจากของรักของชอบใจทั้งสิ้น\nโดยที่แท้สัตว์ทั้งปวง\nบรรดาที่มีการมาการไปการจุติการอุปบัติ\nล้วนจะต้องพลัดพรากจากของรัก\nของชอบใจทั้งสิ้น',
        'เมื่ออริยสาวกนั้นพิจารณาฐานะ\nนั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น\nอริยสาวกนั้นย่อมเสพอบรม\nทำให้มากซึ่งมรรคนั้น\nเมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่\nย่อมละสังโยชน์ได้\nอนุสัยย่อมสิ้นไป\nอริยสาวกนั้นย่อมพิจารณาเห็นดังนี้ว่า\nไม่ใช่เราแต่ผู้เดียวเท่านั้น\nที่มีกรรมเป็นของตน\nเป็นทายาทแห่งกรรม\nมีกรรมเป็นกำเนิด\nมีกรรมเป็นเผ่าพันธุ์\nมีกรรมเป็นที่พึ่ง\nจักทำกรรมใดดีก็ตามชั่วก็ตาม\nเราจะเป็นผู้รับผลของกรรมนั้น\nโดยที่แท้สัตว์ทั้งปวง\nบรรดาที่มีการมาการไปการจุติการอุปบัติ\nล้วนมีกรรมเป็นของตน\nเป็นทายาทแห่งกรรม\nมีกรรมเป็นกำเนิด\nมีกรรมเป็นเผ่าพันธุ์\nมีกรรมเป็นที่พึ่ง\nจะทำกรรมใดดีก็ตามชั่วก็ตาม\nจะเป็นผู้รับผลของกรรมนั้น',
        'เมื่ออริยสาวกนั้นพิจารณาฐานะ\nนั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น\nอริยสาวกนั้นย่อมเสพอบรม\nทำให้มากซึ่งมรรคนั้นอยู่\nย่อมละสังโยชน์ได้\nอนุสัยย่อมสิ้นไป\nสัตว์ทั้งหลายย่อม\nมีความแก่เป็นธรรมดา\nมีความเจ็บไข้เป็นธรรมดา\nมีความตายเป็นธรรมดา\nสัตว์ทั้งหลายย่อมเป็นไปตามธรรมดา\nพวกปุถุชนย่อมเกลียด\nถ้าเราพึงเกลียดธรรมนั้น\nในพวกสัตว์ผู้มีอย่างนั้นเป็นธรรมดา\nข้อนั้นไม่สมควรแก่เราผู้เป็นอยู่อย่างนี้\nเรานั้นเป็นอยู่อย่างนี้\nทราบธรรมที่หาอุปธิมิได้\nเห็นการออกบวช\nโดยเป็นธรรมเกษม\nครอบงำความมัวเมาทั้งปวง\nในความไม่มีโรค\nในความเป็นหนุ่มสาว\nและในชีวิตความอุตสาหะได้มีแล้วแก่เรา\nผู้เห็นเฉพาะซึ่งนิพพาน\nบัดนี้เราไม่ควรเพื่อเสพกามทั้งหลาย\nจะเป็นผู้ประพฤติไม่ถอยหลัง\nตั้งหน้าประพฤติพรหมจรรย์'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ฐานสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0410;