import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0104 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ตาเห็นรูป^500\nรูปไม่เที่ยงเกิดดับ^500\nจักขุไม่เที่ยงเกิดดับ^500\nรูปไม่เที่ยงเกิดดับ^500\nจักขุวิญญาณไม่เที่ยงเกิดดับ^500\nจักขุสัมผัสไม่เที่ยงเกิดดับ^500\nกำหนดรู้องค์ประกอบของตาเห็นรูป^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากจักขุสัมผัสเป็นปัจจัย^500\nคือผลต่อเนื่องของ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ^500\nกำหนดรู้ผลต่อเนื่องของตาเห็นรูป^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ',
        'หูได้ยินเสียง^500\nเสียงไม่เที่ยงเกิดดับ^500\nโสตะไม่เที่ยงเกิดดับ^500\nเสียงไม่เที่ยงเกิดดับ^500\nโสตะวิญญาณไม่เที่ยงเกิดดับ^500\nโสตะสัมผัสไม่เที่ยงเกิดดับ^500\nกำหนดรู้องค์ประกอบของหูได้ยินเสียง^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากโสตะสัมผัสเป็นปัจจัย^500\nคือผลต่อเนื่องของ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ^500\nกำหนดรู้ผลต่อเนื่องของหูได้ยินเสียง^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ',
        'จมูกได้กลิ่น^500\nกลิ่นไม่เที่ยงเกิดดับ^500\nฆานะไม่เที่ยงเกิดดับ^500\nกลิ่นไม่เที่ยงเกิดดับ^500\nฆานะวิญญาณไม่เที่ยงเกิดดับ^500\nฆานะสัมผัสไม่เที่ยงเกิดดับ^500\nกำหนดรู้องค์ประกอบของจมูกได้กลิ่น^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากฆานะสัมผัสเป็นปัจจัย^500\nคือผลต่อเนื่องของ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ^500\nกำหนดรู้ผลต่อเนื่องของจมูกได้กลิ่น^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ',
        'ลิ้นได้รส รสไม่เที่ยงเกิดดับ^500\nชิวหาไม่เที่ยงเกิดดับ^500\nรสไม่เที่ยงเกิดดับ^500\nชิวหาวิญญาณไม่เที่ยงเกิดดับ^500\nชิวหาสัมผัสไม่เที่ยงเกิดดับ^500\nกำหนดรู้องค์ประกอบของลิ้นได้รส^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากชิวหาสัมผัสเป็นปัจจัย^500\nคือผลต่อเนื่องของ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ^500\nกำหนดรู้ผลต่อเนื่องของลิ้นได้รส^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ',
        'กายสัมผัส^500\nสัมผัสไม่เที่ยงเกิดดับ^500\nกายไม่เที่ยงเกิดดับ^500\nสัมผัสไม่เที่ยงเกิดดับ^500\nกายวิญญาณไม่เที่ยงเกิดดับ^500\nกายสัมผัสไม่เที่ยงเกิดดับ^500\nกำหนดรู้องค์ประกอบของกายสัมผัส^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากกายสัมผัสเป็นปัจจัย^500\nคือผลต่อเนื่องของ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ^500\nกำหนดรู้ผลต่อเนื่องของกายสัมผัส^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ',
        'ใจคิดนึก^500\nความคิดไม่เที่ยงเกิดดับ^500\nมโนไม่เที่ยงเกิดดับ^500\nธรรมารมณ์ไม่เที่ยงเกิดดับ^500\nมโนวิญญาณไม่เที่ยงเกิดดับ^500\nมโนสัมผัสไม่เที่ยงเกิดดับ^500\nกำหนดรู้องค์ประกอบของใจคิดนึก^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nทุกข์สุข ไม่ทุกข์ไม่สุข^500\nที่เกิดจากมโนสัมผัสเป็นปัจจัย^500\nคือผลต่อเนื่องของ^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ^500\nกำหนดรู้ผลต่อเนื่องของใจคิดนึก^500\nโลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง^500\nไม่เที่ยงเกิดดับ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>การพิจารณาอินทรีย์ 6</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0104;