import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0409 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ยมกวรรคที่ 2\nอวิชชาสูตร\nว่าด้วยอวิชชา\nมีนิวรณ์ 5 เป็นอาหาร\nดูกรภิกษุทั้งหลาย\nเงื่อนต้นแห่งอวิชชาย่อมไม่ปรากฏ\nในกาลก่อนแต่นี้อวิชชาไม่มี\nแต่ภายหลังจึงมี\nเพราะเหตุนั้นเราจึงกล่าวคำนี้\nอย่างนี้ว่าก็เมื่อเป็นเช่นนั้น\nอวิชชามีข้อนี้เป็นปัจจัยจึงปรากฏ\nดูกรภิกษุทั้งหลาย\nเราย่อมกล่าว่าอวิชชาว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของอวิชชา\nควรจะกล่าวว่านิวรณ์ 5\nแม้นิวรณ์ 5 เราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของนิวรณ์ 5\nควรกล่าวว่าทุจริต 3\nแม้ทุจริต 3 เราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของทุจริต 3\nควรกล่าวว่าการไม่สำรวมอินทรีย์\nแม้การไม่สำรวมอินทรีย์\nเราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารแห่งการไม่สำรวมอินทรีย์\nควรกล่าวว่าความไม่มีสติสัมปชัญญะ\nแม้ความไม่มีสติสัมปชัญญะ\nเราก็กล่าวว่ามีอาหาร\nแม้ความไม่มีสติสัมปชัญญะ\nเราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหาร\nของความไม่มีสติสัมปชัญญะ\nควรกล่าวว่าการกระทำไว้ในใจ\nโดยไม่แยบคาย\nแม้การทำไว้ในใจโดยไม่แยบคาย\nเราก็กะว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของการทำไว้ในใจ\nโดยไม่แยบคาย\nควรกล่าวว่าความไม่มีศรัทธา\nแม้ความไม่มีศรัทธา\nเราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของความไม่มีศรัทธา\nควรกล่าวว่าการไม่ฟังสัทธรรม\nแม้การไม่ฟังสัทธรรม\nเราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของการไม่ฟังสัทธรรม\nควรกล่าวว่าการไม่คบสัปบุรุษ\nดูกรภิกษุทั้งหลายด้วยประการดังนี้\nการไม่คบสัปบุรุษที่บริบูรณ์\nย่อมยังการไม่ฟังสัทธรรมให้บริบูรณ์\nการไม่ฟังสัทธรรมที่บริบูรณ์\nย่อมยังความไม่มีศรัทธาให้บริบูรณ์\nความไม่มีสถานที่บริบูรณ์\nย่อมยังการทำไว้ในใจ\nโดยไม่แยบคายให้บริบูรณ์\nการทำไว้ในใจ\nโดยไม่แยบคายที่บริบูรณ์\nย่อมยังความไม่มี\nสติสัมปชัญญะให้บริบูรณ์\nความไม่มีสติสัมปชัญญะที่บริบูรณ์\nย่อมยังการไม่สำรวมอินทรีย์ให้บริบูรณ์\nการไม่สำรวมอินทรีย์ที่บริบูรณ์\nย่อมยังทุจริต 3 ให้บริบูรณ์\nทุจริต 3 ที่บริบูรณ์\nย่อมยังนิวรณ์ 5 ให้บริบูรณ์\nนิวรณ์ 5 ที่บริบูรณ์ย่อมยังอวิชชาให้บริบูรณ์\nอวิชชานี้มีอาหารอย่างนี้และบริบูรณ์อย่างนี้',
        'ดูกรภิกษุทั้งหลาย\nเปรียบเหมือนเมื่อฝนเม็ดหยาบ\nตกลงเบื้องบนภูเขา\nเมื่อฝนตกหนักอยู่\nน้ำนั้นไหลไปตามที่ลุ่ม\nย่อมยังซอกเขาลำธารและห้วยให้เต็ม\nซอกเขาลำธารและห้วยที่เต็ม\nย่อมยังหนองให้เต็ม\nหนองที่เต็มย่อมยังบึงให้เต็ม\nบึงที่เต็มย่อมยังแม่น้ำน้อยให้เต็ม\nแม่น้ำน้อยที่เต็มย่อมยังแม่น้ำใหญ่ให้เต็ม\nแม่น้ำใหญ่ที่เต็มย่อมยังมหาสมุทรสาครให้เต็ม\nมหาสมุทรสาครนั้นมีอาหารอย่างนี้\nและเต็มเปี่ยมอย่างนี้แม้ฉันใด\nดูกรภิกษุทั้งหลายการไม่คบสัปบุรุษที่บริบูรณ์\nย่อมยังการไม่ฟัสัทธรรมให้บริบูรณ์\nนิวรณ์ 5 ที่บริบูรณ์ย่อมยังอวิขชาให้บริบูรณ์\nอวิชชานี้มีอาหารอย่างนี้และบริบูรณ์อย่างนี้\nฉันนั้นเหมือนกันแล',
        'ว่าด้วยวิชชาและวิมุตติ\nมีโพชฌงค์ 7 เป็นอาหาร\nดูกรภิกษุทั้งหลาย\nเรากล่าววิชาและวิมุตติว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของวิชาและวิมุต\nควรกล่าวว่าโพชฌงค์ 7 \nแม้โพชฌงค์ 7 เราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของโพชฌงค์ 7 \nควรกล่าวว่าสติปัฏฐาน 4 \nแม้สติปัฏฐาน 4 \nเราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของสติปัฏฐาน 4 \nควรกล่าวว่าสุจริต 3 \nแม้สุจริต 3 เราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของสุจริต 3 \nควรกล่าวว่าการสำรวมอินทรีย์\nแม้การสำรวมอินทรีย์เราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nอะไรเป็นอาหารของการสำรวมอินทรีย์\nควรกล่าวว่าสติสัมปชัญญะ\nแม้สติสัมปชัญญะเราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nอะไรเป็นอาหารของสติสัมปชัญญะ\nควรกล่าวว่าการทำไว้ในใจโดยแยบคาย\nแม้การทำไว้ในใจโดยแยบคาย\nเราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของการกระทำ\nไว้ในใจโดยแยบคาย\nควรกล่าวว่าศรัทธา\nแม้ศรัทธาเราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของศรัทธา\nควรกล่าวว่าการฟังสัทธรรม\nแม้การฟังสัทธรรมเราก็กล่าวว่ามีอาหาร\nมิได้กล่าวว่าไม่มีอาหาร\nก็อะไรเป็นอาหารของการฟังสัทธรรม\nควรกล่าวว่าการคบสัปบุรุษ\nดูกรภิกษุทั้งหลายด้วยประการดังนี้\nการคบสัปบุรุษที่บริบูรณ์\nย่อมยังการฟังการสัทธรรมให้บริบูรณ์\nการฟังสัทธรรมที่บริบูรณ์\nย่อมยังศรัทธาให้บริบูรณ์\nศรัทธาที่บริบูรณ์\nย่อมยังการทำไว้ในใจ\nโดยแยบคายให้บริบูรณ์\nการทำไว้ในใจ\nโดยแยบคายที่บริบูรณ์\nย่อมยังสติสัมปชัญญะ\nให้บริบูรณ์\nสติสัมปชัญญะที่บริบูรณ์\nย่อมยังการสำรวมอินทรีย์\nให้บริบูรณ์\nการสำรวมอินทรีย์ที่บริบูรณ์\nย่อมยังสุจริต 3 ให้บริบูรณ์\nสุจริต 3 ที่บริบูรณ์ย่อมยังสติปัฏฐาน 4\nให้บริบูรณ์\nสติปัฏฐาน 4 ที่บริบูรณ์\nย่อมยังโพชฌงค์ 7 ให้บริบูรณ์\nโพชฌงค์ 7 ที่บริบูรณ์\nย่อมยังวิชชาและวิมุตติให้บริบูรณ์\nวิชชาและวิมุตนี้มีอาหารอย่างนี้\nและบริบูรณ์อย่างนี้\nดูกรภิกษุทั้งหลาย\nเปรียบเหมือนเมื่อฝนเม็ดหยาบ\nตกลงเบื้องบนภูเขา\nเมื่อฝนตกหนักอยู่\nน้ำนั้นไหลไปตามที่ลุ่ม\nยังซอกเขาลำธารและห้วยให้เต็ม\nซอกเขาลำธารและห้วยที่เต็ม\nย่อมยังหนองให้เต็ม\nหนองที่เต็มย่อมยังบึงให้เต็ม\nบึงที่เต็มย่อมยังแม่น้ำน้อยให้เต็ม\nแม่น้ำน้อยที่เต็มย่อมยังแม่น้ำใหญ่ให้เต็ม\nแม่น้ำใหญ่ที่เต็มย่อมยังมหาสมุทรสาครให้เต็ม\nมหาสมุทรสาครนั้นมีอาหารอย่างนี้\nและเต็มเปี่ยมอย่างนี้แม้ฉันใด\nดูกรภิกษุทั้งหลาย\nการคบสัปบุรุษที่บริบูรณ์\nย่อมยังการฟังสัทธรรมให้บริบูรณ์\nโพชฌงค์ 7 ที่บริบูรณ์\nย่อมยังวิชชาและวิมุตติให้บริบูรณ์\nวิชชาและวิมุตนี้มีอาหารอย่างนี้\nและบริบูรณ์อย่างนี้ฉันนั้นเหมือนกันแล'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ยมกวรรคที่ 2</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0409;