import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0207 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'โลกและองค์ประกอบของโลก^500\nคือดิน น้ำ ลม ไฟ^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ผลต่อเนื่องของโลกคือวัตถุสิ่งของ^500\nแผ่นดิน แผ่นน้ำ ลมฟ้าอากาศ^500\nต้นไม้ ใบหญ้า สัตว์ บุคคล^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nประกอบด้วยดิน น้ำ ลม ไฟ^500\nเป็นเหตุเป็นปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ชีวิตและองค์ประกอบของโลก^500\nคือดิน น้ำ ลม ไฟ กรรมและวิญญาณ^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ผลต่อเนื่องของชีวิตคือรูปร่าง หน้าตา^500\nลักษณะท่าทาง นิสัยใจคอ^500\nความคิดความเห็น คำพูดการกระทำ^500\nดีใจเสียใจ ไปไหนมาไหน^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nประกอบด้วยดิน น้ำ ลม ไฟ^500\nเป็นเหตุเป็นปัจจัย^500\nมาประชุมปรุงแต่งชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น^500\nเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nไม่เที่ยงเกิดดับ ดับไม่เหลือ',
        'ปฐวีธาตุ (ธาตุดิน)^500\nก็ปฐวีธาตุเป็นไฉน^500\nคือปฐวีธาตุภายในก็มีภายนอกก็มี^500\nก็ปฐวีธาตุภายในเป็นไฉน^500\nได้แก่สิ่งที่แค่นแข็ง^500\nกำหนดได้มีในตนอาศัยตน^500\nคือผม ขน เล็บ ฟัน หนัง^500\nเนื้อ เอ็น กระดูก^500\nเยื่อในกระดูก ม้าม หัวใจ ตับ พังผืด^500\nไต ปอด ไส้ใหญ่ ไส้น้อย^500\nอาหารเก่า อาหารใหม่^500\nหรือแม้สิ่งอื่นไม่ว่าชนิดไรๆ^500\nที่แข้นแข็ง^500\nกำหนดได้มีในตนอาศัยตน^500\nนี้เรียกว่าปฐวีธาตุภายใน^500\nก็ปฐวีธาตุทั้งภายในและภายนอกนี้แล^500\nเป็นปฐวีธาตุทั้งนั้น^500\nพึงเห็นปฐวีธาตุนั้น^500\nด้วยปัญญาอันชอบ^500\nตามความเป็นจริงอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นสิ่งนั้น^500\nว่าเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nครั้นเห็นแล้วจะเบื่อหน่ายปฐวีธาตุ^500\nและให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น^500\nปฐวีธาตุได้ไม่เที่ยงเกิดดับ',
        'อาโปธาตุ (ธาตุน้ำ)^500\nก็อาโปธาตุเป็นไฉน^500\nคืออาโปธาตุภายในก็มีภายนอกก็มี^500\nก็อาโปธาตุภายในเป็นไฉน^500\nได้แก่สิ่งที่เอิบอาบซึมซาบไป^500\nกำหนดได้มีในตนอาศัยตน^500\nคือ ดี เสลด น้ำเหลือง^500\nเลือด เหงื่อ^500\nมันข้น น้ำตา เปลวมัน^500\nน้ำลาย น้ำมูก ไขข้อ มูตร^500\nหรือแม้แต่สิ่งอื่นไม่ว่าชนิดไรๆ^500\nที่เอิบอาบซึมซาบไป^500\nกำหนดได้มีในตนอาศัยตน^500\nนี้เรียกว่าอาโปธาตุภายใน^500\nก็อาโปธาตุทั้งภายในและภายนอกนี้แล^500\nเป็นอาโปธาตุทั้งนั้น^500\nพึงเห็นอาโปธาตุนั้น^500\nด้วยปัญญาอันชอบ^500\nตามความเป็นจริงอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นสิ่งนั้น^500\nว่าเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nครั้นเห็นแล้วจะเบื่อหน่ายอาโปธาตุ^500\nและให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น^500\nอาโปธาตุได้ไม่เที่ยงเกิดดับ',
        'วาโยธาตุ (ธาตุลม)^500\nก็วาโยธาตุเป็นไฉน^500\nคือวาโยธาตุภายในก็มีภายนอกก็มี^500\nก็วาโยธาตุภายในเป็นไฉน^500\nได้แก่สิ่งที่พัดผันไป^500\nกำหนดได้มีในตนอาศัยตน^500\nคือ ลมพัดขึ้นเบื้องบน^500\nลมพัดลงเบื้องต่ำ^500\nลมในท้อง ลมในลำไส้^500\nลมแล่นไปตามอวัยวะน้อยใหญ่^500\nลมหายใจออก ลมหายใจเข้า^500\nหรือแม้แต่สิ่งอื่นไม่ว่าชนิดไรๆที่พัดผันไป^500\nกำหนดได้มีในตนอาศัยตน^500\nนี้เรียกว่าวาโยธาตุภายใน^500\nก็วาโยธาตุทั้งภายในและภายนอกนี้แล^500\nเป็นวาโยธาตุทั้งนั้น^500\nพึงเห็นวาโยธาตุนั้น^500\nด้วยปัญญาอันชอบ^500\nตามความเป็นจริงอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นสิ่งนั้นว่าเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nครั้นเห็นแล้วจะเบื่อหน่ายวาโยธาตุ^500\nและให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น^500\nวาโยธาตุได้ไม่เที่ยงเกิดดับ',
        'เตโชธาตุ (ธาตุไฟ)^500\nก็เตโชธาตุเป็นไฉน^500\nคือเตโชธาตุภายในก็มีภายนอกก็มี^500\nก็เตโชธาตุภายในเป็นไฉน^500\nได้แก่สิ่งที่อบอุ่นถึงความเร่าร้อน^500\nกำหนดได้มีในตนอาศัยตน^500\nคือ ธาตุที่เป็นเครื่องยังกายให้อบอุ่น^500\nยังกายให้ทรุดโทรม^500\nยังกายให้กระวนกระวาย^500\nและธาตุที่เป็นเหตุให้ของกิน^500\nที่กิน ที่ดื่ม ที่เคี้ยว^500\nที่ลิ้มแล้วถึงความย่อยไปด้วยดี^500\nหรือแม้แต่สิ่งอื่นไม่ว่าชนิดไรๆ^500\nที่อบอุ่นถึงความเร่าร้อน^500\nกำหนดได้มีในตนอาศัยตน^500\nนี้เรียกว่าเตโชธาตุภายใน^500\nก็เตโชธาตุทั้งภายในและภายนอกนี้แล^500\nเป็นเตโชธาตุทั้งนั้น^500\nพึงเห็นเตโชธาตุนั้น^500\nด้วยปัญญาอันชอบ^500\nตามความเป็นจริงอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นสิ่งนั้น^500\nว่าเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nครั้นเห็นแล้วจะเบื่อหน่ายเตโชธาตุ^500\nและให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น^500\nเตโชธาตุได้ไม่เที่ยงเกิดดับ^500\nอากาศธาตุ (ความว่าง)^500\nก็อากาศธาตุเป็นไฉน^500\nคืออากาศธาตุภายในก็มีภายนอกก็มี^500\nก็อากาศธาตุภายในเป็นไฉน^500\nได้แก่สิ่งที่ว่างปรุโปร่ง^500\nกำหนดได้มีในตนอาศัยตน^500\nคือ ช่องหู ช่องจมูก ช่องปาก^500\nซึ่งเป็นทางให้กลืนของกิน^500\nที่ดื่ม ที่เคี้ยว ที่ลิ้ม^500\nและเป็นทางระบายของ^500\nที่กิน ที่เคี้ยว ที่ดื่ม^500\nแล้วออกมาทางเบื้องล่าง^500\nหรือแม้แต่สิ่งอื่นไม่ว่าชนิดไรๆ^500\nที่ว่างปรุโปร่ง^500\nกำหนดได้มีในตนอาศัยตน^500\nนี้เรียกว่าอากาศธาตุภายใน^500\nก็อากาศธาตุทั้งภายในและภายนอกนี้แล^500\nเป็นอากาศธาตุทั้งนั้น^500\nพึงเห็นอากาศธาตุนั้น^500\nด้วยปัญญาอันชอบ^500\nตามความเป็นจริงอย่างนี้ว่า^500\nทั้งหมดเป็นธรรมชาติชนิดหนึ่ง^500\nเกิดจากเหตุปัจจัย^500\nมาประชุมกันชั่วคราว^500\nแล้วแตกสลาย^500\nไม่มีตัวตนเป็นของตนเอง^500\nไม่ควรเห็นสิ่งนั้น^500\nว่าเป็นของเรา^500\nเป็นเรา^500\nเป็นตัวตนของเรา^500\nครั้นเห็นแล้วจะเบื่อหน่ายอากาศธาตุ^500\nและให้จิตคลายกำหนัดไม่ยึดมั่นถือมั่น^500\nอากาศธาตุได้ไม่เที่ยงเกิดดับ',
        'วิญญาณธาตุ (ความรู้)^500\nต่อจากนั้นสิ่งที่เหลืออยู่^500\nก็คือวิญญาณธาตุอันบริสุทธิ์ผุดผ่อง^500\nบุคคลย่อมรู้อะไรได้ด้วยวิญญาณนั้น^500\nคือรู้ชัดว่าสุขบ้าง ทุกข์บ้าง^500\nไม่ทุกข์ไม่สุขบ้าง^500\nเพราะอาศัยผัสสะเป็นที่ตั้งแห่งสุขเวทนา^500\nย่อมเกิดสุขเวทนา^500\nบุคคลนั้นเมื่อเสวยสุขเวทนา^500\nย่อมรู้สึกว่ากำลังเสวยสุขเวทนาอยู่^500\nเพราะผัสสะเป็นที่ตั้ง^500\nแห่งสุขเวทนานั้นแลดับไป^500\nย่อมรู้สึกว่าความเสวยอารมณ์^500\nที่เกิดแก่ผัสสะนั้นคือตัวสุขเวทนา^500\nอันเกิดเพราะอาศัยผัสสะเป็นที่ตั้ง^500\nแห่งสุขเวทนาย่อมดับไปย่อมเข้าไปสงบ^500\nเพราะอาศัยผัสสะ^500\nเป็นที่ตั้งแห่งทุกขเวทนา^500\nย่อมเกิดทุกขเวทนา^500\nบุคคลนั้นเมื่อเสวยทุกขเวทนา^500\nย่อมรู้สึกว่ากำลังเสวยทุกขเวทนาอยู่^500\nเพราะผัสสะเป็นที่ตั้งแห่งทุกขเวทนานั้นแลดับไป^500\nย่อมรู้สึกว่าความเสวยอารมณ์ที่เกิดแก่ผัสสะนั้น^500\nคือตัวทุกขเวทนา^500\nอันเกิดเพราะอาศัยผัสสะ^500\nเป็นที่ตั้งแห่งทุกขเวทนาย่อมดับไป^500\nย่อมเข้าไปสงบ^500\nเพราะอาศัยผัสสะเป็นที่ตั้ง^500\nแห่งไม่ทุกข์ ไม่สุขเวทนา^500\nย่อมเกิดไม่ทุกข์ ไม่สุขเวทนา^500\nบุคคลนั้นเมื่อเสวย^500\nไม่ทุกข์​ ไม่สุขเวทนา^500\nย่อมรู้สึกว่ากำลังเสวย^500\nไม่ทุกข์ ไม่สุขเวทนาอยู่^500\nเพราะผัสสะเป็นที่ตั้ง^500\nแห่งไม่ทุกข์ ไม่สุขเวทนานั้นแลดับไป^500\nย่อมรู้สึกว่าความเสวยอารมณ์^500\nที่เกิดแก่ผัสสะนั้น^500\nคือตัวไม่ทุกข์ ไม่สุขเวทนา^500\nอันเกิดเพราะอาศัยผัสสะเป็นที่ตั้ง^500\nแห่งไม่ทุกข์ ไม่สุขเวทนาย่อมดับไป^500\nย่อมเข้าไปสงบ^500\nเปรียบเหมือนประทีปน้ำมัน^500\nอาศัยน้ำมันและไส้จึงลุกโพลงอยู่ได้^500\nเพราะสิ้นน้ำมันและไส้นั้น^500\nและไม่เติมน้ำมันและไส้อื่น^500\nย่อมเป็นประทีปหมดเชื้อดับไป^500\nฉันใดฉันนั้นเหมือนกันแล^500\nบุคคลนั้นเมื่อเสวยเวทนามีกายเป็นที่สุด^500\nย่อมรู้สึกว่ากำลังเสวยเวทนามีกายเป็นที่สุด^500\nเมื่อเสวยเวทนามีชีวิตเป็นที่สุด^500\nย่อมรู้สึกว่ากำลังเสวยเวทนามีชีวิตเป็นที่สุด^500\nและรู้สึกว่า เบื้องหน้าแต่สิ้นชีวิตเพราะตายไปแล้ว^500\nความยินดีกันในโลกนี้แลจักเป็นของสงบ'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>องค์ประกอบของโลกและชีวิต + กำหนดรู้ธาตุ 6</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0207;