import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0402 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'อดีต อนาคต ปัจจุบัน อนิจจสูตร\nว่าด้วยความเป็นอนิจจัง\nแห่งอายตนะภายในทั้งสามกาล\nดูกรภิกษุทั้งหลาย\nจักษุที่เป็นอดีตและอนาคต\nเป็นของไม่เที่ยง\nจะกล่าวไปใยถึงจักษุ\nที่เป็นปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้ว\nเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใย\nในจักษุที่เป็นอดีต\nไม่เพลิดเพลินจักษุ\nที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับจักษุที่เป็นปัจจุบัน\nหู จมูก ลิ้น กาย ใจ\nที่เป็นอดีตและอนาคต\nเป็นของไม่เที่ยง\nจะกล่าวไปใย\nถึงใจที่เป็นปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้ว\nเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใยในใจ\nที่เป็นอดีต\nไม่เพลิดเพลินในใจ\nที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับซึ่งใจที่เป็นปัจจุบัน',
        'อดีต อนาคต ปัจจุบัน ทุกข์สูตร\nว่าด้วยความเป็นทุกข์\nแห่งอายตนะภายในทั้งสามกาล\nดูกรภิกษุทั้งหลาย\nจักษุที่เป็นอดีตและอนาคต\nเป็นทุกข์\nจะกล่าวไปใย\nถึงจักษุที่เป็นปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้ว\nเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใย\nในจักษุที่เป็นอดีต\nไม่เพลิดเพลินจักษุ\nที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับจักษุที่เป็นปัจจุบัน\nหู จมูก ลิ้น กาย ใจ\nที่เป็นอดีตและอนาคต\nเป็นทุกข์\nจะกล่าวไปใยถึงใจ\nที่เป็นปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้ว\nเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใยในใจ\nที่เป็นอดีต\nไม่เพลิดเพลินในใจ\nที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับซึ่งใจที่เป็นปัจจุบัน',
        'อดีต อนาคต ปัจจุบัน อนัตตาสูตร\nว่าด้วยความเป็นอนัตตา\nแห่งอายตนะภายใน\nทั้งสามกาล\nดูกรภิกษุทั้งหลาย\nจักษุที่เป็นอดีตและอนาคต\nเป็นอนัตตา\nจะกล่าวไปใย\nถึงจักษุที่เป็นปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้ว\nเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใย\nในจักษุที่เป็นอดีต\nไม่เพลิดเพลินจักษุ\nที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับจักษุที่เป็นปัจจุบัน\nหู จมูก ลิ้น กาย ใจ\nที่เป็นอดีตและอนาคต\nเป็นอนัตตา\nจะกล่าวไปใยถึงใจ\nที่เป็นปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้ว\nเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใยในใจ\nที่เป็นอดีต\nไม่เพลิดเพลินในใจ\nที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่าย\nเพื่อคลายกำหนัด\nเพื่อดับซึ่งใจที่เป็นปัจจุบัน'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อดีต อนาคต ปัจจุบัน อนิจจสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0402;