import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0407 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ขัตติยาธิปปายสูตร^500\nว่าด้วยความประสงค์^500\nของคน 6 จำพวก^500\nครั้งนั้นแลชานุสโสนิพราหมณ์^500\nเข้าไปเฝ้าพระผู้มีพระภาค^500\nถึงที่ประทับ^500\nได้ปราศรัยกับพระผู้มีพระภาค^500\nครั้นผ่านการปราศรัย^500\nพอให้ระลึกถึงกันไปแล้ว^500\nจึงนั่ง ณ ที่ควรส่วนข้างหนึ่ง^500\nครั้นแล้วได้ทูลถาม^500\nพระผู้มีพระภาคว่า',
        'ชานุสโสนิพราหมณ์^500\nถามพระพุทธเจ้าว่า^500\nข้าแต่พระโคดมผู้เจริญ^500\nกษัตริย์ทั้งหลาย^500\nย่อมมีความประสงค์อะไร^500\nนิยมอะไร^500\nมั่นใจอะไร^500\nต้องการอะไร^500\nมีอะไรเป็นที่สุด',
        'พระผู้มีพระภาค^500\nตรัสตอบว่า^500\nดูกรพราหมณ์^500\nธรรมดากษัตริย์ทั้งหลาย^500\nย่อมประสงค์โภคทรัพย์^500\nนิยมปัญญา^500\nมั่นใจในกำลังทหาร^500\nต้องการในการได้แผ่นดิน^500\nมีความเป็นใหญ่เป็นที่สุด',
        'ชานุสโสนิพราหมณ์^500\nถามพระพุทธเจ้าต่อไปว่า^500\nข้าแต่พระโคดมผู้เจริญ^500\nก็พราหมณ์ทั้งหลาย^500\nย่อมมีความประสงค์อะไร^500\nนิยมอะไร^500\nมั่นใจอะไร^500\nต้องการอะไร^500\nมีอะไรเป็นที่สุด^500\nพระผู้มีพระภาค^500\nตรัสตอบว่า^500\nดูกรพราหมณ์^500\nธรรมดาพราหมณ์ทั้งหลาย^500\nย่อมประสงค์โภคทรัพย์^500\nนิยมปัญญา^500\nมั่นใจในมนต์^500\nต้องการบูชายัญ^500\nมีพรหมโลกเป็นที่สุด',
        'ชานุสโสนิพราหมณ์^500\nถามพระพุทธเจ้าต่อไปว่า^500\nข้าแต่พระโคดมผู้เจริญ^500\nก็คฤหบดีทั้งหลาย^500\nย่อมมีความประสงค์อะไร^500\nนิยมอะไร^500\nมั่นใจในอะไร^500\nต้องการอะไร^500\nมีอะไรเป็นที่สุด',
        'พระผู้มีพระภาค^500\nตรัสตอบว่า^500\nดูกรพราหมณ์^500\nธรรมดาคฤหบดีทั้งหลาย^500\nย่อมประสงค์โภคทรัพย์^500\nนิยมปัญญา^500\nมั่นใจในศิลปะ^500\nต้องการการงาน^500\nมีการงานที่สำเร็จแล้วเป็นที่สุด',
        'ชานุสโสนิพราหมณ์^500\nถามพระพุทธเจ้าต่อไปว่า^500\nข้าแต่พระโคดมผู้เจริญ^500\nก็สตรีทั้งหลาย^500\nย่อมประสงค์อะไร^500\nนิยมอะไร^500\nมั่นใจในอะไร^500\nต้องการอะไร^500\nมีอะไรเป็นที่สุด^500\nพระผู้มีพระภาค^500\nตรัสตอบว่า^500\nดูกรพราหมณ์^500\nธรรมดาสตรีทั้งหลาย^500\nย่อมประสงค์บุรุษ^500\nนิยมเครื่องแต่งตัว^500\nมั่นใจในบุตร^500\nต้องการไม่ให้สตรีอื่นร่วมสามี^500\nมีความเป็นใหญ่ในบ้านเป็นที่สุด',
        'ชานุสโสนิพราหมณ์^500\nถามพระพุทธเจ้าต่อไปว่า^500\nข้าแต่พระโคดมผู้เจริญ^500\nก็โจรทั้งหลาย^500\nย่อมประสงค์อะไร^500\nนิยมอะไร^500\nมั่นใจอะไร^500\nต้องการอะไร^500\nมีอะไรเป็นที่สุด',
        'พระผู้มีพระภาค^500\nตรัสตอบว่า^500\nดูกรพราหมณ์โจรทั้งหลาย^500\nย่อมประสงค์ลักทรัพย์ของผู้อื่น^500\nนิยมที่เร้นลับ^500\nมั่นใจในศาสตรา^500\nต้องการที่มืด^500\nมีการที่ผู้อื่นไม่เห็นเขาเป็นที่สุด',
        'ชานุสโสนิพราหมณ์^500\nถามพระพุทธเจ้าต่อไปว่า^500\nข้าแต่พระโคดมผู้เจริญ^500\nก็สมณะทั้งหลาย^500\nย่อมประสงค์อะไร^500\nนิยมอะไร^500\nมั่นใจอะไร^500\nต้องการอะไร^500\nมีอะไรเป็นที่สุด',
        'พระผู้มีพระภาค^500\nตรัสตอบว่า^500\nดูกรพราหมณ์^500\nธรรมดาสมณะทั้งหลาย^500\nย่อมประสงค์ขันติโสรัจจะ^500\nนิยมปัญญา^500\nมั่นใจในศีล^500\nต้องการความไม่มีห่วงใย^500\nมีพระนิพพานเป็นที่สุด',
        'ข้าแต่พระโคดมผู้เจริญ^500\nอัศจรรย์เรื่องไม่เคยมีได้มีแล้ว^500\nคือท่านพระโคดม^500\nย่อมทรงทราบความประสงค์^500\nความนิยม^500\nความมั่นใจ^500\nความต้องการ^500\nและสิ่งที่เป็นที่สุด^500\nแห่งกษัตริย์ทั้งหลายฯลฯ^500\nแห่งพราหมณ์ทั้งหลายฯลฯ^500\nแห่งคฤหบดีทั้งหลายฯลฯ^500\nแม้แห่งสตรีทั้งหลายฯลฯ^500\nแม้แห่งโจรทั้งหลายฯลฯ^500\nย่อมทรงทราบความประสงค์^500\nความนิยม^500\nความมั่นใจ^500\nความต้องการ^500\nและสิ่งที่เป็นที่สุด^500\nแห่งสมณะทั้งหลาย',
        'ข้าแต่ท่านพระโคดมผู้เจริญ^500\nภาษิตของพระองค์แจ่มแจ้งนัก^500\nข้าแต่ท่านพระโคดมผู้เจริญ^500\nภาษิตของพระองค์แจ่มแจ้งนัก^500\nขอท่านพระโคดมทรงจำข้าพระองค์^500\nว่าเป็นอุบาสกผู้ถึงสรณะตลอดชีวิต^500\nตั้งแต่วันนี้เป็นต้นไป'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i className="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>ขัตติยาธิปปายสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0407;