import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0512 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'อนาคตสูตรที่ 2\nว่าด้วยภัยในอนาคต 5 ประการ\nดูกรภิกษุทั้งหลาย\nภิกษุผู้เห็นภัย\nในอนาคต 5 ประการนี้\nก็ควรเป็นผู้ไม่ประมาท\nมีความเพียรมีใจเด็ดเดี่ยว\nเพื่อถึงธรรมที่ยังไม่ถึง\nเพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ\nเพื่อทำให้แจ้งธรรม\nที่ยังไม่ได้ทำให้แจ้ง\nภัย 5 ประการเป็นไฉนคือ\nภิกษุในธรรมวินัยนี้\nย่อมพิจารณาเห็นดังนี้ว่า\nบัดนี้เรายังเป็นหนุ่มแน่น\nมีผมดำสนิท\nประกอบด้วยความเป็นหนุ่ม\nอันเจริญตั้งอยู่ในปฐมวัย\nถึงกระนั้นก็มีสมัยที่ชรา\nย่อมจะถูกต้องกายนี้ได้\nก็ผู้ที่แก่แล้วถูกชราครอบงำแล้ว\nจะมนสิการคำสั่งสอนของพระพุทธเจ้า\nไม่ใช่ทำได้ง่าย\nจะเสพเสนาสนะอันสงัด\nคือป่า และป่าชัฏก็ไม่ใช่ทำได้ง่าย\nก่อนที่ธรรมอันไม่น่าปรารถนา\nไม่น่าใคร่ไม่น่าพอใจนั้นจะมาถึงเรา\nเราจะรีบปรารภความเพียร\nเพื่อถึงธรรมที่ยังไม่ถึง\nเพื่อทำให้แจ้งธรรม\nที่ยังไม่ได้ทำให้แจ้งเสียก่อนทีเดียว\nซึ่งเราประกอบแล้วแม้แก่ก็จักอยู่สบาย\nดูกรภิกษุทั้งหลาย\nภิกษุผู้เห็นภัยในอนาคตข้อที่ 1 นี้\nควรเป็นผู้ไม่ประมาท\nมีความเพียรมีใจเด็ดเดี่ยวอยู่\nเพื่อถึงธรรมที่ยังไม่ถึง\nเพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ\nเพื่อทำให้แจ้งทำที่ยังไม่ได้ทำให้แจ้ง',
        'อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า\nบัตนี้เรามีอาพาธน้อยมีโรคเบาบาง\nประกอบด้วยไฟธาตุ\nสำหรับย่อยอาหารสม่ำเสมอ\nไม่เย็นนะไม่ร้อนนักขนาดกลาง\nควรแก่การบำเพ็ญเพียร\nแต่ย่อมมีสมัยที่พยาธิจะถูกต้องกายนี้\nก็ผู้ที่ป่วยไข้อันความป่วยไข้ครอบงำแล้ว\nจะมนสิการคำสั่งสอนของพระพุทธเจ้า\nไม่ใช่ทำได้ง่าย\nซึ่งเราประกอบแล้วแม้ป่วยไข้\nก็จะอยู่สบาย\nภิกษุเห็นภัยในอนาคตข้อที่ 2 นี้\nควรเป็นผู้ไม่ประมาท',
        'อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า\nบัดนี้แลข้าวกล้าดีบิณฑบาตก็หาได้ง่าย\nสะดวกแก่การแสวงหาเลี้ยงชีพ\nแต่ก็ย่อมมีสมัยที่มีข้าวแพง\nข้าวกล้าไม่ดีบิณฑบาตหาได้ยาก\nไม่สะดวกแก่การแสวงหาเลี้ยงชีพ\nอนึ่งในสมัยข้าวแพง\nพวกมนุษย์ย่อมหลั่งไหลไปในที่ที่มีอาหารดี\nในที่นั้นย่อมมีการอยู่คลุกคลีด้วยหมู่คณะ\nมีการอยู่พลุกพล่านกัน\nเมื่อมีการอยู่คลุกคลีด้วยหมู่คณะ\nอยู่พลุกพล่านกัน\nจะมนสิการคำสั่งสอนของพระพุทธเจ้า\nไม่ใช่ทำได้ง่าย\nซึ่งเราประกอบแล้วก็จักอยู่สบาย\nแม้ในเวลาทุพภิกขภัย\nภิกษุผู้เห็นภัยในอนาคตข้อที่ 3 นี้\nควรเป็นผู้ไม่ประมาท',
        'อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า\nบัดนี้แลมนุษย์ทั้งหลายย่อมเป็นผู้พร้อมเพรียงกัน\nชื่นชมต่อกันไม่วิวาทกัน\nเป็นดังน้ำนมกับน้ำ \nมองดูกันด้วยนัยน์ตาแสดงความรักอยู่\nแต่ย่อมมีสมัยที่มีภัยมีความปั่นป่วน\nในดงประชาชนวุ่นวาย\nและเมื่อมีภัยพวกมนุษย์ย่อมหลั่งไหล\nไปในที่ที่ปลอดภัย\nในที่นั้นย่อมมีการอยู่คลุกคลีด้วยหมู่คณะ\nมีการอยู่พลุกพล่านกัน\nเมื่อมีการอยู่คลุกคลีด้วยหมู่คณะ\nอยู่พลุกพล่าน\nจะมนสิการคำสั่งสอนของพระพุทธเจ้า\nไม่ใช่ทำได้ง่าย\nซึ่งเราประกอบแล้วก็จักอยู่สบาย\nแม้ในสมัยที่มีภัย\nภิกษุผู้เห็นภัยในอนาคตข้อที่ 4 นี้\nควรเป็นผู้ไม่ประมาท',
        'อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า\nบัดนี้แลสงฆ์เป็นผู้พร้อมเพรียงกัน\nชื่นชมต่อกันไม่วิวาทกัน\nมีอุเทศร่วมกันอยู่ผาสุข\nแต่ก็ย่อมมีสมัยที่สงฆ์แตกกัน\nก็เมื่อสงฆ์แตกกันแล้ว\nจะมมสิการคำสั่งสอนของพระพุทธเจ้า\nไม่ใช่ทำได้ง่าย\nจะเสพเสนาสนะอันสงัดคือป่า\nและป่าชัฏก็ไม่ใช่ทำได้ง่าย\nก่อนที่ธรรมอันไม่น่าปรารถนา\nไม่น่าใคร่ไม่น่าพอใจนั้นจะมาถึงเรา\nเราจะรีบปรารภความเพียร\nเพื่อถึงธรรมที่ยังไม่ถึง\nเพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ\nเพื่อทำให้แจ้งธรรมที่ยังไม่ได้ทำให้แจ้ง\nซึ่งเราประกอบแล้วก็จะอยู่สบาย\nแม้ในเมื่อสงฆ์แตกกัน\nดูกรภิกษุทั้งหลาย\nภิกษุผู้เห็นภัยในอนาคตข้อที่ 5 นี้แล\nควรเป็นผู้ไม่ประมาท\nมีความเพียรมีใจเด็ดเดี่ยว\nอยู่เพื่อถึงธรรมที่ยังไม่ถึง\nเพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ\nเพื่อทำให้แจ้งทำที่ยังไม่ได้ทำให้แจ้ง\nดูกรภิกษุทั้งหลาย\nภิกษุผู้เห็นภัยในอนาคต 5 ประการนี้\nควรเป็นผู้ไม่ประมาท\nมีความเพียรมีใจเด็ดเดี่ยว\nอยู่เพื่อถึงธรรมที่ยังไม่ถึง\nเพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ\nเพื่อทำให้แจ้งทำที่ยังไม่ได้ทำให้แจ้ง'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อนาคตสูตรที่ 2</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0512;