import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0605 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'สมัยหนึ่งพระผู้มีพระภาค\nประทับอยู่ ณ กูฏาคารศาลา\nป่ามหาวัน\nใกล้พระนครเวสาลี\nก็สมัยนั้น\nท่านพระอนุราธะ\nอยู่ที่กระท่อมในป่า\nไม่ไกลพระผู้มีพระภาค\nครั้งนั้น\nอัญญเดียรถีย์ปริพาชก\nพากันเข้าไปหา\nท่านพระอนุราธะจนถึงที่อยู่\nได้สนทนาปราศรัย\nกับท่านพระอนุราธะ\nครั้นผ่านการสนทนาปราศรัย\nพอให้ระลึกถึงกันแล้ว\nจึงนั่ง ณ ที่ควรส่วนข้างหนึ่งแล้ว\nจึงได้กล่าวกะท่านอนุราธะว่า\nดูกรท่านอนุราธะ\nพระตถาคตเป็นอุดมบุรุษ\nเป็นยอดบุรุษ\nทรงถึงความบรรลุชั้นเยี่ยม\nเมื่อจะทรงบัญญัติ\nย่อมทรงบัญญัติ\nในฐานะ ๔ นี้\nคือสัตว์เบื้องหน้าแต่ตายแล้ว\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดอีกก็มี ๑\nย่อมไม่เกิดอีก\nอีกก็หามิได้ ๑\nเมื่อพวกปริพาชก\nกล่าวอย่างนั้นแล้ว\nท่านพระอนุราธะ\nได้กล่าวกะอัญญเดียรถีย์\nปริพาชกเหล่านั้นว่า\nดูกรท่านทั้งหลาย\nพระตถาคตทรงเป็นอุดมบุรุษ\nทรงเป็นยอดบุรุษ\nทรงถึงความบรรลุชั้นเยี่ยม\nเมื่อจะทรงบัญญัติ\nย่อมทรงบัญญัติ\nนอกจากฐานะ ๔ เหล่านี้\nคือ สัตว์เบื้องหน้าแต่ตายแล้ว\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดก็มี ๑\nย่อมเกิดอีกก็หามิได้\nย่อมไม่เกิดก็หามิได้\nย่อมไม่เกิดอีกก็หามิได้ ๑\nเมื่อท่านพระอนุราธะ\nกล่าวอย่างนั้นแล้ว\nอัญญเดียรถีย์ปริพาชก\nเหล่านั้นได้กล่าว\nกะท่านพระอนุราธะว่า\nภิกษุนี้จักเป็นภิกษุใหม่\nบวชแล้วไม่นาน\nก็หรือว่าเป็นภิกษุเถระ\nแต่โง่เขลาไม่ฉลาด\nครั้งนั้น\nพวกอัญญเดียรถีย์ปริพาชกกล่าว\nรุกรานท่านพระอนุราธะ\nด้วยวาทะว่าเป็นภิกษุใหม่\nและเป็นผู้โง่เขลาแล้ว\nพากันลุกจากอาสนะหลีกไป',
        'เมื่ออัญญเดียรถีย์\nปริพาชกเหล่านั้น\nหลีกไปแล้วไม่นาน\nท่านพระอนุราธะได้มี\nความคิดว่า\nถ้าอัญญเดียรถีย์\nปริพาชกเหล่านั้น\nพึงถามเราต่อไป\nเมื่อเราพยากรณ์อย่างไร\nจึงจะชื่อว่า\nไม่เป็นผู้กล่าว\nตามที่อัญญเดียรถีย์ปริพาชก\nเหล่านั้นกล่าวแล้ว\nและชื่อว่าเป็นผู้กล่าวตาม\nที่พระผู้มีพระภาคตรัสแล้ว\nไม่พึงกล่าวตู่พระผู้มีพระภาค\nด้วยคำอันไม่จริง\nและพึงพยากรณ์ธรรม\nสมควรแก่ธรรม\nทั้งการคล้อยตามวาทะที่ถูกไรๆ\nจะไม่พึงถึงฐานะ\nอันวิญญูชนจะติเตียนได้\nลำดับนั้น\nท่านพระอนุราธะ\nจึงเข้าไปเฝ้าพระผู้มีพระภาค\nจนถึงที่ประทับ ฯลฯ\nแล้วกราบทูลพระผู้มีพระภาคว่า\nข้าแต่พระองค์ผู้เจริญ\nขอประทานพระวโรกาส\nข้าพระองค์อยู่ที่กระท่อมในป่า\nไม่ไกลพระผู้มีพระภาค\nครั้งนั้น\nพวกอัญญเดียรถีย์\nปริพาชกเป็นอันมาก\nพากันเข้าไปหาข้าพระองค์ถึงที่อยู่ ฯลฯ\nกล่าวกะข้าพระองค์ว่า\nดูกรท่านพระอนุราธะ\nพระตถาคตทรงเป็นอุดมบุรุษ\nทรงเป็นยอดบุรุษ\nทรงถึงความบรรลุชั้นเยี่ยม\nเมื่อจะทรงบัญญัติ\nในฐานะ ๔ เหล่านี้\nคือ สัตว์เบื้องหน้าแต่ตายแล้ว\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดอีกก็มี ๑\nย่อมเกิดก็หามิได้\nย่อมไม่เกิดก็หามิได้ ๑\nข้าแต่พระองค์ผู้เจริญ\nเมื่อพวกอัญญเดียรถีย์\nปริพาชกกล่าวอย่างนี้แล้ว\nข้าพระองค์จึงได้กล่าว\nกะพวกเขาว่า\nดูกรท่านทั้งหลาย\nพระตถาคตทรงเป็นอุดมบุรุษ\nทรงเป็นยอดบุรุษ\nทรงถึงความบรรลุชั้นเยี่ยม\nเมื่อจะทรงบัญญัติ\nย่อมทรงบัญญัติ\nนอกจากฐานะ ๔ เหล่านี้ คือ\nสัตว์เบื้องหน้าแต่ตายแล้ว\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดอีกก็มี ๑\nย่อมเกิดอีกก็หามิได้\nย่อมไม่เกิดอีกก็หามิได้ ๑\nข้าแต่พระองค์ผู้เจริญ\nเมื่อข้าพระองค์\nกล่าวอย่างนั้นแล้ว\nอัญญเดียรถีย์ปริพาชกเหล่านั้น\nได้กล่าวกะข้าพระองค์ว่า\nภิกษุนี้จักเป็นภิกษุใหม่\nบวชไม่นาน\nก็หรือว่าเป็นเถระ\nแต่โง่เขลาไม่ฉลาด\nข้าแต่พระองค์ผู้เจริญ\nอัญญเดียรถีย์ปริพาชกเหล่านั้น\nรุกรานข้าพระองค์ด้วยวาทะว่า\nเป็นผู้ใหม่\nเป็นผู้เขลาแล้ว\nลุกจากอาสนะหลีกไป\nเมื่ออัญญเดียรถีย์\nปริพาชกเหล่านั้น\nหลีกไปแล้วไม่นาน\nข้าพระองค์เกิดความคิดว่า\nถ้าอัญญเดียรถีย์\nปริพาชกเหล่านั้น\nพึงถามเราต่อไป\nเมื่อเราพยากรณ์อย่างไร\nจึงจะชื่อว่าไม่เป็นผู้กล่าว\nตามที่อัญญเดียรถีย์ปริพาชก\nเหล่านั้นกล่าวแล้ว\nและชื่อว่าเป็นผู้กล่าว\nตามที่พระผู้มีพระภาคตรัสแล้ว\nไม่พึงกล่าวตู่พระผู้มีพระภาค\nด้วยคำอันไม่จริง\nและพยากรณ์ธรรมสมควรแก่ธรรม\nทั้งการคล้อยตามวาทะที่ถูกไรๆ\nจะไม่พึงถึงฐานะ\nอันวิญญูชนจะติเตียนได้\nพระผู้มีพระภาคตรัสถามว่า\nดูกรอนุราธะ\nเธอจะสำคัญความข้อนั้นเป็นไฉน\nรูปเที่ยงหรือไม่เที่ยง?\nอ ไม่เที่ยง พระเจ้าข้า\nพ ก็สิ่งใดไม่เที่ยง\nสิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า?\nอ เป็นทุกข์ พระเจ้าข้า\nพ ก็สิ่งใดไม่เที่ยง\nเป็นทุกข์\nมีความแปรปรวนเป็นธรรมดา\nควรหรือหนอ\nที่จะตามเห็นสิ่งนั้นว่า\nนั่นของเรา\nนั่นเป็นเรา\nนั่นเป็นตัวตนของเรา?\nอ ไม่ควรเห็นอย่างนั้น\nพระเจ้าข้า\nพ เวทนา สัญญา\nสังขาร วิญญาณ\nเที่ยงหรือไม่เที่ยง?\nอ ไม่เที่ยง พระเจ้าข้า\nพ เพราะเหตุนี้แล ฯลฯ\nอริยสาวกผู้ได้สดับแล้ว\nเห็นอยู่อย่างนี้ ฯลฯ\nย่อมรู้ชัดว่า ฯลฯ\nกิจอื่นเพื่อความเป็นอย่างนี้มิได้มี\nพ ดูกรอนุราธะ\nเธอจะสำคัญความข้อนั้นเป็นไฉน\nเธอย่อมเห็นรูป\nว่าเป็นสัตว์บุคคลหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นเวทนา สัญญา\nสังขาร วิญญาณว่า\nเป็นสัตว์บุคคลหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ ดูกรอนุราธะ\nเธอจะสำคัญความข้อนั้นเป็นไฉน\nเธอย่อมเห็นว่า\nสัตว์บุคคลในรูปหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากรูปหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลในเวทนาหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากเวทนาหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลในสัญญาหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากสัญญาหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลในสังขารหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากสังขารหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลในวิญญาณหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ เธอย่อมเห็นว่า\nสัตว์บุคคลอื่นจากวิญญาณหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ ดูกรอนุราธะ\nเธอจะสำคัญความข้อนั้นเป็นไฉน\nเธอย่อมเห็นว่า สัตว์บุคคล\nมีรูป\nมีเวทนา\nมีสัญญา\nมีสังขาร\nมีวิญญาณ\nอย่างนั้นหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ ดูกรอนุราธะ\nเธอจะสำคัญความข้อนั้นเป็นไฉน\nเธอย่อมเห็นว่า\nสัตว์บุคคลนี้ไม่มีรูป\nไม่มีเวทนา\nไม่มีสัญญา\nไม่มีสังขาร\nไม่มีวิญญาณ\nอย่างนั้นหรือ?\nอ ไม่ใช่อย่างนั้น พระเจ้าข้า\nพ ดูกรอนุราธะ\nก็โดยที่จริง โดยที่แท้\nเธอค้นหาสัตว์บุคคล\nในขันธ์ ๕ เหล่านี้\nในปัจจุบันไม่ได้เลย\nควรแลหรือที่เธอจะพยากรณ์ว่า\nพระตถาคตเป็นอุดมบุรุษ\nเป็นยอดบุรุษ\nถึงความบรรลุชั้นเยี่ยม\nเมื่อจะบัญญัติ ย่อมบัญญัติ\nเว้นจากฐานะ ๔ เหล่านี้\nคือ สัตว์เบื้องหน้าแต่ตายแล้ว\nย่อมเกิดอีก ๑\nย่อมไม่เกิดอีก ๑\nย่อมเกิดอีกก็มี\nย่อมไม่เกิดอีกก็มี ๑\nย่อมเกิดอีกก็หามิได้\nย่อมไม่เกิดอีกก็หามิได้ ๑?\nอ ข้อนั้นไม่ควรเลย พระเจ้าข้า\nพ ถูกละๆ อนุราธะ\nทั้งเมื่อก่อนและทั้งบัดนี้\nเราย่อมบัญญัติทุกข์\nและความดับทุกข์'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>อนุราธสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0605;