import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0602 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'ข้าพเจ้าได้สดับมาแล้วอย่างนี้^500\nสมัยหนึ่งพระผู้มีพระภาค\nประทับอยู่ ณ นิคมเทวทหะ^500\nของศากยะทั้งหลายในสักกชนบท^500\nครั้งนั้นแล\nภิกษุมากรูปด้วยกัน^500\nปรารถนาจะไปสู่ปัจฉาภูมชนบท^500\nเข้าไปเฝ้าพระผู้มีพระภาค^500\nถวายอภิวาทพระผู้มีพระภาคแล้ว^500\nนั่งอยู่ ณ ที่ควรส่วนข้างหนึ่งแล้ว^500\nได้กราบทูลพระผู้มีพระภาคว่า\nพระพุทธเจ้าข้า^500\nพวกข้าพระองค์ปรารถนา\nจะไปสู่ปัจฉาภูมชนบท^500\nเพื่อสำเร็จการอยู่อาศัย\nในปัจฉาภูมชนบท^500\nพระผู้มีพระภาคตรัสถามว่า^500\nดูกรภิกษุทั้งหลาย^500\nก็เธอทั้งหลายลาสารีบุตรแล้วหรือ?^500\nภิกษุเหล่านั้นกราบทูลว่า\nพระพุทธเจ้าข้า^500\nพวกข้าพระองค์\nยังมิได้ลาท่านพระสารีบุตร^500\nพระผู้มีพระภาคตรัสว่า^500\nดูกรภิกษุทั้งหลาย^500\nเธอทั้งหลายจงไปลาสารีบุตรเถิด^500\nสารีบุตรเป็นบัณฑิตอนุเคราะห์\nเพื่อนพรหมจารี^500\nภิกษุเหล่านั้นทูลรับ\nพระผู้มีพระภาคว่าอย่างนั้น\nพระพุทธเจ้าข้า^500\nก็สมัยนั้นแล^500\nท่านพระสารีบุตร^500\nนั่งอยู่ในมณฑปเล็กๆแห่งหนึ่ง^500\nที่มุงด้วยตะใคร่น้ำ^500\nไม่ไกลพระผู้มีพระภาค^500\nครั้งนั้นแล ภิกษุเหล่านั้น^500\nชื่นชมยินดีพระภาษิต\nของพระผู้มีพระภาค^500\nลุกจากอาสนะ ถวายอภิวาท^500\nทำประทักษิณพระผู้มีพระภาคแล้ว^500\nพากันเข้าไปหาท่านพระสารีบุตร^500\nกล่าวคำปราศรัย\nกับท่านพระสารีบุตร^500\nครั้นผ่านการปราศรัย\nพอให้ระลึกถึงกันไปแล้ว^500\nจึงนั่งอยู่ ณ ที่ควรส่วนข้างหนึ่งแล้ว^500\nได้กล่าวกะท่านพระสารีบุตรว่า^500\nข้าแต่ท่านพระสารีบุตร^500\nข้าพเจ้าทั้งหลาย^500\nปรารถนาจะไปปัจฉาภูมชนบท^500\nเพื่อสำเร็จการอยู่อาศัย\nในปัจฉาภูมชนบท^500\nท่านพระสารีบุตรกล่าวว่า^500\nท่านทั้งหลาย\nกราบทูลลาพระศาสดาแล้วหรือ?^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nก็กษัตริย์ผู้เป็นบัณฑิตบ้าง^500\nพราหมณ์ผู้เป็นบัณฑิตบ้าง^500\nคฤหบดีผู้เป็นบัณฑิตบ้าง^500\nสมณะผู้เป็นบัณฑิตบ้าง^500\nเป็นผู้ถามปัญหากะภิกษุ^500\nผู้ไปไพรัชชประเทศต่างๆมีอยู่^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nก็พวกมนุษย์ที่เป็นบัณฑิต^500\nทดลองถามว่า\nพระศาสดาของพวกท่าน^500\nมีวาทะอย่างไร?^500\nตรัสสอนอย่างไร?^500\nธรรมทั้งหลายพวกท่านฟังดีแล้ว^500\nเรียบร้อยดีแล้ว^500\nใส่ใจดีแล้ว^500\nทรงจำดีแล้ว^500\nแทงตลอดดีแล้ว^500\nด้วยปัญญาบ้างหรือ?^500\nท่านผู้มีอายุทั้งหลาย^500\nเมื่อพยากรณ์อย่างไร?^500\nจึงจะชื่อว่าเป็นผู้กล่าวตาม^500\nที่พระผู้มีพระภาคตรัสแล้ว^500\nจะไม่กล่าวตู่พระผู้มีพระภาค^500\nด้วยคำไม่จริง^500\nและพยากรณ์ธรรมสมควรแก่ธรรม^500\nทั้งการคล้อยตามวาทะ\nที่ถูกไรๆ จะไม่พึงถึงฐานะ^500\nอันวิญญูชนจะติเตียนได้^500\nภิ. ข้าแต่ท่านผู้มีอายุ^500\nข้าพเจ้าทั้งหลาย^500\nมาแม้แต่ที่ไกล^500\nเพื่อจะรู้เนื้อความแห่งภาษิตนั้น\nในสำนักท่านพระสารีบุตร^500\nดีละหนอ^500\nขอเนื้อความแห่งภาษิตนั้น^500\nจงแจ่มแจ้งกะท่านพระสารีบุตรเถิด^500\nส. ถ้าเช่นนั้น^500\nท่านทั้งหลายจงฟัง\nจงใส่ใจให้ดี\nเราจักกล่าว^500\nภิกษุเหล่านั้น^500\nรับคำท่านพระสารีบุตรแล้ว^500\nท่านพระสารีบุตรได้กล่าวว่า^500\nท่านผู้มีอายุทั้งหลาย^500\nก็กษัตริย์เป็นบัณฑิตบ้าง^500\nพราหมณ์เป็นบัณฑิตบ้าง^500\nคฤหบดีเป็นบัณฑิตบ้าง^500\nสมณะเป็นบัณฑิตบ้าง^500\nเป็นผู้ถามปัญหากะภิกษุ^500\nผู้ไปไพรัชชประเทศต่างๆ มีอยู่^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nก็มนุษย์ทั้งหลายที่เป็นบัณฑิต^500\nจะทดลองถามว่า^500\nพระศาสดาของท่านผู้มีอายุทั้งหลาย^500\nมีวาทะว่าอย่างไร^500\nตรัสสอนอย่างไร?^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nท่านทั้งหลายถูกถามอย่างนี้แล้ว^500\nพึงพยากรณ์อย่างนี้ว่า^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nพระศาสดาของเราทั้งหลาย^500\nตรัสสอนให้กำจัดฉันทราคะ^500\nเมื่อท่านทั้งหลาย\nพยากรณ์อย่างนี้แล้ว^500\nกษัตริย์ผู้เป็นบัณฑิตบ้าง^500\nพราหมณ์ผู้เป็นบัณฑิตบ้าง^500\nคฤหบดีผู้เป็นบัณฑิตบ้าง^500\nสมณะผู้เป็นบัณฑิตบ้าง^500\nพึงถามปัญหายิ่งขึ้นไป^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nก็มนุษย์ทั้งหลายที่เป็นบัณฑิต^500\nจะทดลองถามว่า^500\nก็พระศาสดาของท่านผู้มีอายุทั้งหลาย^500\nตรัสสอนให้กำจัดฉันทราคะ\nในสิ่งอะไร^500\nท่านทั้งหลายถูกถามอย่างนี้แล้ว^500\nพึงพยากรณ์อย่างนี้ว่า^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nพระศาสดาตรัสสอน^500\nให้กำจัดฉันทราคะใน\nรูป เวทนา สัญญา\nสังขาร วิญญาณ^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nเมื่อท่านทั้งหลาย\nพยากรณ์อย่างนี้แล้ว^500\nกษัตริย์ผู้เป็นบัณฑิตบ้าง^500\nพราหมณ์ผู้เป็นบัณฑิตบ้าง^500\nคฤหบดีผู้เป็นบัณฑิตบ้าง^500\nสมณะผู้เป็นบัณฑิตบ้าง^500\nพึงถามปัญหายิ่งขึ้นไป^500\nก็มนุษย์ทั้งหลายที่เป็นบัณฑิต^500\nจะทดลองถามว่า^500\nก็พระศาสดาของท่านผู้มีอายุทั้งหลาย^500\nทรงเห็นโทษอะไร^500\nจึงตรัสสอน\nให้กำจัดฉันทราคะใน\nรูป เวทนา สัญญา\nสังขาร วิญญาณ?^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nท่านทั้งหลายถูกถามอย่างนี้แล้ว^500\nพึงพยากรณ์อย่างนี้ว่า^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nเมื่อบุคคลมีความกำหนัด^500\nความพอใจ ความรัก^500\nความกระหาย^500\nความกระวนกระวาย^500\nความทะยานอยากใน\nรูป เวทนา สัญญา\nสังขาร และวิญญาณ^500\nยังไม่ปราศจากไปแล้ว^500\nโสกะ ปริเทวะ ทุกข์ โทมนัส\nและอุปายาสย่อมเกิดขึ้น^500\nเพราะรูป เวทนา สัญญา\nสังขารและวิญญาณ\nแปรปรวนเป็นอย่างอื่นไป^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nพระศาสดาของเราทั้งหลาย^500\nทรงเห็นโทษนี้แล^500\nจึงตรัสสอน\nให้กำจัดฉันทราคะใน\nรูป เวทนา สัญญา\nสังขาร และวิญญาณ^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nแม้เมื่อท่านทั้งหลาย\nพยากรณ์อย่างนี้แล^500\nกษัตริย์ผู้เป็นบัณฑิตบ้าง^500\nพราหมณ์ผู้เป็นบัณฑิตบ้าง^500\nคฤหบดีผู้เป็นบัณฑิตบ้าง^500\nสมณะผู้เป็นบัณฑิตบ้าง^500\nพึงถามปัญหายิ่งขึ้นไป^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nก็มนุษย์ทั้งหลาย^500\nที่เป็นบัณฑิตจะทดลองถามว่า^500\nก็พระศาสดา^500\nของท่านผู้มีอายุทั้งหลาย^500\nทรงเห็นอานิสงส์อะไร?^500\nจึงตรัสสอน^500\nให้กำจัดให้ฉันทราคะใน\nรูป เวทนา สัญญา\nสังขาร วิญญาณ^500\nท่านทั้งหลายถูกถามอย่างนี้แล้ว^500\nพึงพยากรณ์อย่างนี้ว่า^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nเมื่อบุคคลมีความกำหนัด^500\nความพอใจ ความรัก^500\nความกระหาย^500\nความกระวนกระวาย^500\nความทะยานอยากใน\nรูป เวทนา สัญญา\nสังขาร และวิญญาณ\nปราศจากไปแล้ว^500\nโสกะ ปริเทวะ ทุกข์ โทมนัส\nและอุปายาสย่อมไม่เกิดขึ้น^500\nเพราะรูป เวทนา สัญญา\nสังขารและวิญญาณ\nแปรปรวนเป็นอย่างอื่นไป^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nพระศาสดาของเราทั้งหลาย^500\nทรงเห็นอานิสงส์นี้แล^500\nจึงตรัสสอนให้กำจัดฉันทราคะ\nในรูป เวทนา สัญญา\nสังขาร และ วิญญาณ^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nก็เมื่อบุคคล\nเข้าถึงอกุศลธรรมทั้งหลายอยู่^500\nจักได้มีการอยู่สบาย^500\nไม่มีความลำบาก^500\nไม่มีความคับแค้น^500\nไม่มีความเดือดร้อน\nในปัจจุบันนี้^500\nและเมื่อตายไปแล้ว^500\nก็พึงหวังสุคติไซร้^500\nพระผู้มีพระภาค^500\nก็จะไม่พึงทรงสรรเสริญ^500\nการละอกุศลธรรมทั้งหลาย^500\nก็เพราะเมื่อบุคคล\nเข้าถึงอกุศลธรรมทั้งหลาย^500\nย่อมมีการอยู่เป็นทุกข์^500\nมีความลำบาก^500\nมีความคับแค้น^500\nมีความเดือดร้อนในปัจจุบัน^500\nและเมื่อตายไปแล้ว^500\nก็พึงหวังได้ทุคติ^500\nฉะนั้นพระผู้มีพระภาค^500\nจึงทรงสรรเสริญ^500\nการละอกุศลธรรมทั้งหลาย^500\nดูกรท่านผู้มีอายุทั้งหลาย^500\nแต่เมื่อบุคคล\nเข้าถึงกุศลธรรมทั้งหลายอยู่^500\nจักได้มีการอยู่เป็นทุกข์^500\nมีความลำบาก^500\nมีความคับแค้น^500\nมีความเดือดร้อน\nในปัจจุบันนี้^500\nและเมื่อตายไปแล้ว^500\nก็พึงหวังได้ทุคติไซร้^500\nพระผู้มีพระภาค^500\nก็จะไม่พึงทรงสรรเสริญ^500\nการเข้าถึงกุศลธรรมทั้งหลาย^500\nก็เพราะเมื่อบุคคล^500\nเข้าถึงกุศลธรรมทั้งหลายอยู่^500\nมีการอยู่สบาย^500\nไม่มีความลำบาก^500\nไม่มีความคับแค้น^500\nไม่มีความเดือดร้อน\nในปัจจุบันนี้^500\nและเมื่อตายไปแล้ว^500\nก็พึงหวังได้สุคติ^500\nฉะนั้นพระผู้มีพระภาค^500\nจึงทรงสรรเสริญ^500\nการเข้าถึงกุศลธรรมทั้งหลาย^500\nท่านพระสารีบุตร\nได้กล่าวคำนี้แล้ว^500\nภิกษุเหล่านั้น^500\nชื่นชมยินดีภาษิต^500\nของท่านพระสารีบุตรฉะนี้แล',
        'พระนครสาวัตถี^500\nณ ที่นั้นแล ฯลฯ^500\nดูกรภิกษุทั้งหลาย^500\nเราจักแสดงภาระ^500\nผู้แบกภาระ^500\nเครื่องถือมั่นภาระ^500\nและเครื่องวางภาระ\nแก่เธอทั้งหลาย^500\nเธอทั้งหลายจงฟัง\nจงใส่ใจให้ดี\nเราจักกล่าว^500\nภิกษุเหล่านั้น\nทูลรับสนองพระพุทธดำรัสแล้ว^500\nพระผู้มีพระภาคได้ตรัสว่า^500\nดูกรภิกษุทั้งหลาย^500\nก็ภาระเป็นไฉน?^500\nพึงกล่าวว่า^500\nภาระ คืออุปาทานขันธ์  ๕^500\nอุปาทานขันธ์ ๕ เป็นไฉน?^500\nคือ อุปาทานขันธ์ คือรูป^500\nอุปาทานขันธ์  คือเวทนา^500\nอุปาทานขันธ์ คือสัญญา^500\nอุปาทานขันธ์ คือสังขาร^500\nและอุปาทานขันธ์ คือวิญญาณ^500\nดูกรภิกษุทั้งหลาย นี้เรียกว่าภาระ.^500\nดูกรภิกษุทั้งหลาย^500\nก็ผู้แบกภาระเป็นไฉน?^500\nพึงกล่าวว่าบุคคล^500\nบุคคลนี้นั้น คือ^500\nท่านผู้มีชื่ออย่างนี้^500\nมีโคตรอย่างนี้^500\nดูกรภิกษุทั้งหลาย^500\nนี้เรียกว่าผู้แบกภาระ.^500\nดูกรภิกษุทั้งหลาย^500\nก็เครื่องถือมั่นภาระเป็นไฉน?^500\nตัณหานี้ใด นำให้เกิดภพใหม่^500\nประกอบด้วยความกำหนัด^500\nด้วยอำนาจความเพลิดเพลิน^500\nมีปกติเพลิดเพลินยิ่ง^500\nในภพหรืออารมณ์นั้นๆ^500\nได้แก่กามตัณหา\nภวตัณหา\nวิภวตัณหา^500\nดูกรภิกษุทั้งหลาย^500\nนี้เรียกว่าเครื่องถือมั่นภาระ^500\nดูกรภิกษุทั้งหลาย^500\nก็การวางภาระเป็นไฉน?^500\nความที่ตัณหานั่นแลดับไปด้วย\nสำรอกโดยไม่เหลือ^500\nความสละ\nความสละคืน\nความพ้น\nความไม่อาลัย^500\nดูกรภิกษุทั้งหลาย^500\nนี้เรียกว่าการวางภาระ^500\nพระผู้มีพระภาค^500\nผู้พระสุคตศาสดา^500\nครั้นได้ตรัสไวยากรณ์ภาษิตนี้\nจบลงแล้ว^500\nจึงได้ตรัสคาถาประพันธ์^500\nต่อไปอีกในภายหลังว่า^500\nขันธ์ ๕ ชื่อว่าภาระแล^500\nและผู้แบกภาระคือบุคคล^500\nเครื่องถือมั่นภาระ^500\nเป็นเหตุนำมาซึ่งความทุกข์ในโลก^500\nการวางภาระเสียได้เป็นสุข^500\nบุคคลวางภาระหนักเสียได้แล้ว\nไม่ถือภาระอื่น^500\nถอนตัณหาพร้อม\nทั้งมูลรากแล้ว^500\nเป็นผู้หายหิวดับรอบแล้วดังนี้'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>เทวทหสูตร ภารสูตร</h2>
          </div>
          <div className="praise_container">
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0602;