import React, { useEffect, useRef } from 'react';
import Typed from 'typed.js';

const Lesson0403 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        'พาหิรอนิจจาสูตร\nว่าด้วยความเป็นอนิจจัง\nแห่งอายตนะภายนอกทั้งสามกาล\nดูกรภิกษุทั้งหลาย\nรูปที่เป็นอดีตและอนาคตเป็นของไม่เที่ยง\nจะกล่าวไปใยถึงรูปที่เป็นปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใยในรูปที่เป็นอดีต\nไม่เพลิดเพลินรูปที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด\nเพื่อดับรูปที่เป็นปัจจุบัน\nเสียง กลิ่น รส\nโผฏฐัพพะ ธรรมารมณ์\nที่เป็นอดีตและอนาคตเป็นของไม่เที่ยง\nจะกล่าวไปใยถึงที่ปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใยในธรรมารมณ์ที่เป็นอดีต\nไม่เพลิดเพลินในธรรมารมณ์ที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด\nเพื่อดับซึ่งธรรมารณ์ที่เป็นปัจจุบัน',
        'ว่าด้วยความเป็นทุกข์\nแห่งอายตนะภายนอกทั้งสามกาล\nดูกรภิกษุทั้งหลาย\nรูปที่เป็นอดีตและอนาคตเป็นทุกข์\nจะกล่าวไปใยถึงรูปที่เป็นปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใยในรูปที่เป็นอดีต\nไม่เพลิดเพลินรูปที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด\nเพื่อดับรูปที่เป็นปัจจุบัน\nเสียง กลิ่น รส\nโผฏฐัพพะ ธรรมารมณ์\nที่เป็นอดีตและอนาคตเป็นทุกข์\nจะกล่าวไปใยถึงที่ปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใยในธรรมารมณ์ที่เป็นอดีต\nไม่เพลิดเพลินในธรรมารมณ์ที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด\nเพื่อดับซึ่งธรรมารณ์ที่เป็นปัจจุบัน\nว่าด้วยความเป็นอนัตตา\nแห่งอายตนะภายนอกทั้งสามกาล\nดูกรภิกษุทั้งหลาย\nรูปที่เป็นอดีตและอนาคตเป็นอนัตตา\nจะกล่าวไปใยถึงรูปที่เป็นปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใยในรูปที่เป็นอดีต\nไม่เพลิดเพลินรูปที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด\nเพื่อดับรูปที่เป็นปัจจุบัน\nเสียง กลิ่น รส\nโผฏฐัพพะ ธรรมารมณ์\nที่เป็นอดีตและอนาคตเป็นอนัตตา\nจะกล่าวไปใยถึงที่ปัจจุบันเล่า\nอริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้\nย่อมไม่มีเยื่อใยในธรรมารมณ์ที่เป็นอดีต\nไม่เพลิดเพลินในธรรมารมณ์ที่เป็นอนาคต\nย่อมปฏิบัติเพื่อเบื่อหน่ายเพื่อคลายกำหนัด\nเพื่อดับซึ่งธรรมารณ์ที่เป็นปัจจุบัน'
      ],
      typeSpeed: 60,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.toggle()}>
              <i className="bi bi-pause-fill" />
            </button>
            {/*
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.start()}>Start</button>
            <button type="button" className="btn btn-primary me-2" onClick={() => typed.current.stop()}>Stop</button>
            */}
            <button type="button" className="btn btn-primary me-5" onClick={() => typed.current.reset()}>
              <i class="bi bi-x-lg" />
            </button>
            <h2 style={{display: 'inline-block'}}>พาหิรอนิจจาสูตร</h2>
          </div>
          <div>
            <h2>
              <span style={{ whiteSpace: 'pre' }} ref={el} />
            </h2>
          </div>
        </div>
      </section>
    </div>
  )
}

export default Lesson0403;