import React from 'react';

const Life13 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>วิปัสสนาภาวนา มีปัญญา รู้จริง รู้แจ้ง อริยสัจ 4 ได้อย่างไร?</h2>
          </div>
          <h4>
            <p>พระพุทธเจ้าโคตมะได้ตรัสรู้แล้วได้อบรมสั่งสอนชาวโลกอยู่ถึง 45 พรรษา คำสอนของพระองค์ท่านมีทั้งหมด 84,000 พระธรรมขันธ์ พระองค์ได้สรุปคำสอนของพระองค์ท่านไว้ว่า 
            ท่านสอนแต่เรื่องทุกข์และการดับทุกข์เท่านั้นแล้วท่านก็สอนต่อไปอีกว่า ทุกข์ของเราเกิดที่ไหนให้ดับที่นั่น และตรัสบอกไว้ว่าทุกข์ของคนเราเกิดที่ตา หู จมูก ลิ้น กาย ใจ หรืออินทรีย์ 6 นี่แหละ 
            เวลาจะดับทุกข์ก็ให้ดับที่ตา หู จมูก ลิ้น กาย ใจ แล้วพระองค์ท่านก็สอนต่อไปอีกว่าที่ทุกข์เกิดขึ้น ก็เพราะคนเราไม่รู้เท่าทันสิ่งที่มากระทบสัมผัสตา หู จมูก ลิ้น กาย ใจตามความเป็นจริงของโลกและชีวิต
            จึงไปหลงพอใจไม่พอใจกับสิ่งที่มากระทบสัมผัสอินทรีย์ 6 เมื่อตาเห็นรูป หูได้ยินเสียง จมูกได้กลิ่น ลิ้นได้รส กายสัมผัส ใจคิดนึก ถ้าเกิดความพอใจ หรือไม่พอใจขึ้นมา ก็หมายความว่าเราบำเพ็ญโลภะ โทสะ โมหะ 
            ให้กับตัวเราเองทันทีความพอใจแปลเป็นภาษาธรรมว่า ความโลภ ความไม่พอใจแปลเป็นภาษาธรรมว่า ความโกรธ ตามสิ่งที่มากระทบสัมผัสไม่ทันเรียกว่า โมหะหรือความหลง พระพุทธเจ้าตรัสไว้ว่าโลภะ โทสะ โมหะ 
            เป็นเหตุปัจจโยหรือสมุทัยของทุกข์ทั้งปวง ถ้าเราดับความพอใจและไม่พอใจได้ ก็หมายถึงเราดับความโลภ โกรธ หลง หรืออวิชชาได้ ก็ดับทุกข์ทั้งปวงได้ฉะนั้นจะดับความพอใจและความไม่พอใจได้นั้น 
            ต้องเข้าใจก่อนว่าความพอใจและไม่พอใจนี้ เป็นความเชื่อไม่ใช่ความจริง จะดับความเชื่อได้ก็ต้องเอาความจริงมาดับ ความจริงที่จะดับความเชื่อได้ก็ต้องเป็นความจริงของโลกและชีวิตที่พระพุทธเจ้าตรัสรู้ไว้ 
            คือกฎธรรมชาติ 2 กฎแรกคือกฎไตรลักษณ์ อนิจจัง ทุกขัง อนัตตา หรือ เกิดขึ้น ตั้งอยู่ ดับไป กฎอันที่ 2 คือกฎของเหตุปัจจัยหรืออิทัปปัจจยตาปฏิจจสมุปบาท ทั้งสองกฎนี้พระพุทธเจ้าสรุปว่า สิ่งทั้งปวงไม่เที่ยงเกิดดับ 
            เกิดจากเหตุปัจจัยมาประชุมกันเท่านั้น ไม่มีตัวตนเป็นของตนเอง แล้วเอาความจริงคำว่าไม่เที่ยงเกิดดับ ไปไล่ดับความเชื่อที่เป็นความพอใจและไม่พอใจ ที่เกิดขึ้นทางตา หู จมูก ลิ้น กาย ใจ โดยเอาความจริงคำว่า ไม่เที่ยง เกิดดับ 
            มาตั้งกั้นความเชื่อไว้ที่ตา หู จมูก ลิ้น กาย ใจ เพื่อรับการกระทบสัมผัสในขณะปัจจุบัน (กั้นตรงผัสสะ ไม่ให้เลยไปถึงเวทนา) ความเชื่อคือความพอใจและไม่พอใจจะถูกดับทันที ทุกข์หรือปัญหาก็จะถูกดับลงไปตั้งแต่ถูกกระทบ 
            จึงไม่มีทุกข์หรือปัญหาจะเกิดต่อไปอีก</p><br /><hr /><br /><br />
            <p>เมื่อเราฝึกสติดึงหรือลากเอาความจริงของโลกและชีวิตคำว่าไม่เที่ยง เกิดดับ มาตั้งไว้ที่อินทรีย์ 6 อย่างนี้ ความพอใจและไม่พอใจจะดับไปทันทีที่ถูกกระทบ 
            หมายความว่าโลภะ โทสะ โมหะ เหตุปัจจโยหรือสมุทัยของทุกข์หรืออวิชชาดับลงไปแล้ว ปัญญาหรือวิชชาก็จะเกิดขึ้นต่อ พิจารณาให้เห็นความจริงของสิ่งทั้งปวงรวมทั้งตัวของเราว่าไม่เที่ยง เกิดดับ มีเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย 
            ไม่มีตัวตนเป็นของตนเอง ความเห็นอย่างนี้เรียกว่าสัมมาทิฐิ และสัมมาทิฐิ หรือปัญญาเกิดขึ้นแล้ว สัมมาสังกัปปะ ดำริชอบ (ความคิดถูก) ก็เกิดขึ้นตามมา แล้วองค์ธรรมของมรรคมีองค์ 8 ก็เกิดขึ้นครบ จึงมีปัญญาดับทุกข์ ณ ที่ถูกกระทบสัมผัสได้ทันที
            ในขณะปัจจุบัน ทุกข์ต่อไปก็ไม่มีอีก เมื่อมีมรรคมีองค์ 8 เกิดขึ้นแล้ว ต่อไปก็มีสติปัฏฐาน 4 สัมมัปปธาน 4 อิทธิบาท 4 อินทรีย์ 5 พละ 5 โพชฌงค์ 7 เกิดขึ้นครบโพธิปักขิยธรรม 37 ประการ คือองค์ธรรมของการบรรลุมรรคผลนิพพานเกิดขึ้น 
            แล้วจากนั้นก็จะรู้เห็นทุกข์ สมุทัย นิโรธ มรรค และเข้าถึงอริยสัจ 4 ที่พระพุทธเจ้าตรัสรู้บอกไว้ดังนี้</p><br />
            <p>1. รู้ว่าความพอใจและไม่พอใจที่เกิดขึ้นจากการกระทบสัมผัสทางอินทรีย์ 6 หรือตา หู จมูก ลิ้น กาย ใจ 
            ในขณะปัจจุบันก็คือ ทุกข์ (ธรรมที่ควรกำหนดรู้ด้วยปัญญาอันยิ่ง)<br /></p>
            <p>2. การไม่รู้เท่าทันสิ่งที่มากระทบสัมผัสอินทรีย์ 6 ในขณะปัจจุบันเรียกว่า ความหลงหรือโมหะ ทำให้ไปหลงพอใจ ไม่พอใจกับสิ่งทั้งปวงที่เกิดขึ้น
            จากการกระทบสัมผัสทางตา หู จมูก ลิ้น กาย ใจ เรียกว่า เหตุของการเกิดทุกข์ หรือ สมุทัย (ธรรมที่ควรละด้วยปัญญาอันยิ่ง)<br /></p>
            <p>3. ถ้าเรารู้เท่าทันสิ่งที่มากระทบสัมผัสตัวของเราทั้งอินทรีย์ 6 หรือตา หู จมูก ลิ้น กาย ใจ 
            ตามความเป็นจริงของโลกและชีวิตว่าไม่เที่ยง เกิดดับ เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย ไม่มีตัวตนเป็นของตนเอง ตามกฎธรรมชาติ 2 กฎ ที่พระพุทธเจ้าตรัสรู้ไว้ รู้อย่างนี้ดับทุกข์ได้ คือดับความพอใจและไม่พอใจ
            เรียกว่า นิโรธ (ธรรมที่ควรทำให้แจ้งด้วยปัญญาอันยิ่ง)<br /></p>
            <p>4. การวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ให้รู้เท่าทันสิ่งทั้งปวงตามความเป็นจริงของโลกและชีวิตในขณะปัจจุบันเรียกว่า มรรค ทางดับทุกข์หรือ มรรคปฏิปทา 
            (ธรรมที่ควรทำให้เจริญด้วยปัญญาอันยิ่ง) ถ้าพิจารณาให้รู้เท่าทันสิ่งทั้งปวงที่มากระทบสัมผัสตัวเราในขณะปัจจุบันทางตา หู จมูก ลิ้น กาย ใจ แล้วจะมีสัมมาทิฐิ องค์ธรรมของมรรคองค์แรกเกิดขึ้นต่อไปองค์ธรรมของมรรคก็เกิดขึ้นครบ 
            แล้วจะมีปัญญาหรือความรู้ที่ดับทุกข์ได้เกิดขึ้น ตามทันดับความพอใจหรือไม่พอใจทันทีที่ถูกกระทบสัมผัสในขณะปัจจุบัน จึงดับทุกข์หรือสมุทัยของทุกข์ ได้ทันที</p><br /><hr /><br /><br />&nbsp; &nbsp;
            <p>การวิปัสสนาภาวนาพิจารณาขันธ์ 5 และ 6 อย่างนี้เรียกว่ามรรคปฏิปทา หรือ ทางดับทุกข์ เมื่อพิจารณาเป็นประจำจนเป็นปกติในชีวิตประจำวันแล้วความรู้ที่ดับทุกข์ได้หรือปัญญาก็จะเกิดขึ้นมาตามทันความพอใจและไม่พอใจ 
            จึงดับความหลง ความโลภ และดับความโกรธ หรือดับโลภะ โทสะ โมหะ เมื่อดับเหตุของทุกข์หรือสมุทัยได้แล้วก็ดับอวิชชาได้ เมื่อดับอวิชชาได้แล้ว ก็ดับความเกิดได้ มีปัญญารู้จริง รู้แจ้งในอริยสัจ 4 ที่พระพุทธเจ้าตรัสรู้ไว้</p><br /><hr /><br /><br />
            <p>ฉะนั้นพระธรรมที่เป็นทางสายเอกที่พระพุทธเจ้าตรัสรู้ บอกทางไว้ให้คือการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ให้รู้เห็นสิ่งทั้งปวงที่มากระทบตัวของเราในขณะปัจจุบัน ตามความจริงของโลกและชีวิต คือกฎธรรมชาติ 2 กฎ 
            ที่พระพุทธเจ้าตรัสรู้ไว้นี้เป็นเหตุของการตรัสรู้ รู้จริง รู้แจ้ง ในอริยสัจ 4 มีปัญญาดับทุกข์ได้ถาวร</p><br /><br />
          </h4>
          <a href="/introduction">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              บทสรรเสริญคุณพระรัตนตรัย
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life13;