import React from 'react';

const Life10 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ความคิดเห็นของคนเราคืออะไร?</h2>
          </div>
          <h4>
            <p>ความคิดเห็นของคนเราเป็นเรื่องของนามธรรมหรือจิตใจ ไม่สามารถดูด้วยตาได้ ใจของเรามีหน้าที่อยู่ 4 อย่าง คือ รับ (เวทนา) จำ (สัญญา) คิด (สังขาร) รู้ (วิญญาณ) 
            เมื่อมีอะไรมากระทบสัมผัสอินทรี 6 คือตา หู จมูก ลิ้น กาย ใจ จิตใจก็จะทำหน้าที่รับ จำ คิด รู้ อย่างนี้เกิดขึ้นทั้ง 6 ทาง แล้วประมวลข้อมูลที่ถูกกระทบสัมผัสทั้งหมด 
            เป็นความพอใจและไม่พอใจเข้าไปเก็บไว้ในจิตใจหรือฮาร์ดดิสก์ ใจของคนเรานี้มีลักษณะที่ถมไม่เต็ม เก็บข้อมูลหาที่สิ้นสุดไม่ได้ ในใจของคนทุกคนจึงมีข้อมูลการเวียนว่ายตายเกิดมานับชาติไม่ถ้วน
            ฝังอยู่ในจิตใต้สำนึก</p><br /><hr /><br /><br />
            <p>ฉะนั้นความคิดเห็นของคนเราก็คือผลกรรม หรือการกระทำของเราในอดีตที่ผ่านมา มีทั้งอดีตใกล้ อดีตไกล ผ่านเข้ามาทางตา หู จมูก ลิ้น กาย ใจ 
            แล้วเอามาเก็บไว้ในใจ พูดง่ายๆก็คือบุญบาปที่เกิดจากการกระทำของเราในอดีตและปัจจุบัน ตัวของเราทั้งหมดนี้คือผลของอดีต เมื่อมีอะไรมากระทบอินทรีย์ 6 ทุกครั้ง ที่เรียกว่าอายตนะภายนอก 
            คือรูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์ ทั้งหมดคือผลของการกระทำของเราในอดีตและปัจจุบัน มีทั้งเป็นสิ่งที่ดีและไม่ดี มากระทบสัมผัสตัวเรา 
            ข้อมูลที่อยู่ในใจของเราก็จะออกมารับการกระทบและปรุงแต่งต่อไป ทำให้เกิดความพอใจไม่พอใจและเกิดขึ้นตลอดเวลา แล้วนำไปสู่การกระทำต่อไปในทางกาย วาจา และทางใจ 
            มีผลเป็นบุญเป็นบาปเกิดขึ้นต่อไปอีกอย่างนี้ หาที่สุดไม่ได้วนเวียนอยู่อย่างนี้ ข้อมูลใหม่ก็เก็บไว้ในจิตใจต่อไป</p><br /><hr /><br /><br />
            <p>สิ่งที่มากระทบสัมผัสอินทรีย์ 6 (ตา หู จมูก ลิ้น กาย ใจ) ของแต่ละคนนั้นคือผลรวมของการกระทำในอดีตของเรานั่นเองตามมาให้ผล 
            จะเห็นว่าพวกเราแต่ละคนในแต่ละครั้งได้รับการกระทบสัมผัสของแต่ละคนไม่เหมือนกัน เพราะผลการกระทำที่เรียกว่ากรรมนั้นแตกต่างกัน จึงได้รับผลกระทบแตกต่างในการดำเนินชีวิตของแต่ละคน
            พระพุทธเจ้าได้ตรัสไว้ว่า &ldquo;กรรม หรือการกระทำนั้น จำแนกบุคคลให้แตกต่างกัน ทุกคนมีกรรมเป็นของตนเอง มีกรรมเป็นเผ่าพันธุ์&rdquo; กรรมหรือการกระทำ 
            ทำให้คนเรามีชีวิตความเป็นอยู่แตกต่างกัน ความคิดนึกของแต่ละคนก็ไม่เหมือนกัน เพราะข้อมูลที่สะสมไว้ในจิตใจแตกต่างกัน เช่นบางครั้งจะเห็นว่าเมื่อมีอะไรมากระทบสัมผัสเหมือนกัน 
            บางคนพอใจ บางคนไม่พอใจกับสิ่งที่มากระทบตัวเอง อย่างนี้เป็นต้น</p><br /><hr /><br /><br />
            <p>กรรม หรือการกระทำของคนเรา ที่กระทำลงไปนั้น แต่ละครั้งมีผลออกมาเป็นบุญและบาป &nbsp;แล้วเก็บไว้ในจิตใจ 
            ในจิตใต้สำนึกของเราทุกคนจะมีผลการกระทำที่เป็นบุญเป็นบาป แล้วเก็บมากมายจนนับไม่ได้ เพราะเราเวียนว่ายตายเกิดนับชาติไม่ถ้วน 
            บุญบาปที่เป็นผลของกรรมหรือการกระทำของเรานี้เป็นผู้กำหนดจิตใจของคนเราแต่ละคนความคิดนึกของคนเราแต่ละครั้งจะถูกแรงผลักดันที่เป็นบุญเป็นบาปนี้ผลักดันออกมา แล้วแต่ว่าช่วงไหนจังหวะไหน 
            ถ้าบุญมีมากกว่าในขณะนั้น บุญก็ผลักดันให้เราคิด แต่ถ้าช่วงไหนบาปมีพลังมากกว่า บาปก็ผลักดันออกมาเป็นความคิดนึกของเรา บุญและบาปที่เราทำไว้นอกจากจะเป็นแรงผลักดันให้คนเราคิดนึกแล้ว 
            ยังมีผลที่เป็นบุญเป็นบาปมาในรูปของ อายตนะภายนอก คือรูป เสียง กลิ่น รส โผฏฐัพพะ และธรรมารมณ์ กระทบสัมผัสตัวเราเพื่อให้ผล ถ้าเป็นส่วนของบุญสิ่งที่มากระทบสัมผัสก็จะเป็นสิ่งที่ดีงาม 
            ทำให้เกิดความสุข แต่ถ้าเป็นส่วนที่เป็นบาป สิ่งที่มากระทบสัมผัสก็เป็นสิ่งที่ไม่ดีงาม ทำให้เราไม่พอใจอย่างนี้เป็นต้น มากระทบตัวเราตลอดเวลาตั้งแต่เกิดจนตาย 
            ในวิถีชีวิตของคนเราบุญบาปก็จะเข้ามากระทบสัมผัสตัวของเราดังที่กล่าวมาแล้ว</p><br /><hr /><br /><br />
            <p>สรุป ความคิดนึกของคนเราทุกคน ก็คือความเคยชินที่เป็นบุญเป็นบาปที่ได้มาจากความพอใจหรือไม่พอใจเมื่อถูกกระทบสัมผัส ได้สั่งสมไว้ในใจด้วยการกระทำ ตั้งแต่อดีตจนถึงปัจจุบัน 
            มาปรุงแต่งเป็นความคิดที่เรียกว่าสังขาร ความคิดของคนเราจะเกิดจากข้อมูลที่เรียกว่าสัญญา (ความจำ) ที่เป็นบุญเป็นบาปที่เก็บไว้ในใจ เมื่อมีอะไรมากระทบสัมผัสกับอินทรีย์ 6 
            ข้อมูลเก่าที่เก็บไว้ในใจก็จะออกมารับและปรุงแต่งต่อไป มีผลออกมาเป็นความพอใจและไม่พอใจทุกครั้ง เป็นกรรมใหม่เกิดขึ้นสะสมต่อไปวนเวียนอยู่อย่างนี้หาที่สุดไม่ได้ 
            ถ้าไม่พบทางดับทุกข์ที่เป็นทางสายเอกที่พระพุทธเจ้าสอนไว้ทุกลมหายใจ</p><br /><hr /><br /><br />
            <p>พระพุทธเจ้าตรัสบอกไว้ว่าถ้าบุคคลใดไม่มีปัญญารู้เท่าทันความจริงของโลกและชีวิตที่มากระทบสัมผัสกับตัวเราตลอดเวลาแล้ว 
            ก็จะไปหลงพอใจหรือไม่พอใจกับสิ่งที่มากระทบสัมผัสตัวเราตามผลของกรรมที่เราได้กระทำไว้ จากนั้นก็เอาความพอใจและไม่พอใจนั้น ไปคิดปรุงแต่งต่อไป แล้วถ่ายทอดไปสู่การกระทำต่อไปอีก 
            ผลก็ออกมาเป็นการสร้างกรรมใหม่ที่มีผลเป็นบุญเป็นบาป เก็บเพิ่มเติมไว้ในใจของคนเราต่อไปอีกหาที่สิ้นสุดไม่ได้ วนเวียนอยู่อย่างนี้ ความพอใจ หรือไม่พอใจนั้น คือความหลงหรือเรียกว่าอวิชชา ต้นเหตุหรือสมุทัยของทุกข์ทั้งปวง</p><br /><hr /><br /><br />
            <p>พระพุทธเจ้า พระองค์ท่านพบทางดับทุกข์ แล้วตรัสแสดงบอกทางดับทุกข์ไว้ให้ ท่านบอกไว้ว่าทุกข์เกิดที่ไหนให้ดับที่นั่น ทุกข์เกิดที่อินทรีย์ 6 คือตา หู จมูก ลิ้น กาย ใจ นี่แหละ ดับทุกข์ก็ให้ดับที่อินทรีย์ 6 นี้ 
            ทุกข์เกิดขึ้นเพราะเราไม่รู้ความจริงของโลกและชีวิตที่มากระทบสัมผัสตัวเอง แล้วไปหลงพอใจไม่พอใจกับสิ่งเหล่านั้นจึงทำให้เกิดทุกข์ถ้าต้องการดับทุกข์ก็ให้ฝึกฝนตนเองตามทางสายเอกที่พระพุทธองค์ตรัสบอกไว้ 
            คือการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ให้รู้เห็นสิ่งทั้งปวงตามความเป็นจริงของโลกและชีวิตในขณะปัจจุบันว่าไม่เที่ยง เป็นทุกข์ เป็นอนัตตา ไม่มีตัวตนเป็นของตนเอง เกิดจากเหตุและปัจจัย 
            ให้พิจารณาอย่างนี้แล้วปัญญาจะเกิดขึ้น รู้เท่าทันสิ่งที่มากระทบสัมผัสกับตัวของเรา ตามความเป็นจริงของโลกและชีวิต และความพอใจไม่พอใจ หรือความหลง หรืออวิชชา ก็ไม่เกิดขึ้นมานำความคิดของเราไปสู่การกระทำต่อไป 
            ความพอใจและไม่พอใจก็ไม่มีเหตุปัจจัยเพิ่มเติมให้เกิดขึ้นมาอีก เมื่อเหตุปัจจัยหมดแล้ว ความทุกข์ก็หมด ไม่เกิดขึ้นมาอีกเรียกว่าดับทุกข์ พบสุขถาวรตามที่ชีวิตของทุกคนต้องการและตั้งเป้าหมายไว้ในการเกิดมาเป็นคน 
            ผู้นั้นก็จะมีชีวิตอยู่ด้วยปัญญาไม่มีปัญหามารบกวนจิตใจอีก</p><br /><br />
          </h4>
          <a href="/life11">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              วิปัสสนาดับทุกข์และสร้างสุขถาวรได้อย่างไร?
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life10;