import React from 'react';

const Life05 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ความพอดีของคนเราอยู่ตรงไหน?</h2>
          </div>
          <h4>
            <p>คนเราทุกคนเกิดมาต้องดิ้นรนเสาะแสวงหาความพอดีให้กับตัวเองตลอดเวลา แต่ก็ไม่ประสบความสำเร็จในแต่ละชีวิต ขาดไปบ้าง เกินไปบ้าง 
            พยายามเสาะแสวงหาไปตลอดชีวิต แล้วก็ไม่มีใครพบความพอดีให้กับตนเองได้ง่ายๆ หรือไม่เคยพบเคยเห็นเคยรู้มาก่อนตลอดชีวิตของตนเอง
            ว่าความพอดีของตนเองที่ตนเองต้องการนั้นมันอยู่ที่ไหน บางครั้งก็พบอยู่บ้าง แต่ก็เป็นความพอดีชั่วครั้งชั่วคราวเท่านั้น ไม่จีรังยั่งยืนตามที่คนเราต้องการ 
            และก็ไม่เข้าใจว่าความพอดีที่เราได้มาชั่วคราวนั้น จริงๆแล้วมันใช่ความพอดีที่ชีวิตต้องการหรือไม่ แต่ละคนที่เกิดมาก็พยายามเสาะแสวงหามันต่อไป 
            บางครั้งชีวิตในชาตินี้ไม่พอที่จะแสวงหาความพอดีให้พบได้ เพราะแต่ละคนก็ใช้วิธีการของแต่ละคนเสาะแสวงหาความพอดีให้กับตนเองแตกต่างกันไป 
            แต่ก็ไม่มีผู้ใดพบได้ ที่เป็นอย่างนี้ก็เพราะคนเราเกิดมาไม่มีความรู้เพียงพอที่จะไปแสวงหาความพอดีให้กับตนเอง แม้กระทั่งความรู้เกี่ยวกับตัวของตัวเอง 
            คนเรายังไม่รู้จัก ซึ่งอยู่กับตัวเรานี่แหละ ใกล้ชิดติดกันอย่างนี้ยังไม่รู้จักแล้วจะไปรู้จักสิ่งอื่นๆนั้นไกลเกินไป สิ่งที่ใกล้ใกล้นี้ยังไม่เข้าใจ แล้วสิ่งที่อยู่ไกลจะรู้จักให้ดีได้อย่างไร</p><br /><br />
            <p>เพื่อจะได้มีความเข้าใจถูกต้องในเบื้องต้นจึงต้องขอทำความเข้าใจเกี่ยวกับชีวิตของตนเองก่อนว่าคนเราเกิดมาเพื่ออะไร คนเราเกิดมาเพื่อจะหนีทุกข์ไปหาสุขกันทุกคน 
            สุขนั้นก็ต้องการสุขที่ถาวรตลอดไป สุขชั่วคราวไม่มีผู้ใดต้องการ สุขถาวรที่ทุกคนต้องการแปลเป็นภาษาธรรมเรียกว่า &ldquo;นิพพาน&rdquo; 
            คนทุกคนที่เกิดมามีความต้องการสุขถาวรหรือนิพพานกันทุกคน ฉะนั้นเป้าหมายของชีวิตคนเราทุกคนคือ &ldquo;นิพพาน&rdquo;</p><br /><br />
            <p>แล้วก็ชีวิตคืออะไรชีวิตของคนเราคือการศึกษาเรียนรู้ฝึกฝนตนเองคนเราทุกคนเกิดมาไม่ได้อะไรมาฟรีๆ ต้องศึกษาเรียนรู้เอาทั้งหมด ถ้าไม่ได้ศึกษาเรียนรู้ก็ไม่ได้อะไรเลย 
            และชีวิตของคนเราต้องฝึกฝนตนเองอยู่เสมอ พระพุทธเจ้าตรัสไว้ว่ามนุษย์เป็นสัตว์ประเสริฐด้วยการฝึก ถ้าไม่ฝึกแล้วเลวยิ่งกว่าสัตว์เดรัจฉาน แล้วคนเราจะฝึกฝนตนเองได้ที่ไหน 
            มีเครื่องมืออะไรที่ธรรมชาติให้มาฝึกฝนตนเองบ้าง คนเราจะฝึกฝนตนเองได้ที่ตา หู จมูก ลิ้น กาย ใจ ที่เรียกว่าอินทรีย์ 6 &nbsp;อินทรีย์ 6 
            นี้แหละที่ธรรมชาติให้มาเป็นเครื่องมือในการฝึกฝนตนเองคนเราจะดีหรือเลวอยู่ที่การใช้อินทรีย์ 6 นี้แหละถ้าใช้อินทรีย์ 6 ไปในทางรับความรู้สึกอย่างเดียวชีวิตก็จะมีแต่ปัญหา 
            แต่ถ้าใช้อินทรีย์ 6 ในการทางการศึกษาเรียนรู้ชีวิตของคนๆนั้นก็จะปัญหาน้อย พบแต่ความสุข<br />
            เมื่อเรารู้จักตัวเองดีแล้ว เราก็จะรู้จักใช้เครื่องมือฝึกฝนตนเองที่ธรรมชาติให้มาต่อไปเราจะพบความพอดีของชีวิตของเราได้อย่างไร และมีผู้ใดที่รู้เรื่องราวของโลกและชีวิตดีที่สุด 
            บุคคลที่รู้เรื่องราวของชีวิตดีที่สุดในโลกก็คือพระพุทธเจ้าศาสดาเอกของโลกเป็นผู้รู้แจ้งโลกและชีวิต หาผู้ใดเสมอเหมือนไม่ได้ในโลกนี้หรือโลกไหนๆ พระองค์ได้ตรัสสั่งสอนมนุษย์และเทวดาอยู่ถึง 45 พรรษา 
            คำสอนของพระองค์มีถึง 84,000 พระธรรมขันธ์ คำสอนของพระองค์ท่านทั้งหมดพระองค์ท่านสรุปไว้ว่าพระองค์ท่านสอนเรื่องทุกข์และการดับทุกข์เท่านั้น 
            คำสอนของพระองค์ท่านขณะนี้ได้จารึกไว้ในพระไตรปิฎกจำนวน 45 เล่ม ถ้ามนุษย์ทุกคนต้องการความพอดีของชีวิตตนเองว่าอยู่ตรงไหน 
            ต้องศึกษาเรียนรู้จากพระธรรมคำสอนของพระองค์ท่านที่สอนให้ไว้ในพระไตรปิฎกให้จบหลายๆรอบแล้ว ท่านจะรู้เห็นความจริงของโลกและชีวิตของท่าน แล้วก็จะหาพบความพอดีของชีวิตท่านได้<br />
            พระพุทธเจ้าตรัสไว้ว่าที่สุดโต่งของมนุษย์มี 2 ด้านสุดโต่งด้านที่ 1 คือความพอใจ (กามสุขัลลิกานุโยค) และที่สุดโต่งอีกด้านหนึ่งก็คือความไม่พอใจ (อัตตกิลมถานุโยค) 
            มนุษย์ส่วนมากจะไปตกอยู่ในที่สุด 2 ด้านนี้ตลอดเวลา ความพอใจก็คือความโลภ ความไม่พอใจก็คือความโกรธ ตามความพอใจ ไม่พอใจไม่ทันเรียกว่าความหลง 
            ชีวิตของคนเราจึงไปหลงพอใจไม่พอใจอยู่ตลอดเวลา จึงไม่มีโอกาสพบความพอดีของชีวิต ความพอดีของชีวิตก็คือหลักสายกลางหรือหลักของความจริง 
            ไม่ไปเกี่ยวข้องกับความพอใจไม่พอใจ โดยรู้เท่าทันความจริงของโลกและชีวิตคือกฎธรรมชาติ 2 กฎที่พระพุทธเจ้าตรัสรู้ไว้ อันได้แก่กฎไตรลักษณ์ อนิจจัง ทุกขัง อนัตตา หรือเกิดขึ้น ตั้งอยู่ ดับไป
            และกฎของเหตุปัจจัยหรืออิทัปปัจจยตา ปฏิจจสมุปบาท ในโลกนี้ไม่มีอะไรเกิดขึ้นลอยๆหรือบังเอิญมีเหตุปัจจัยให้เกิดเสมอ<br />
            เมื่อคนเราฝึกฝนตนเองให้รู้เท่าทันความจริงของโลกและชีวิตตามที่พระพุทธเจ้าตรัสไว้แล้วก็จะรู้เท่าทันสิ่งที่มากระทบสัมผัสตัวของเราหรืออินทรีย์ 6 
            ตามความเป็นจริงของโลกและชีวิตว่าสิ่งทั้งปวงไม่เที่ยง เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราว ไม่มีตัวตนเป็นของตนเอง 
            เมื่อรู้อย่างนี้แล้วตัวของเราก็ไม่ไปหลงพอใจและไม่พอใจต่อสิ่งที่มากระทบสัมผัสตัวของเรา สัมมาทิฐิหรือปัญญาก็เกิดขึ้นทันทีและองค์ธรรมของมรรคมีองค์ 8 
            เกิดขึ้นตามมาคือสัมมาสังกัปปะ สัมมาวาจา สัมมากัมมันตะ สัมมาอาชีวะ สัมมาวายามะ สัมมาสติ สัมมาสมาธิ นี่คือหลักความจริง หรือหลักสายกลาง 
            หรือหลักของความพอดี ความพอดีของชีวิตคนเราอยู่ตรงนี้ ความพอดีของชีวิตคนเราอยู่ตรงที่คนเรารู้เท่าทันสิ่งที่มากระทบสัมผัสตา หู จมูก ลิ้น กาย ใจ 
            ตามความเป็นจริงของโลกและชีวิตเราจึงไม่ไปสุดโต่งทั้ง 2 ด้านคือความพอใจและไม่พอใจ<br />
            วิธีปฏิบัติตนเองให้เข้าถึงความพอดีของชีวิตก็เอาหลักทางสายเอกที่พระพุทธองค์ตรัสสอนไว้ คือหลักวิปัสสนาภาวนาพิจารณาขันธ์ 5 &nbsp;อินทรีย์ 6 
            ให้รู้ให้เห็นสิ่งทั้งปวงว่าไม่เที่ยง เกิดดับ เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย ไม่มีตัวตนเป็นของตนเองการปฏิบัติให้ถึงความพอดีของชีวิต 
            คือเริ่มตื่นนอนขึ้นมาให้เห็นทุกสิ่งทุกอย่างรวมทั้งตัวของเราไม่เที่ยง เกิดดับ ไม่มีตัวตนเป็นของตนเอง เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวเท่านั้น แล้วก็แตกสลายไป 
            ต่อไป ตาเห็นรูปอะไร ให้พิจารณาว่ารูปไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ หูได้ยินเสียง ให้พิจารณาว่าเสียงไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ จมูกได้กลิ่น 
            ให้พิจารณาว่ากลิ่นไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ ลิ้นกระทบรส ให้พิจารณาว่ารสไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ 
            กายกระทบสัมผัสให้พิจารณาว่าสิ่งที่มากระทบสัมผัสไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ ใจนึกคิดขึ้นมาให้พิจารณาว่าความคิดไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ 
            ให้พิจารณาให้เห็นความจริงทั้งสองด้านอย่างนี้ตลอดเวลา เวลาออกจากบ้านไปทำงานให้พิจารณาอย่างนี้ มองดูบ้านของตัวเองให้เห็นความจริงว่าบ้านฉันใหม่แล้วก็เก่า 
            แล้วจะต้องแตกสลายในที่สุด ตัวของเราก็หนุ่มแก่แล้วตาย เห็นผู้คนทั้งหลายก็เกิดดับแตกสลายเช่นกันปฏิบัติอย่างนี้ทุกวันความพอใจหรือไม่พอใจ
            หรือโลภะ โทสะ โมหะก็จะลดลงไปทุกวันความจริงที่เรียกว่าปัญญาก็จะเข้ามาแทนที่ในใจของเรา เมื่อมีอะไรมากระทบสัมผัสตัวของเราทางอินทรีย์ 6 สติก็จะดึงปัญญาออกมารับ 
            ปัญหาก็จะถูกแก้ไขไปในทางที่ถูกต้องทุกครั้ง ปัญหาของชีวิตก็ลดน้อยลงทุกวันในที่สุดก็หมดไป การวิปัสสนาอย่างนี้ไม่กระทบกระเทือนเวลาการทำงานในหน้าที่ของท่าน 
            มีแต่จะเสริมสร้างงานและชีวิตของท่านให้ดีขึ้น เพราะการปฏิบัติอย่างนี้จึงมีปัญญา (ความรู้ที่ดับทุกข์หรือแก้ปัญหาได้) 
            เกิดขึ้นมาพร้อมกับการทำงานหรือการดำเนินชีวิตของท่าน ปัญญาที่เกิดขึ้นก็จะแก้ปัญหาให้กับท่านตั้งแต่ถูกกระทบสัมผัส แล้วปัญหาที่เกิดขึ้นต่อไปอีกก็ไม่มี 
            อุปมาเหมือนเมล็ดมะม่วงที่งอกขึ้นมาแล้วก็รีบบี้มันทิ้งเสียทันทีที่มันงอก มะม่วงก็ไม่มีต้นเกิดขึ้นให้รกรุงรังในบ้านของเราอีก ฉันใด ก็ฉันนั้น </p>
            <p>การที่เราเอาความจริงของโลกและชีวิตตามกฎธรรมชาติของกฎดังกล่าวนั้นมาตั้งไว้ที่ตา หู จมูก ลิ้น กาย ใจที่เป็นทางแห่งการเกิดทุกข์หรือปัญหาพื้นฐานรองรับการกระทบสัมผัสอย่างนี้
            เรียกว่าเอาความจริงหรือปัญญาหรือสัมมาทิฐิมาตั้งรับกระทบสัมผัส แล้วจะทำให้ดำริชอบ (สัมมาสังกัปปะ) หรือความคิดถูกต้องเกิดขึ้น ต่อไปองค์ธรรมของมรรคมีองค์ 8 
            เกิดขึ้นครบคือสัมมาวาจา สัมมากัมมันตะ สัมมาอาชีวะ สัมมาวายามะ สัมมาสติ สัมมาสมาธิ นี่แหละคือหลักสายกลางคือหรือหลักแห่งความพอดีของชีวิต
            ไม่เข้าไปเกี่ยวข้องในทางสุดโต่งทางใดทางหนึ่งคือความพอใจและไม่พอใจ เมื่อคนเราปฏิบัติวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 อย่างนี้ตลอดเวลา 
            องค์ธรรมของการบรรลุมรรคผลนิพพานเกิดขึ้นตามครบโพธิปักขิยธรรม 37 ประการ คือ มรรคมีองค์ 8 สติปัฏฐาน 4 สัมมัปปธาน 4 อิทธิบาท 4 อินทรีย์ 5 พละ 5 โพชฌงค์ 7 
            เมื่อมีองค์ธรรมเหล่านี้เกิดขึ้นครบเป็นปกติในชีวิตประจำวันแล้ว ชีวิตของเราก็จะพบความพอดีของชีวิตถาวร ซึ่งชีวิตของมนุษย์ทุกคนต้องการความต้องการอันนี้ซ่อนอยู่ในจิตใต้สำนึกของทุกคน
            ถ้าสภาวะจิตเบาบางจากกิเลสตัณหาลงไปบ้างก็จะมองเห็นความจริงอันนี้ได้<br />
            นี่คือหลักการและหลักปฏิบัติให้ชีวิตของเราเองเข้าไปถึงความพอดีของชีวิตความพอดีของชีวิตทุกคนอยู่ที่การรู้เท่าทันสิ่งที่มากระทบสัมผัสตัวของเราทางตา หู จมูก ลิ้น กาย ใจ 
            ในขณะปัจจุบันตามความเป็นจริงของโลกและชีวิตว่าสิ่งทั้งปวงไม่เที่ยงเกิดดับ เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวเท่านั้น ไม่มีตัวตนเป็นของตนเอง ว่างเปล่าจากตนและของตน 
            รู้เห็นอย่างนี้พระพุทธเจ้าตรัสว่าเป็นผู้ไม่ประมาท เมื่อไม่ประมาทแล้วก็จะนำพาตัวเองตั้งอยู่ในความพอดีของชีวิต</p><br /><br />
          </h4>
          <a href="/life06">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              การเจริญสติปัญญาที่ถูกต้องทำอย่างไร?
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life05;