import React from 'react';

const Life07 = () => {
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <a href="/life08">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" />
              </button>
            </a>
            <h2 style={{display: 'inline-block'}}>การรู้เท่าทันความพอใจและไม่พอใจแก้ปัญหาหรือดับทุกข์ได้</h2>
          </div>
          <h2>
            <p>ความพอใจ ไม่พอใจ สรุปเรียกว่า อวิชชา&rdquo; คือความเห็นสิ่งทั้งปวงที่มากระทบสัมผัสตัวเราผิด จึงไปหลงพอใจ ไม่พอใจ กับสิ่งนั้น 
            ความพอใจ ไม่พอใจ เกิดขึ้นได้ 6 ทางเท่านั้น คือทางตา หู จมูก ลิ้น กาย ใจ เรียกว่า &ldquo;อินทรีย์ 6&rdquo; 
            ความพอใจ ไม่พอใจ จะเกิดขึ้นกับคนที่ไม่เข้าใจหรือไม่ได้ศึกษาพระธรรมคำสอนของพระสัมมาสัมพุทธเจ้าตรัสรู้บอกทางไว้ให้ 
            ความพอใจเรียกภาษาพระว่า &ldquo;โลภะ&rdquo; หรือ &ldquo;กามสุขัลลิกานุโยค&rdquo; ซึ่งพระสัมมาสัมพุทธเจ้าตรัสไว้ว่า 
            เป็นทางสุดโต่งและอีกด้านหนึ่งความไม่พอใจเรียกภาษาพระว่า &ldquo;โทสะ&rdquo; หรือ &ldquo;อัตตกิลมถานุโยค&rdquo; 
            ซึ่งพระพุทธเจ้าตรัสไว้ว่าเป็นทางสุดโต่งอีกทางหนึ่ง พระองค์ท่านห้ามภิกษุเข้าไปเกี่ยวข้องที่สุดทั้งสองด้านนี้ ในพระธัมมจักรกัปปวัตนสูตร<br /></p>
            <p>การที่เรารู้ไม่เท่าทันความพอใจหรือไม่พอใจนี้ เรียกว่าความหลงหรือ &ldquo;โมหะ&rdquo; ฉะนั้นแล้วบุคคลใดไม่รู้เท่าทันความพอใจหรือไม่พอใจ 
            ต่อสิ่งที่มากระทบสัมผัสอินทรีย์ 6 ในขณะปัจจุบันแล้ว บุคคลนั้นบำเพ็ญ โลภะ โทสะ โมหะ หรือ โลภ โกรธ หลง ให้กับตัวเองตลอดเวลาที่ไม่หลับ 
            ถ้าตรวจสอบตัวเองในขณะนี้ เราจะทราบว่าตลอดเวลาตั้งแต่เราตื่นขึ้นมาจนหลับลงไปนั้น คนเราบำเพ็ญความพอใจ ไม่พอใจหรือโลภ โกรธ หลง 
            ให้กับตัวเองในทางตา หู จมูก &nbsp;ลิ้น กาย ใจ ตลอดเวลา คนเราส่วนมากจึงมีโลภะ โทสะ โมหะ ฝังอยู่ในใจของแต่ละคนที่เป็นปุถุชนคนธรรมดาอย่างแน่นหนา 
            ลักษณะอย่างนี้เรียกว่าเรามีความเคยชินในทางผิดเก็บไว้ในใจตลอดเวลา ที่เรียกว่าอวิชชาสามารถตรวจสอบตัวเองได้ตลอดเวลาว่าเป็นจริงอย่างที่กล่าวไว้หรือไม่ 
            โดยให้สังเกตตัวเราว่าเวลาอะไรมากระทบสัมผัสอินทรีย์ 6 คือตา หู จมูก ลิ้น กาย ใจของเรา สติของเราระลึกหรือลากอะไรออกมารับการกระทบสัมผัส 
            จะเห็นได้ชัดเจนว่า สติของเราจะลากเอาความเคยชินที่มีมากที่สุดของเราคือโลภะ โทสะ โมหะ หรือความพอใจ ความไม่พอใจออกมารับการกระทบสัมผัสใจขณะปัจจุบันทุกครั้ง 
            ถ้าเป็นอย่างนี้เรียกว่ากรรมเก่า คือความพอใจ ไม่พอใจภายใน กับกรรมเก่าคือความพอใจ ไม่พอใจภายนอก มากระทบกันแล้วหลอกให้ตัวเราสร้างกรรมใหม่ขึ้นมาอีก
            คือความพอใจ ไม่พอใจใหม่ขึ้นมาอีกเป็นอย่างนี้หาที่สิ้นสุดไม่ได้ คนเราจึงเรียนว่ายตายเกิดในวัฏสงสารนี้นับภพนับชาติไม่ถ้วน<br /></p>
            <p>พระพุทธเจ้าได้ตรัสรู้ รู้แจ้งการดับทุกข์บอกไว้ว่า คนเราปล่อยให้ความหลงหรืออวิชชากำหนดวิถีชีวิต อวิชชาทำให้เกิดสังขาร สังขารทำให้เกิดวิญญาณ วิญญาณทำให้เกิดนามรูป 
            นามรูปทำให้เกิดสฬายตนะ สฬายตนะทำให้เกิดผัสสะ ผัสสะทำให้เกิดเวทนา เวทนาทำให้เกิดตัณหา ตัณหาทำให้เกิดอุปทาน อุปทานทำให้เกิดภพ ภพเป็นปัจจัยให้เกิดชาติ 
            ชาติเป็นปัจจัยให้เกิดชรา มรณะ มรณะเป็นปัจจัยให้เกิดโสกะ ปริเทวะ ทุกขโทมนัส อุปายาส จึงมีพร้อม นี่คือหลักปฏิจจสมุปบาทที่พระพุทธเจ้าตรัสรู้สรุปไว้ว่า&ldquo;
            สิ่งนี้มี สิ่งนี้จึงมี สิ่งนี้ดับ สิ่งนี้จึงดับ&rdquo; นี่คือกระบวนการของการสะสมความพอใจหรือไม่พอใจ หรืออวิชชาให้เป็นความเคยชินติดแน่นหนาอยู่ในจิตใจของมนุษย์
            พระพุทธเจ้าท่านเห็นว่าอวิชชาเป็นตัวกำหนดให้เราเวียนว่ายตายเกิดถ้าดับอวิชชาได้ ก็ดับความเกิดได้ ความเกิด ความแก่ ความเจ็บ ความตาย ก็ไม่มีดับทุกข์ได้ถาวร<br /></p>
            <p>อวิชชาเกิดจากอะไร? อวิชชาเกิดจากไม่รู้เท่าทันสิ่งที่มากระทบสัมผัสตัวเราในขณะปัจจุบัน จึงทำให้เป็นหลงพอใจและไม่พอใจสิ่งที่มากระทบสัมผัส นั่นคือโลภ โกรธ หลง เกิดขึ้นแล้ว
            โลภ โกรธ หลงนี้แหละรากเหง้าของอวิชชา หรือเหตุแห่งทุกข์ทั้งปวง พระพุทธเจ้าได้ตรัสรู้พระธรรมคำสั่งสอนในเรื่องของการดับทุกข์ไว้ในธัมมจักกัปปวัตตนสูตร 
            หากผู้ใดรู้เท่าทันความจริงของโลกและชีวิตในขณะปัจจุบันหรือรู้เท่าทันความพอใจ ไม่พอใจ สัมมาทิฐิ ความเห็นถูก เกิดขึ้นทันทีต่อจากนั้นก็เกิดองค์ธรรมของมรรคมีองค์ 8 ครบถ้วน 
            ทางนี้ที่พระพุทธเจ้าตรัสว่าเป็นทางดับทุกข์ ดับความพอใจ ไม่พอใจทันทีเมื่อถูกกระทบในขณะปัจจุบัน เมื่อเรารู้เท่าทันความจริงของโลกและชีวิตแล้ว 
            ความจริงของโลกและชีวิตนี้ก็จะเข้าไปแทนความเชื่อ ที่เป็นความพอใจ ไม่พอใจ เช่น ตาเห็นรูปสติก็จะดึงความจริงของโลกและชีวิตว่าไม่เที่ยงมากั้นความพอใจไม่พอใจตรงผัสสะ 
            กันไม่ให้เลยไปถึงเวทนาพอสติดึงความจริงว่าไม่เที่ยงมาแล้ว ความพอใจไม่พอใจดับทันทีต่อจากนั้นปัญญาที่ตามมากับความจริงว่า ไม่เที่ยง 
            ก็จะพิจารณาเหตุปัจจัยของสิ่งที่มากระทบสัมผัสและรู้ความจริงของสิ่งทั้งปวง คือตัวเราและสิ่งที่มากระทบสัมผัสว่า ว่างจากตนและของตน คือเกิดขึ้น ตั้งอยู่ดับไปทั้งหมด 
            ในจิตใจก็โปร่งโล่งไม่มีขยะมาสะสมไว้ ก็กำจัดทิ้งหมดทันทีที่ถูกกระทบสัมผัส นี่คือกระบวนการดับทุกข์ที่พระพุทธเจ้าตรัสสอนไว้ในทางสายเอกคือการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 
            ให้รู้เห็นสิ่งทั้งปวงตามความเป็นจริง มีปัญญาดับทุกข์ทันทีที่ปฏิบัติอย่างนี้ให้ครบอินทรีย์ 6 แล้วจะมีความจริงและมีปัญญาเก็บไว้ในใจ เหมือนมีสูตรคูณที่พวกเราท่องไว้ในขณะเป็นเด็ก 
            แล้วเรายังจำสูตรคูณนั้นได้ วิปัสสนาก็เช่นเดียวกัน ถ้าเจริญความจริงไว้ในจิตใจมากๆ ปัญญาก็จะเกิดขึ้นฝังติดแน่นอยู่ในจิตใจของเรา ถ้ามีโจทย์มากระทบสัมผัสสติก็จะดึงเอาปัญญาออกมารับ 
            แก้ไขปัญหาทั้งปวงเช่นเดียวกับโจทย์เลขคณิต 7 x 8 มากระทบตา สติจะดึงเอาคำตอบที่ท่องเก็บไว้ในใจออกมาตอบว่า 56 ถูกต้องเลย ไม่เชื่อเอา 7 บวกกัน 8 ครั้งจะเท่ากับ 8 บวกกัน 7 ครั้งคือ 56<br /></p>
            <p>ตัวของเรา สิ่งที่มากระทบสัมผัสอินทรีย์ 6 มี 2 อย่างด้วยกันคือมีทั้งถูกใจและถูกต้องตลอดเวลา ถ้าเรามีปัญญาหรือมีความรู้ที่ดับทุกข์ได้ สติก็จะดึงเอาปัญญามาตอบรับ เลือกเอาสิ่งที่ถูกต้อง 
            จะทิ้งสิ่งที่ถูกใจทันที ปัญหาหรือทุกข์ก็ไม่เกิดขึ้น ถูกดับทันทีตั้งแต่ถูกกระทบคือการรู้เท่าทันความพอใจไม่พอใจจะมีปัญญาดับทุกข์ได้ถาวร จะเห็นว่าการดับทุกข์หรือแก้ปัญหาให้กับตัวเองนั้นไม่ยากถ้ารู้เท่าทันความจริงของโลกและชีวิต 
            และรู้วิธีปฏิบัติให้เข้าถึงความจริง นำความจริงมาเพาะให้เกิดปัญญา แล้วให้สติลากหรือดึงมาหรือระลึกได้ นำมาแก้ปัญหาหรือดับทุกข์ได้ตั้งแต่ถูกกระทบครั้งแรกตั้งแต่ ณ ที่เกิดทันทีที่อินทรีย์ 6 
            ที่ทุกข์เกิดขึ้นถ้าฝึกตนเองเจริญความจริงของโลกและชีวิตตลอดเวลา จนเป็นปกติในชีวิตประจำวันบุคคลนั้นก็จะมีชีวิตอยู่ด้วยปัญญาเป็นบุคคลที่ไร้ทุกข์ถาวร<br /></p>
          </h2>
          <a href="/life08">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" />
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life07;