import React from 'react';

const Life03 = () => {
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div>
            <a href="/life04">
              <button type="button" className="btn btn-primary me-5">
                <i className="bi bi-arrow-right-square" />
              </button>
            </a>
            <h2 style={{display: 'inline-block'}}>ปฏิบัติธรรมอย่างไรจึงจะถูกทาง?</h2>
          </div>
          <h2>
            <p>การจะปฏิบัติธรรมให้ถูกทางได้นั้นก็มีลักษณะเดียวกับการกระทำใดๆของเราในทางโลกที่จะทำถูกได้นั้นต้องมีการศึกษาเรียนรู้สิ่งที่เราจะไปทำนั้นให้รู้และเข้าใจในสิ่งนั้นๆ ให้ดีก่อน 
            การกระทำของเราในสิ่งนั้นจึงจะถูกต้องครบถ้วน มีผลสำเร็จเกิดขึ้นตามที่เราได้ตั้งใจไว้ มีเพียงความตั้งใจเฉยๆ ไม่มีความรู้ประกอบแล้ว 
            การกระทำของเราไม่ว่าทางโลกหรือทางธรรมก็ไม่ประสบความสำเร็จ เพราะเป็นการหลับตากระทำ หรือทำโดยความไม่รู้<br /></p>
            <p>การปฏิบัติธรรมนั้น ทางที่ถูกต้องและมีผลสำเร็จเกิดขึ้นตามที่ตัวเองตั้งใจไว้คือดับทุกข์ได้ให้กับตัวเองนั้น ต้องศึกษาเรียนรู้พระธรรมคำสอนของพระพุทธเจ้าในพระไตรปิฎกให้จบหลายๆรอบจนเข้าใจ
            ในพระธรรมคำสอนนั้นพอสมควร คือเข้าใจในพระธรรมคำสอนว่าพระธรรมคำสอนส่วนใดเป็นผลของการตรัสรู้ พระธรรมส่วนใดเป็นเหตุของการตรัสรู้ 
            พระธรรมคำสอนแต่ละสูตรนั้น พระพุทธเจ้าตรัสสอนผู้ใดสนพระอริยบุคคล หรือสอนบุคคปุถุชนทั่วไป ตรัสสอนเป็นคำย่อสรุป หรือเป็นคำเต็ม ถ้าเป็นคำย่อแล้ว คำเต็มว่าอย่างไร 
            ต้องรู้และเข้าใจพระธรรมคำสอนในระดับนี้ จึงจะเป็นการปฏิบัติที่ถูกต้อง มีผลการปฏิบัติที่ถูกต้องเกิดขึ้นกับตัวผู้ปฏิบัติ<br /></p>
            <p> ถ้าผู้ปฏิบัติไม่เข้าใจพระธรรมคำสอนดังที่กล่าวมาแล้ว 
            การปฏิบัติธรรมของเขาก็ไม่ถูกทาง พาตัวเองหลงเข้าไปในคำสอนของพราหมณ์ ไปหลบทุกข์อยู่ที่ความสงบหรือสมาธิ ซึ่งเป็นผลร้ายต่อผู้ปฏิบัติอย่างยิ่ง เพราะไม่สามารถแก้ไขตนเองกลับมาปฏิบัติในทางที่ถูกต้องดับทุกข์ได้ 
            เพราะถ้าหลงทางเข้าไปในสมาธิโดยที่ตัวเองยังไม่มีปัญญาประกอบในการทำสมาธินั้นการกระทำอย่างนั้นเรียกว่าไปผิดทางหรือมิจฉาทิฏฐิเสียเวลาชีวิตของตนเองไปอีกชาติหนึ่งคนเราเกิดมาแต่ละชาตินั้น 
            ตั้งใจมาทำให้ตนเองพบสุขถาวรหรือนิพพานแต่พาตนเองไปหลงทางเสียก่อนจึงไม่มีเวลาพอจะพาตนเองย้อนกลับมาเดินทางที่ถูกต้องได้ ซึ่งเราจะเห็นว่าบางคนไปลงทำสมาธิจนแก่
            เวลาที่เหลือจึงมีไม่พอที่จะพาตัวเองมาตั้งต้นวิปัสสนาดับทุกข์ในชาตินี้ได้ในที่สุดตัวเองก็จะเข้าไปติดตาข่ายของพญามารเวียนว่ายตายเกิดต่อไปอีกนับชาติไม่ถ้วนมองให้ดีๆจะเห็นว่าถ้าหลงผิดอย่างนี้แล้ว
            ทำความเสียหายให้กับชีวิตของเราอย่างมากมายหาที่สุดไม่ได้<br /></p>
            <p> ถ้าผู้ปฏิบัติธรรมทั้งหลายเข้าใจในพระธรรมคำสอนของพระพุทธเจ้าตามที่ได้กล่าวไว้ข้างต้นแล้ว
            การปฏิบัติธรรมเพื่อดับทุกข์นั้นง่ายมากเพราะถ้าจับหลักคำสอนที่เป็นเหตุของการตรัสรู้ของพระพุทธเจ้าที่พระองค์ได้ตรัสบอกชาวโลกว่าเป็นทางสายเอกสายเดียวที่ปฏิบัติแล้วดับทุกข์ได้ 
            เพราะพระพุทธเจ้าเป็นบุคคลที่ฉลาดที่สุดหาบุคคลใดเสมอเหมือนไม่ได้จึงสอนสิ่งที่ยากที่สุดให้ง่ายที่สุดได้ สรุปพระธรรมคำสอนของพระองค์ท่านทั้งหมด 84,000 พระธรรมขันธ์ 
            ให้นำไปสู่การปฏิบัติ เหลือเพียงกำมือเดียวเท่านั้น ปฏิบัติแล้วได้ผลภายใน 7 วัน 7 เดือน 7 ปี อย่างช้า พระพุทธเจ้าตรัสไว้อย่างนี้ พระธรรมคำสอนนั้นก็คือการวิปัสสนาภาวนาพิจารณาขันธ์ 5 อินทรีย์ 6 &nbsp;
            ให้รู้เห็นสิ่งทั้งปวงที่มากระทบสัมผัสตัวเราในขณะปัจจุบันตามความเป็นจริงของโลกและชีวิต ว่าสิ่งทั้งปวงไม่เที่ยงเกิดดับมีเหตุปัจจัยมาประชุมกันชั่วคราวไม่มีตัวตนเป็นของตนเอง 
            การปฏิบัติต้องรู้และเข้าใจกฎธรรมชาติ 2 กฎที่พระพุทธเจ้าตรัสรู้ไว้คือกฎไตรลักษณ์อนิจจัง ทุกขัง อนัตตา เกิดขึ้น ตั้งอยู่ ดับไปและกฎของเหตุปัจจัยอิทัปปัจจยตา ปฏิจจสมุปบาท 
            สรุปได้ว่าสิ่งทั้งปวงรวมทั้งตัวของเราไม่เที่ยงเกิดดับ แล้วเอาความจริงของกฎธรรมชาติที่สรุปแล้วว่าไม่เที่ยงเกิดดับไปฝึกวิปัสสนาเพื่อเจริญปัญญาแล้วเอาปัญญาที่ได้นี้ไปดับทุกข์ในขณะปัจจุบันที่ถูกกระทบสัมผัสในทางตา หู จมูก ลิ้น กาย ใจ<br /></p>
            <p>วิธีฝึกฝนตนเองในการวิปัสสนาภาวนาเริ่มตั้งแต่ตื่นนอนขึ้นมาแล้วให้ฝึกให้รู้เห็นความจริงว่าสิ่งทั้งหลายทั้งปวงรวมทั้งตัวของเรานี้ไม่เที่ยงเกิดดับ คือให้เห็นว่าตัวเราไม่เที่ยงเกิดดับสิ่งที่มากระทบตัวเราก็ไม่เที่ยงเกิดดับ 
            (ไม่เที่ยงเกิดดับนี้ก็คือความจริงของโลกและชีวิตหรือกฎธรรมชาติ 2 บทดังกล่าวไว้ข้างต้น) จากนั้นตาไปกระทบรูปหรือเห็นอะไรเมื่อตื่นนอนขึ้นมาให้พิจารณาตามความจริงของกฎธรรมชาติสองคนนั้นทันทีว่ารูปที่เห็นนั้นไม่เที่ยงเกิดดับตัวของเราก็ไม่เที่ยงเกิดดับ 
            เสียงกระทบหูก็พิจารณาทันทีว่าเสียงไม่เที่ยงเกิดดับตัวเราก็ไม่เที่ยงเกิดดับ จมูกได้กลิ่นไม่เที่ยงเกิดดับตัวเราก็ไม่เที่ยงเกิดดับ ลิ้นกระทบรสไม่เที่ยงเกิดดับตัวของเราก็ไม่เที่ยงเกิดดับ 
            กายกระทบสัมผัสก็พิจารณาว่าสิ่งที่มากระทบกายไม่เที่ยงเกิดดับตัวของเราก็ไม่เที่ยงเกิดดับไป จนถึงใจคิดนึกอะไรก็พิจารณาว่าความคิดไม่เที่ยงเกิดดับตัวของเราก็ไม่เที่ยงเกิดดับ<br /></p>
            <p>พิจารณาอย่างนี้อยู่ตลอดเวลาควบคู่กันไปกับการดำเนินชีวิตไม่ว่าเราจะทำอะไรในชีวิตประจำวันก็ให้พิจารณาอย่างนี้ เมื่อถูกกระทบสัมผัส จนกว่าเราจะหลับไป ห้ามนั่งจดจ้องหรือกำหนดจิตตามดูสิ่งที่มากระทบให้ปฏิบัติตามปกติในชีวิตประจําวัน
            ถูกกระทบค่อยพิจารณาไม่ถูกกระทบก็ไม่พิจารณา ปฏิบัติอย่างนี้เรียกว่าเจริญปัญญา ปัญญาจะเกิดขึ้นทางตา หู จมูก ลิ้น กาย ใจ อย่างมหาศาลเพราะถ้าเราเอาความจริงมาตั้งไว้แล้ว ความเชื่อที่เป็นความพอใจ ไม่พอใจ 
            และความหลงก็ดับทันทีไม่มีโอกาสเกิดขึ้นในขณะที่ถูกกระทบสัมผัสเมื่อเรายึดเอาความจริงของกฎธรรมชาติ 2 กฎมาตั้งไว้ในตา หู จมูก ลิ้น กาย ใจ อย่างนี้เรียกว่าเอาสัมมาทิฏฐิมาตั้งเป็นฐานและการถูกกระทบสัมผัส
            เมื่อมีฐานที่เป็นความเห็นถูกหรือสัมมาทิฏฐิตั้งอย่างนี้ ความคิดถูกหรือดำริชอบสัมมาสังกัปปะเกิดขึ้นตามมา ต่อไปองค์ธรรมของมรรคมีองค์ 8 ก็เกิดขึ้นครบถ้วนคือสัมมาวาจา สัมมากัมมันตะ สัมมาอาชีวะ สัมมาวายามะ สัมมาสติ สัมมาสมาธิ 
            เมื่อมรรคมีองค์ 8 เกิดขึ้นแล้ว องค์ธรรมอื่นๆเช่นสติปัฏฐาน๔ สัมมัปปธาน 4 อิทธิบาท 4 อินทรีย์๕ พละ๕ โพชฌงค์ 7 เกิดขึ้นครบ โพธิปักขิยธรรม 37 ประการนี้คือองค์ธรรมของการบรรลุมรรค ผล นิพพาน 
            เมื่อผู้ปฏิบัติธรรมฝึกฝนตนเองจนมีองค์ธรรมนี้ครบถ้วนก็จะมีปัญญาดับทุกข์ได้ในชาตินี้องค์ธรรมนี้จะเกิดจากการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 อย่างที่กล่าวมาข้างต้นเท่านั้น 
            นี่คือพระธรรมที่เป็นเหตุของการตรัสรู้ของพระพุทธเจ้าและที่พระองค์นำไปสั่งสอนชาวโลกไปปฏิบัติเมื่อชาวโลกได้นำไปปฏิบัติแล้วได้บรรลุมรรค ผล นิพพานเช่นเดียวกับพระพุทธเจ้าเรียกว่าพระอรหันต์อัครสาวก 
            พระพุทธองค์ตรัสว่าทางนี้คือทางสายเอกสายเดียวที่ปฏิบัติแล้วบรรลุมรรค ผล นิพพานได้ในชาตินี้ ทางอื่นนอกจากนี้ไม่มีอีก<br /></p>
            <p> บางคนอ่านพระไตรปิฎกแล้วไม่เข้าใจพระธรรมคำสอน
            ว่าพระธรรมสูตรนั้นเป็นเหตุหรือเป็นผลของการตรัสรู้แล้วพระองค์ตรัสสอนใครอริยบุคคลหรือบุคคลธรรมดาซึ่งมีบางส่วนพระองค์ท่านตรัสสอนว่า ดูกรภิกษุ ถ้าพวกเธอทำสมาธิให้ได้ฌาน 4 และเอาฌาน 4 ไปพิจารณาอาสวักขยญาณหรือญาณแห่งความหลุดพ้นแล้ว 
            พวกเธอสามารถบรรลุมรรคผลนิพพานได้อย่างนี้ ถ้าดูให้ดีๆจะเห็นว่าท่านตรัสว่า &ldquo;ดูกรภิกษุ&rdquo; นั้นหมายถึงพระองค์ท่านสอนพระอริยบุคคลตั้งแต่โสดาบันบุคคลขึ้นไป &ldquo;พระโสดาบันบุคคลขึ้นไปนั่นทำสมาธิได้&rdquo; 
            เพราะมีปัญญาเป็นพื้นฐานอยู่แล้วหรือมีสัมมาทิฐิแล้ว เมื่อไปทำสมาธิ สมาธินั้นก็จะเป็นสัมมาสมาธิแต่ถ้าพวกเราปุถุชนคนธรรมดาเอาไปทำก็จะเป็นมิจฉาสมาธิทันที เพราะเรายังไม่มีปัญญาประกอบสมาธิ อย่างนี้เรียกว่าปฏิบัติผิดคำสอน 
            คำสอนอย่างนี้พระองค์ท่านสอนอริยบุคคลตั้งแต่โสดาบันขึ้นไปให้เอาไปปฏิบัติเพื่อให้บรรลุมรรคผลนิพพานนั้นได้เร็วขึ้นไม่ใช่สอนพวกเราปุถุชนคนธรรมดาพูดง่ายๆว่าเราเรียนอยู่ชั้น ป.4 แล้วเอาหลักสูตร ม.6 มาเรียน เรียนอย่างไรก็ไม่เข้าใจ 
            ไม่เข้าใจก็ปฏิบัติหรือทำผิดคำสอนแน่นอน ฉันใด ฉันนั้น<br /></p>
            <p> ฉะนั้นการปฏิบัติธรรมให้ถูกทางนั้นจะต้องเข้าใจคำสอนของพระพุทธเจ้าอย่างดีก่อนอย่างที่กล่าวไว้ข้างต้นว่าคำสอนใดเป็นเหตุหรือผลการตรัสรู้สอนผู้ใดคำย่อหรือคำเต็ม 
            ต้องเข้าใจถึงขนาดนี้จึงจะเป็นการปฏิบัติธรรมถูกธรรม มีผลออกมามีปัญญาดับทุกข์ได้ แต่ถ้าไม่เข้าใจพระธรรมคำสอนของพระพุทธเจ้าอย่างนี้ การปฏิบัติธรรมจะผิดธรรมทันที คือไปเอาพระธรรมคำสอนในส่วนที่เป็นผลของการตรัสรู้ของพระพุทธเจ้า
            ที่ตรัสสอนไว้ให้กับอริยบุคคลตั้งแต่โสดาบันบุคคลขึ้นไปมาปฏิบัติ อย่างที่เห็นในสำนักวิปัสสนาภาวนาทั้งหลายทั้งในและนอกวัด เอามหาสติปัฏฐานสูตรหรือเอาสติปัฏฐาน 4 พิจารณากาย เวทนา จิต ธรรมไปปฏิบัติ 
            โดยฝึกกำหนดให้สติติดตามอิริยาบถหรือความเคลื่อนไหวของกาย เช่น นั่งหนอ ยกหนอ เดินหนอ ก้าวหนอ ยุบหนอ พองหนอ และเอาสติไปกำกับลมหายใจ เข้า-ออก ฯลฯ อย่างนี้เขาถือว่าเป็นการวิปัสสนาภาวนาตามที่พระพุทธเจ้าสอนไว้ในพระไตรปิฎก
            สูตรนี้เป็นหลักสูตรของอริยบุคคลตั้งแต่โสดาบันบุคคลขึ้นไปไม่ใช่สำหรับปุถุชนทั่วไปเพราะอริยบุคคลมีปัญญาหรือสัมมาทิฐิอยู่แล้ว ปฏิบัติอย่างนี้ได้ เพราะจะทำให้เกิดสัมมาสมาธิ แต่ถ้าบุคคลธรรมดาเอาไปปฏิบัติก็เป็นการปฏิบัติธรรมอย่างผิดธรรม 
            มีผลออกมาเป็นสมาธิหรือมิจฉาสมาธิเท่านั้น ไม่มีปัญญาเกิดขึ้น นั่นคือผู้ปฏิบัติผิดทางอย่างนี้เป็นการบำเพ็ญความพอใจและไม่พอใจ หรือโลภ โกรธ หลง ให้กับตนเองโดยไม่รู้ตัว 
            ก็พูดโดยไม่เกรงใจกันแล้วก็บอกได้ว่าผู้ปฏิบัติอย่างนี้บำเพ็ญตัวเองไปสู่นรกอเวจีด้วยความพอใจเพราะผลจะตรงกับเหตุเสมอพระพุทธเจ้าตรัสไว้ว่า มิจฉาทิฐิเป็นเหตุเป็นปัจจัยให้ไปเกิดในนรกหรือเดรัจฉาน ทางใดทางหนึ่งเหมือนจับไปวางไว้<br /></p>
            <p>ฉะนั้นการปฏิบัติธรรมถูกทางนี้สำคัญต่อชีวิตของเรามาก ผิดพลาดไม่ได้ ถ้าผิดพลาดหลงไปปฏิบัติสมาธิแล้ว โอกาสที่จะกลับมาวิปัสสนาภาวนาตามทางสายเอกที่พระพุทธเจ้าตรัสไว้นั้นไม่มีโอกาสอีกเลยในชีวิตนี้ ขอให้ท่านผู้ปฏิบัติธรรมทั้งหลายตระหนักเรื่องนี้ให้มาก 
            ถ้าหากท่านหลงทางไปติดที่สมาธิแล้วพระพุทธเจ้าองค์เดียวเท่านั้นที่จะปลดท่านออกจากสมาธิได้ขณะนี้พระพุทธเจ้าได้ปรินิพพานไปนานแล้ว จึงไม่มีผู้ใดช่วยท่านออกมาจากสมาธิได้ท่านก็จะไปติดตาข่ายของพญามารอยู่ที่ความสงบตลอดไป 
            เสียเวลาชีวิตไปอีกชาติหนึ่ง ชาตินี้จึงเสียโอกาสอันดีที่ท่านได้เกิดมาเป็นคนเพื่อหนีทุกข์ไปหาสุขถาวรให้กับตัวเองได้แต่เพียงหลบทุกข์ชั่วคราวเท่านั้น<br />สรุปการปฏิบัติธรรมให้ถูกทางได้นั้นต้องศึกษาพระธรรมคำสอนของพระพุทธเจ้าให้เข้าใจพระธรรมคำสอนอย่างถ่องแท้
            สามารถแยกแยะพระธรรมคำสอนของพระพุทธเจ้าได้ว่าพระธรรมอันใดเป็นผลของการตรัสรู้ และพระธรรมอันใดเป็นเหตุของการตรัสรู้ พระธรรมสูตรนั้นๆพระองค์ท่านตรัสสอนผู้ใดสอนอริยบุคคลหรือสอนบุคคลธรรมดาทั่วไป ตรัสสอนเป็นคำย่อสรุปหรือเป็นคำเต็ม 
            ถ้าเป็นคำย่อสรุปแล้วคำเต็มว่าอย่างไร ต้องรู้และเข้าใจหลักธรรมคำสอนในระดับนี้ จึงจะนำพระธรรมคำสอนนั้นมาปฏิบัติถูกทางแล้วพบความสำเร็จในชีวิต คือมีปัญญาดับทุกข์ตั้งแต่เริ่มปฏิบัติไปจนถึงดับทุกข์ถาวรได้ ตามความเป็นจริงแล้ว คนเราเกิดมามีทางเลือกอยู่ 2 ทางเท่านั้นคือ 
            &ldquo;ดับทุกข์&rdquo; กับ &ldquo;หลบทุกข์&rdquo; ถ้าเราไม่ปฏิบัติดับทุกข์ให้กับตัวเองแล้ว เราก็ปฏิบัติหลบทุกข์ให้กับตัวเองทันที บุคคลที่ได้ฟังพระธรรมคำสอนของพระพุทธเจ้าที่ถูกต้องและเข้าใจจะเลือกทางดับทุกข์ถาวรให้กับตัวเอง 
            ส่วนบุคคลที่ไม่ได้ฟังพระธรรมคำสอนของพระพุทธเจ้าก็จะเลือกทางหลบทุกข์ชั่วคราวให้กับตัวเองถาวรไปตลอดชีวิต เช่น ไปท่องเที่ยว พักผ่อนหย่อนใจก็หลบทุกข์ ไปดูหนัง ฟังเพลง กินเหล้า ยาเสพติดก็หลบทุกข์ชั่วคราว ไปนั่งทำสมาธิก็หลบทุกข์ชั่วคราว กลับมาบ้านแล้วก็ทุกข์อย่างเดิม 
            ท่านผู้อ่านทั้งหลายท่านตรวจสอบตัวของท่านเองดูว่า ตัวของท่านเลือกทางไหน ถ้าเลือกทางผิดก็เสียเวลาชีวิตไปอีกชาติหนึ่ง ถ้าเลือกทางถูกก็เป็นสิริมงคลอันยิ่งใหญ่แก่ตัวท่านเอง<br /></p>
          </h2>
          <a href="/life04">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" />
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life03;