import React from 'react';

const Life08 = () => {
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>การรู้เท่าทันความพอใจและไม่พอใจแก้ปัญหาหรือดับทุกข์ได้</h2>
          </div>
          <h4>
            <p>ไตรสิกขาในพระไตรปิฎกที่พระพุทธเจ้าตรัสรู้ได้สอนให้กับพระภิกษุวัชชีบุตรนำไปปฏิบัตินั้นมีสาเหตุมาจากพระพุทธเจ้าได้กำหนดธรรมวินัยไว้ในขณะนั้น 150 ข้อ 
            แล้วภิกษุวัชชีบุตรเห็นว่าสิกขามากถึง 150 ข้อ ตนเองไม่สามารถปฏิบัติได้ทั่วถึงจึงได้เข้าพบกับพระพุทธเจ้าแล้วกล่าวว่าตนเองไม่สามารถจะปฏิบัติตามสิกขาหรือ 150 ข้อ 
            ทั้งหมดนั้นได้ พระพุทธเจ้าตรัสกับภิกษุวัชชบุตรว่า เธอปฏิบัติศีลสิกขา 150 ข้อไม่ได้ เธอจะปฏิบัติอธิศีล อธิจิต อธิปัญญาได้ไหมภิกษุวัชชีบอกว่าถ้า 3 ข้ออย่างนี้ปฏิบัติได้ 
            พระพุทธเจ้าตรัสว่าถ้าเธอปฏิบัติ 3 ข้อนี้ได้เท่ากับเธอปฏิบัติสิกขาได้ทั้งหมด 150 ข้อ พระภิกษุวัชชีจึงได้นำอธิศีล อธิจิต อธิปัญญา ไปปฏิบัติแล้วได้บรรลุเป็นพระอรหันต์ในกาลต่อมา<br />
            ไตรสิกขาอธิศีล อธิจิต อธิปัญญา นี่คืออะไร? อธิศีล อธิจิต อธิปัญญา ไม่ใช่ศีล สมาธิ ปัญญา อย่างที่ผู้รู้ทั้งหลายแปลหรือให้ความหมายไว้แล้วนำมาวางไว้เป็นไตรสิขา 
            ให้พระสงฆ์และฆราวาสปฏิบัติอยู่ในขณะนี้ ซึ่งไม่ถูกต้องไม่ตรงกับความหมาย ไม่ตรงกับเป้าหมาย ความหมายที่ถูกต้องเป็นดังนี้<br />อธิศีล คือศีลใหญ่ ศีลหลวง มี 4 ข้อ<br />
            ไม่ฆ่ามนุษย์<br />ไม่เสพเมถุน<br />ไม่อวดอุตริมนุษยธรรม<br />ไม่ลักทรัพย์เกิน 5 มาสก หรือ 1 บาท<br /><br />
            4 ข้อนี้ถ้าพระสงฆ์องค์ไหนผิดข้อใดข้อหนึ่งพระสงฆ์องค์นั้นจะหมดสภาพเป็นพระสงฆ์ทันทีที่ทำผิดเรียกว่า &ldquo;พระสงฆ์ปาราชิก&rdquo; พระสงฆ์ที่ผิดศีลข้อ 4 ข้อนี้ข้อใดข้อหนึ่ง 
            พระพุทธเจ้าตรัสว่าเป็นโมฆะบุรุษ เป็นตาลยอดด้วน ถ้าอยู่ในสภาพพระสงฆ์พระพุทธเจ้าตรัสว่าเป็นผู้ยิ่งกว่าโจรปล้นเขากิน ห้ามสวรรค์ ห้ามนิพพาน ชาตินี้ไม่สามารถจะบวชเป็นภิกษุต่อไปได้<br />
            อธิจิต หมายถึงจิตที่ยิ่งใหญ่ คือจิตที่ไม่ประมาท รู้เท่าทันสิ่งทั้งปวงที่มากระทบสัมผัสตัวเราตามความเป็นจริงของโลกและชีวิตว่าสิ่งทั้งปวงไม่เที่ยง เป็นทุกข์ เป็นอนัตตา 
            ไม่มีตัวตนเป็นของตนเอง เกิดจากเหตุและปัจจัย ว่างจากตนและของตน จนเป็นปกติในชีวิตประจำวัน ไม่ไปหลงพอใจและไม่พอใจกับสิ่งที่มากระทบสัมผัสตัวเราในขณะปัจจุบันอธิจิตไม่ใช่สมาธิ<br />
            อธิปัญญา หมายถึงความรู้ที่ดับทุกข์ได้ ความรู้ที่ดับทุกข์ได้เกิดจากการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ให้รู้เห็นสิ่งทั้งปวงที่มากระทบสัมผัสตัวเราในขณะปัจจุบัน 
            ตามความเป็นจริงของโลกและชีวิต ความรู้อย่างนี้เรียกว่า &ldquo;สัมมาทิฏฐิ&rdquo; หรือปัญญาสามารถดับความพอใจและไม่พอใจที่เป็นอวิชาได้ทันทีเรียกว่าอธิปัญญา ปัญญาที่ยิ่งใหญ่<br />
            อธิศีล อธิจิต อธิปัญญา เป็นไตรสิขาของพระภิกษุสงฆ์หรือเป็นข้อปฏิบัติของพระสงฆ์ไม่ใช่ฆราวาส<br />ไตรสิกขาสำหรับฆราวาสนั้นพระพุทธเจ้าได้วางเป็นหลักข้อปฏิบัติไว้ว่าทาน ศีล วิปัสสนาภาวนา 
            เพื่อให้ชาวพุทธที่เป็นฆราวาสใช้เป็นข้อปฏิบัติฝึกฝนตนเองเป็นลำดับๆ ไป ในที่สุดให้ชาวพุทธมีปัญญาแก้ปัญหาชีวิต หรือดับทุกข์ให้กับตนเองได้ ต่อมาไม่รู้ว่าเมื่อใดได้มีการแก้ไขเปลี่ยนแปลงหลักไตรสิกขาของฆราวาส 
            ตัดเอาคำว่าวิปัสสนาออกไป เหลือเป็นทาน ศีล ภาวนา วางเป็นหลักให้ฆราวาสปฏิบัติ การกระทำในลักษณะนี้มองได้ 2 แง่<br />
            แง่ที่ 1 ไม่รู้ไม่เข้าใจคำสอนอ่านหรือศึกษาคำสอนของพระพุทธเจ้าไม่จบ 84,000 พระธรรมขันธ์ทำให้เข้าใจผิดได้<br />
            อีกแง่หนึ่งมีเจตนาไม่ดีจงใจจะบิดเบือนคำสอนให้ผิดเพี้ยนไปเพื่อทำลายพระพุทธศาสนา พระพุทธเจ้าสอนให้ปุถุชนคนธรรมดาเริ่มต้นการปฏิบัติธรรมให้กับตนเองเป็นขั้นๆ 
            เรียงลำดับไว้ว่าก่อนอื่นก็ให้ทานก่อน เพื่อลดความเห็นแก่ตัวลงไปบ้าง แล้วรักษาศีลคือไม่เบียดเบียนผู้อื่นและไม่เบียดเบียนตนเอง แล้วให้วิปัสสนาภาวนาเจริญปัญญา 
            ตามหลักทางสายเอกที่พระพุทธเจ้าตรัสไว้ซึ่งเป็นทางดับทุกข์ได้ การพิจารณาขันธ์ 5 และอินทรีย์ 6 ให้รู้เท่าทันสิ่งทั้งปวงที่มากระทบสัมผัสตัวเราในขณะปัจจุบัน 
            ตามความเป็นจริงของโลกและชีวิตเพื่อให้เกิดปัญญาขึ้น จะทำให้คนเราไม่ไปหลงพอใจหรือไม่พอใจต่อสิ่งที่มากระทบสัมผัสตัวเราในขณะปัจจุบัน แล้วมีปัญญาดับทุกข์ได้พระพุทธเจ้าวางหลักทาน ศีล วิปัสสนาภาวนา 
            ไว้ให้ชาวพุทธนำไปปฏิบัติ เป้าหมายของพระองค์ท่าน คือให้ชาวพุทธมีปัญญา แก้ปัญหาของชีวิตหรือดับทุกข์ได้ ไม่ใช่ไปหลบทุกข์ ถ้าเอาทาน ศีล ภาวนา ที่สรุปอย่างนี้ไปปฏิบัติก็จะไปหลงทำสมาธิ แล้วไม่มีปัญญาดับทุกข์ได้ 
            ได้แต่หลบทุกข์ชั่วคราวเท่านั้น ผิดธรรมวินัยของชาวพุทธ ถ้าเป็นชาวพุทธแท้ต้องดับทุกข์ได้ เพราะพระพุทธเจ้าศาสดาเอกของโลกสอนทางดับทุกข์ไว้ให้ชัดเจน สามารถเอาไปปฏิบัติให้ผลได้ในชาตินี้ภายใน 7 วัน 7 เดือน 7 ปี 
            บรรลุมรรคผลนิพพาน ดับทุกข์ถาวรได้ ต่อไปผู้จะปฏิบัติธรรมทั้งหลายต้องศึกษาพระธรรมคำสอนของพระพุทธเจ้าให้จบก่อน แล้วค่อยปฏิบัติ จะได้รู้ว่าพระธรรมคำสอนของพระองค์ท่านอันใดเป็นเหตุเป็นผลของการปฏิบัติ 
            แล้วพระองค์ท่านสอนผู้ใด พระอริยบุคคลหรือบุคคลทั่วไป พระองค์ท่านสอนสรุปเป็นคำย่อ ถ้าเป็นคำย่อ คำเต็มว่าอย่างไร ต้องรู้ต้องเข้าใจพระธรรมคำสอนของพระองค์ท่านอย่างนี้จึงจะนำไปปฏิบัติ 
            แล้วไม่ผิดธรรมจะได้ผลออกมาตามที่เราต้องการคือดับทุกข์ได้ ถ้าไม่เข้าใจคำสอนถึงขั้นนี้แล้ว โอกาสที่จะปฏิบัติธรรมมีปัญญาดับทุกข์ได้นั้น ไม่มีเลย เก่งที่สุดก็แค่หลบทุกข์อยู่ชั่วคราวเท่านั้น 
            ผลักดันตนเองจากชาวพุทธไปเป็นพราหมณ์ด้วยความพอใจหรือความไม่รู้ ในที่สุดไปติดตาข่ายของมาร ดักไว้ที่ความสงบ หมดโอกาสที่จะปลดตนเองออกจากตาข่ายของมารได้ ต้องเวียนว่ายตายเกิดในวัฏสงสารนี้ นับชาติไม่ถ้วน 
            เสียเวลาที่เกิดมาเป็นคนชาติหนึ่ง ซึ่งเขาส่งมาเกิดให้ดับทุกข์ให้กับตนเอง โอกาสอย่างนี้หาไม่ได้ง่ายๆ<br />
            สรุป อธิศีล อธิจิต อธิปัญญา ที่เรียกว่าไตรสิกขา หรือศึกษา 3 ที่เป็นคำสอนของพระพุทธเจ้าไม่ได้หมายถึงศีล สมาธิ ปัญญา อย่างที่เข้าใจกันมาก่อนแต่อย่างใด<br />
            อธิศีล หมายถึงศีลใหญ่ ศีลหลวง คือศีล 4 ข้อ (ไม่ฆ่ามนุษย์ ไม่เสพเมถุน ไม่อวดอุตริมนุษยธรรม ไม่ลักทรัพย์เกิน 5 มาสก หรือ 1 บาท)<br />
            อธิจิต หมายถึงจิตที่ยิ่งใหญ่ คือจิตที่ไม่ประมาท รู้เท่าทันสิ่งที่มากระทบสัมผัสตัวเราในขณะปัจจุบัน ตามความจริงของโลกและชีวิต<br />
            อธิปัญญา หมายถึงความรู้ที่ดับทุกข์ได้ นั่นคือ สัมมาทิฏฐิ ที่เกิดจากการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ตามทางสายเอกที่พระพุทธเจ้าตรัสไว้ 
            นี่คือไตรสิกขาของพระภิกษุสงฆ์และไตรสิกขาสำหรับฆราวาส หรืออุบาสก อุบาสิกา คือทาน ศีล วิปัสสนาภาวนา นี่คือไตรสิกขาที่ถูกต้องของพระพุทธเจ้าเมื่อนำไปปฏิบัติแล้วมีปัญญาแก้ปัญหาหรือดับทุกข์ได้ถาวร<br /></p>
          </h4>
          <a href="/life09">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              วิธีการวิปัสสนาแบบง่ายๆ แต่ได้ผล มีปัญญาแก้ปัญหาชีวิตและดับทุกข์ได้ถาวร
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life08;