import React from 'react';

const Life11 = () => {
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>วิปัสสนาดับทุกข์และสร้างสุขถาวรได้อย่างไร?</h2>
          </div>
          <h4>
            <p>วิปัสสนาดับทุกข์ได้อย่างไร? คนเราเกิดมาแล้วต้องการหนีทุกข์ไปหาสุขกันทุกคนแต่ละคนก็มีวิธีการไปหาสุขแตกต่างกันไปตามความคิดเห็นของตนเอง 
            บางคนก็หาสุขไปตลอดชีวิตยังไม่พบความสุขจริงๆที่ตัวเองต้องการ บุคคลที่ประสบความสำเร็จที่หนีทุกข์ไปหาสุขสำเร็จเป็นคนแรกก็คือพระพุทธเจ้า
            ต่อมาพระองค์ได้นำพระธรรมคำสอนของท่าน ที่พระองค์ได้ตรัสรู้ทางดับทุกข์ไว้ มาสอนชาวโลกถึง 45 พรรษา คำสอนมีทั้งหมด 84,000 พระธรรมขันธ์ 
            และชาวโลกได้นำพระธรรมคำสอนของพระองค์ให้ศึกษาเรียนรู้ปฏิบัติฝึกฝนตนเองได้ตรัสรู้พระธรรมตามพระองค์ท่านแล้วมากมายเรียกว่าพระอรหันต์สาวก 
            มีทั้งเจ้าฟ้าพระมหากษัตริย์ นักปราชญ์ราชบัณฑิต และประชาชนคนธรรมดาทั่วไป พระองค์จึงเป็นศาสดาเอกของโลก พระองค์ได้ตรัสพระธรรมคำสอนซึ่งเป็นทางสายเอกสายเดียว 
            ที่ปฏิบัติถูกธรรมแล้วดับทุกข์ได้ในชาตินี้<br /></p>
            <p> พระพุทธองค์ตรัสสอนไว้ว่าทุกข์ของคนเรามี 2 อย่าง<br />ทุกข์อย่างที่ 1 คือทุกข์ที่เป็นธรรมชาติ หรือทุกข์อริยสัจจะ 
            คือทุกข์ที่เกิด แก่ เจ็บ ตาย<br />ทุกข์อย่างที่สอง คือทุกข์ที่คนเราสร้างขึ้นมาเองโดยไม่รู้เท่าทันสิ่งที่มากระทบสัมผัสของตัวเรา ทางตา หู จมูก ลิ้น กาย ใจ 
            ตามความเป็นจริงของโลกและชีวิต จึงไปหลงพอใจไม่พอใจกับสิ่งที่มากระทบสัมผัสตัวเรา ความพอใจแปลว่า โลภ ความไม่พอใจแปลว่า โกรธ 
            ตามไม่ทันความพอใจและไม่พอใจเรียกว่า ความหลง หรือโมหะ ถ้าเราไปหลงพอใจไม่พอใจต่อสิ่งที่มากระทบสัมผัสเราอย่างนี้ เรียกว่า เราบำเพ็ญโลภะ โทสะ โมหะ หรือโลภ โกรธ หลง 
            ให้กับตัวเราเองทันที โลภะ โทสะ โมหะ นี้เรียกว่า สมุทัยของทุกข์ทั้งปวง หรืออวิชชาเกิดขึ้น และกระบวนการเกิดดับตามหลักปฏิจจสมุปบาทก็เกิดขึ้นครบวงจรของทุกข์ 
            จะเห็นได้ว่าทุกที่คนเราสร้างขึ้นทุกลมหายใจทางตา หู จมูก ลิ้น กาย ใจ นี้เป็นเหตุปัจจัยให้ทุกข์อริยสัจจะ หรือทุกข์ที่เป็นธรรมชาติเกิดขึ้นแก่ตัวเรา คือมีเกิด มีแก่ มีเจ็บ มีตาย ในที่สุด 
            วนเวียนอยู่อย่างนี้นับภพนับชาติไม่ถ้วน ต่อไปเราจะดับทุกข์ทั้ง 2 อย่างให้กับตัวเราเองได้นั้น ต้องศึกษาพระธรรมคำสอนของพระพุทธเจ้าที่พระองค์ตรัสไว้ให้จบพระธรรมคำสอนทั้ง 84,000 พระธรรมขันธ์ก่อน 
            จนเข้าใจพระธรรมคำสอนของพระองค์ว่า พระองค์ตรัสสอนทางดับทุกข์ให้กับมนุษย์ไว้อย่างไร พระองค์ตรัสบอกทางไว้ให้ในทางสายเอกสายเดียว ที่ปฏิบัติธรรมแล้วดับทุกข์ได้ 
            คือการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ให้รู้เห็นสิ่งทั้งปวงที่มากระทบสัมผัสตัวของเรา ทางตา หู จมูก ลิ้น กาย ใจ ตามความเป็นจริงของโลกและชีวิตในขณะปัจจุบันว่าสิ่งทั้งปวงไม่เที่ยงเกิดดับ 
            เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราว ไม่มีตัวตนเป็นของตนเอง ถ้าเราจะนำหลักธรรมคำสอนของพระพุทธเจ้าไปปฏิบัติฝึกฝนตนเองให้ดับทุกข์ได้ ต้องรู้เข้าใจด้วยว่าทุกข์ที่เราสร้างขึ้นนั้น 
            สร้างด้วยความหลงหรือความเชื่อ จะดับทุกข์หรือจะดับความเชื่อได้ก็ต้องเอาความจริงมาดับ ความจริงที่จะดับความเชื่อได้นั้นต้องเป็นความจริงของโลกและชีวิต ที่พระพุทธเจ้าตรัสรู้ไว้คือกฎธรรมชาติ 2 กฎ<br /></p>
            <p> 
            กฎแรกคือกฎไตรลักษณ์ อนิจจัง ทุกขัง อนัตตา เกิดขึ้น ตั้งอยู่ ดับไป ทุกสิ่งทุกอย่างในโลกนี้หรือโลกไหนๆ รวมทั้งชีวิตของเรา ทั้งหมดอยู่ในกฎนี้ นี่คือกฎความจริงข้อที่ 1<br /></p>
            <p> 
            กฎอันที่ 2 คือกฎของเหตุปัจจัย หรืออิทัปปัจจยตาปฏิจจสมุปบาท ในโลกนี้หรือโลกไหนๆ รวมทั้งชีวิตของเราไม่มีอะไรเกิดขึ้นลอยๆหรือบังเอิญ มีเหตุปัจจัยมาประชุมกันชั่วคราว ให้เราเกิดก็เกิด ให้เราตั้งอยู่ก็ตั้งอยู่ ให้เราแตกสลายก็แตกสลาย 
            นี่คือความจริงของโลกและชีวิตข้อที่ 2<br /></p>
            <p> สรุปกฎธรรมชาติ 2 กฎนี้ว่า &ldquo;ไม่เที่ยง เกิดดับ&rdquo;<br />เมื่อรู้ความจริงของโลกและชีวิตว่าสิ่งทั้งปวงไม่เที่ยงเกิดดับแล้ว 
            เอาความจริงนี้ไปปฏิบัติวิปัสสนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ให้รู้เท่าทันสิ่งที่มากระทบสัมผัสตัวของเรา ตามความเป็นจริงของโลกและชีวิตในขณะปัจจุบันเพื่อให้เกิดปัญญาและเอาปัญญาไปดับทุกข์ดังนี้<br /></p>
            <p> 
            วิธีปฏิบัติ เริ่มตั้งแต่ตื่นนอนขึ้นมาก็ให้ฝึกสติดึงระลึก หรือลากเอาความจริงของโลกและชีวิตตามกฎธรรมชาติ 2 กฎนี้มาตั้งไว้ในใจก่อน ว่าทุกสิ่งทุกอย่างที่มากระทบตัวเราไม่เที่ยงเกิดดับตัวของเราก็ไม่เที่ยงเกิดดับ 
            ใหม่เก่าแตกสลาย หนุ่มแก่ตาย จากนั้นอะไรมากระทบสัมผัสอินทรีย์ 6 คือตา หู จมูก ลิ้น กาย ใจ ให้พิจารณาดังนี้
            <br />ตาเห็นรูปอะไร ให้พิจารณาว่า<br /></p>
            <p> รูปไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ<br /><br />หูได้ยินเสียง ให้พิจารณาว่า<br /></p>
            <p> เสียงไม่เที่ยงเกิดดับ ตัวของเราไม่เที่ยงเกิดดับ<br /><br />จมูกได้กลิ่น ให้พิจารณาว่า<br /></p>
            <p> กลิ่นไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ<br /><br />ลิ้นกระทบรส ให้พิจารณาว่า<br /></p>
            <p> รสไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ<br /><br />กายกระทบสัมผัส ให้พิจารณาว่า<br /></p>
            <p> สิ่งที่มากระทบสัมผัสไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ<br /><br />ใจคิดนึกขึ้นมา ให้พิจารณาว่า<br /></p>
            <p> ความคิดไม่เที่ยงเกิดดับ ตัวของเราก็ไม่เที่ยงเกิดดับ<br /><br />
            ให้พิจารณาให้เห็นความจริงทั้งสองด้านอย่างนี้ตลอดเวลาจนเป็นปกตินิสัยในชีวิตประจำวัน ความจริงก็จะไปดับความเชื่อ หรือความหลงความพอใจความไม่พอใจที่เกิดขึ้นทางตา หู จมูก ลิ้น กาย ใจ มันคือความโลภ โกรธ หลง 
            หรือโลภะ โทสะ โมหะ เหตุปัจจะโยหรือสมุทัยของทุกข์ทั้งปวงหรือดับอวิชชาได้ทันที ณ ที่มันเกิด นั่นคือดับทุกข์ที่เราสร้างขึ้นมาได้ ซึ่งทุกข์ที่เราสร้างขึ้นมานี้เป็นเหตุปัจจัยของทุกข์อริยสัจจะ หรือ เกิดขึ้น ตั้งอยู่ ดับไป 
            เมื่อดับอวิชชาได้แล้ว ก็ดับความเกิดได้ เมื่อดับความเกิดได้ความแก่ ความเจ็บ ความตาย ก็ไม่มีต่อไปจึงดับทุกข์ถาวรได้<br /></p>
            <p> การปฏิบัติวิปัสสนาตามคำสอนของพระพุทธเจ้าที่ถูกต้องมีปัญญาดับทุกข์ที่เราสร้างขึ้นมา 
            และดับทุกข์ที่เป็นธรรมชาติได้อย่างนี้เพราะเอาความจริงของโลกและชีวิตที่เป็นกฎธรรมชาติ 2 กฎ ที่พระพุทธเจ้าตรัสรู้ไว้มาดับความเชื่อที่เป็นความพอใจและไม่พอใจ ที่เกิดขึ้นทางตา หู จมูก ลิ้น กาย ใจ ทันทีที่ถูกกระทบสัมผัส 
            โดยเอาสัมมาทิฏฐิหรือความจริง หรือปัญญา มาตั้งเป็นฐานรับการกระทบสัมผัสไว้ที่ตา หู จมูก ลิ้น กาย ใจ ความคิดที่เกิดต่อจากนี้ก็เป็นความคิดที่ถูกต้อง หรือดำริชอบ หรือสัมมาสังกัปปะ เกิดขึ้นต่อไป 
            องค์ธรรมของมรรคมีองค์ 8 ก็เกิดขึ้นครบถ้วนตามมา จากนั้นสติปัฏฐาน 4 สัมมัปปธาน 4 อินทรีย์ 5 พละ 5 โพชฌงค์ 7 เกิดขึ้นครบโพธิปักขิยธรรม 37 ประการ นี่คือองค์ธรรมของการบรรลุมรรคผลนิพพานเกิดขึ้น มีปัญญาเกิดขึ้น 
            ดับทุกข์ตั้งแต่ถูกกระทบไปจนถึงทุกข์ถาวรในชาติปัจจุบันนี้ คือดับทุกข์ได้ทั้งทุกข์อริยสัจจะและทุกข์ที่เราสร้างขึ้นและพบสุขถาวรตลอดไป นี่คือวิปัสสนาดับทุกข์ได้อย่างนี้<br /><br />
            วิปัสสนาสร้างสุขถาวรได้อย่างไร?<br /></p>
            <p> เมื่อคนเราดับทุกข์ได้บ้างแล้วก็สามารถสร้างสุขให้ตัวเราเองได้ตลอดเวลา มนุษย์ปุถุชนคนธรรมดาไม่สามารถสร้างสุขจริงๆ ให้กับตัวเองได้เลย 
            เพราะในใจของคนปุถุชนไม่มีข้อมูลที่นำมาปรุงแต่งสร้างสุขที่เป็นสัญญา (ความจำ) อยู่ในใจมีแต่ข้อมูลสร้างทุกข์ นั่นคือความพอใจหรือไม่พอใจบรรจุอยู่ในใจเป็นสัญญา (ความจำ) อยู่ตลอดเวลาและอยู่เต็มเปี่ยมในใจ 
            เมื่อมีอะไรมากระทบอินทรีย์ 6 คือตา หู จมูก ลิ้น กาย ใจ สติก็จะระลึก ลากหรือดึงเอาข้อมูลที่ปรุงแต่งทุกข์ คือความพอใจหรือไม่พอใจออกมารับการกระทบสัมผัสทุกครั้ง ข้อมูลความพอใจหรือไม่พอใจก็จะไปปรุงแต่งทุกข์ให้เกิดขึ้น 
            เป็นความคิดก่อนแล้วต่อไปเป็นคำพูด จากนั้นไปสู่การกระทำ เมื่อคิดผิด พูดผิด ทำผิด ผลออกตามมาก็ผิด เมื่อผลออกมาผิดก็เกิดทุกข์ ในชีวิตความเป็นอยู่ของปุถุชนคนธรรมดาก็จะตกอยู่ในวังวนของความทุกข์อย่างนี้ไปนับภพนับชาติไม่ถ้วน 
            เพราะไม่มีข้อมูลสร้างสุขเก็บไว้ในใจ มีแต่ข้อมูลสร้างทุกข์ อุปมาเหมือนเราเห็น ก.ไก่ สติก็จะดึงเอาความจำคำว่า ก.ไก่ออกมารับการกระทบทางตา เราจึงรู้เข้าใจว่านี่คือ ก.ไก่ เพราะ ก.ไก่ เป็นข้อมูลที่ใจเก็บไว้เป็นสัญญา (ความจำ) 
            แต่พอเราเห็นตัวหนังสือจีนสติก็ไปคว้าหาข้อมูลที่เป็นสัญญา (ความจำ) เกี่ยวกับตัวหนังสือจีนปรากฏว่าในใจของเราไม่มีข้อมูลตัวหนังสือจีนบรรจุอยู่ เราจึงไม่มีข้อมูลให้สติลากออกมารับการกระทบสัมผัส เราก็อ่านตัวหนังสือไม่ได้ฉันใด ก็ฉันนั้น 
            สุขและทุกข์เป็นธรรมชาติเกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย ไม่ใช่โดยบังเอิญหรือเกิดขึ้นลอยๆ<br /></p>
            <p> 
            ถ้าเราฝึกฝนตนเองโดยการเจริญปัญญาวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ตามทางสายเอกที่พระพุทธเจ้าตรัสบอกไว้ให้แล้ว เราก็จะมีปัญญาหรือความรู้ที่ได้ดับทุกข์ได้ คือรู้ความจริงของโลกและชีวิตตามกฎธรรมชาติ 2 กฎ 
            ที่พระพุทธเจ้าตรัสรู้ไว้คือกฎไตรลักษณ์และกฎเหตุปัจจัย หรืออิทัปปัจจยตาปฏิจจสมุปบาท เป็นความจริง หรือปัญญา หรือสัมมาทิฐิ เก็บไว้ในใจของเรา เมื่อมีอะไรมากระทบตัวของเราในขณะปัจจุบันหรืออินทรีย์ 6 สติก็จะระลึกหรือดึง 
            หรือลากเอาความจริง หรือปัญญา หรือความรู้ที่ดับทุกข์ได้ออกมารับการกระทบสัมผัสทุกครั้ง หรือแก้ปัญหาได้แล้ว มีเหตุปัจจัยปรุงแต่งสุขให้กับตัวของเราได้ทันทีเมื่อดับความเชื่อคือความพอใจและไม่พอใจ ที่เป็นข้อมูลสร้างทุกข์ได้แล้ว 
            คนเราก็จะมีข้อมูลปรุงแต่งสร้างสุขเกิดขึ้นแทน เก็บอยู่เต็มใจของเรา คนเราก็จะมีชีวิตอยู่ด้วยปัญญาคือมีความรู้ที่ดับทุกข์ได้เก็บอยู่ในใจ เมื่อมีอะไรมากระทบสัมผัสตัวของเรา 
            สติก็จะลากเอาข้อมูลที่เป็นจริงออกมาสร้างสุขหรือปรุงแต่งสุขให้กับตัวเองชีวิตของเราก็อยู่ด้วยปัญญาหรือความจริง (ไม่มีความเชื่อหรือความหลงมาครอบงำเคลือบคลุมบดบัง) จิตใจก็ผ่องใสมีความสุขจริงเกิดขึ้นทันทีอยู่ตลอดเวลา 
            เพราะข้อมูลที่เป็นเหตุปัจจัยในการสร้างทุกข์ดับไปหมดแล้ว เหลือแต่ข้อมูลที่เป็นเหตุปัจจัยในการสร้างสุขเท่านั้นที่เก็บไว้ในใจของเรา เมื่อมีอะไรมากระทบสัมผัสอินทรีย์ 6 สติก็จะลากหรือระลึกเอาข้อมูลที่เก็บไว้ในใจออกมาปรุงแต่งสุขทันทีอยู่อย่างนี้ตลอดเวลา 
            และในที่สุดจิตใจก็เป็นอิสระปลอดโปร่งจากโลภ โกรธ หลง หรืออวิชชา ต่อไปก็ไม่ต้องห่วงกังวลเกี่ยวกับตัวตนอีก ไม่ต้องคอยเสาะแสวงหาสิ่งเสพเสวยทางตา หู จมูก ลิ้น กาย ใจ และไม่ต้องคอยปกป้องความยิ่งใหญ่ของตนเอง
            ที่แบกถือเอาไว้อย่างเมื่อก่อนๆอีกต่อไป จิตใจก็เปิดกว้างแผ่ความรู้สึกอิสระออกไปทั่วสารทิศจิตใจก็มีแต่เมตตา กรุณา แผ่ขยายออกไป จะอยู่ที่ไหนอย่างไรก็มีความสุขตลอดเวลา ในที่สุดก็สร้างสุขถาวรให้กับตัวเองได้สำเร็จในชาตินี้ 
            นี่คือการวิปัสสนาภาวนาที่ถูกต้องตามทางสายเอกที่พระพุทธเจ้าตรัสบอกทางไว้แล้ว มีปัญญาดับทุกข์และสร้างสุขถาวรให้กับตัวเองได้อย่างนี้<br /></p>
          </h4>
          <a href="/life12">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              เราจะให้รางวัลชีวิตของเราได้อย่างไร?
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life11;