import React from 'react';

const Life04 = () => {
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ชีวิตของท่านต้องการดับทุกข์หรือหลบทุกข์?</h2>
          </div>
          <h4>
            <p>มนุษย์ทุกคนเกิดมามีทางเลือกให้กับตัวเอง 2 ทางเท่านั้น คือ เลือกทางดับทุกข์ให้กับตนเอง หรือเลือกทางหลบทุกข์ให้กับตนเอง 
            แต่ชีวิตนี้เลือกได้อย่างใดอย่างหนึ่งเท่านั้น ทำไมจึงเป็นอย่างนี้ ที่เป็นอย่างนี้เพราะมนุษย์ทุกคนที่เกิดมาต้องการหนีทุกข์ไปหาสุขกันทุกคน 
            แต่ละคนก็มีวิธีการไปหาสุขของตนเองแตกต่างกันไป แล้วแต่สติปัญญาของแต่ละคนบางคนก็ประสบความสำเร็จบางคนก็ผิดหวังคละเคล้ากันไปอย่างนี้ 
            ในสังคมของมนุษย์ปุถุชนแต่ละคนก็พาตนเองดิ้นรนไปแสวงหาสุขกันตลอดเวลาหรือตลอดชีวิตไม่มีอันสิ้นสุด เพราะความสุขของแต่ละคนนั้นมีมากถมไม่เต็ม 
            ถ้ามองดูตัวเองให้ดีแล้วก็จะเห็นความจริงว่า สุขที่ต้องการหรือแสวงหานั้นเป็นสุขที่แสวงหามาปรนเปรอเสพเสวยทางตา หู จมูก ลิ้น กาย ใจ เท่านั้น
            พอได้มาก็สุข ไม่ได้ก็ทุกข์ วนเวียนอยู่อย่างนี้ไปตลอดชีวิต ชีวิตของแต่ละคนจึงมีเวลาไม่พอที่จะหาสุขมาสนองตา หู จมูก ลิ้น กาย ใจของตนเอง
            ได้ตรงกับคำสอนของพระพุทธเจ้าว่าชีวิตของคนเราถมไม่เต็ม พร่องอยู่เป็นนิตย์ สภาวะจิตของคนเราที่เป็นปุถุชนทุกคนจึงมีลักษณะดังนี้
            เมื่อพอใจก็อยากได้แสวงหา ไม่พอใจก็ผลักหนี ตกอยู่ในวังวนอย่างนี้หาที่สิ้นสุดไม่ได้</p><br /><br />
            <p>การแสวงหาสุขของคนเราทุกวันนี้แสวงหาด้วยความอยากความปรารถนาหรือความต้องการ พอได้สิ่งที่ตัวเองต้องการมาแล้วก็สุขแต่ก็เป็นสุขชั่วคราว 
            เมื่อได้มาแล้วสักพักก็เบื่ออยากเอาทิ้งไปหรือผลักหนีไป ต้องการสิ่งใหม่มาเสพเสวยต่อไปอีกเป็นอย่างนี้อยู่ตลอดเวลา จะเห็นว่าเป็นความสุขนิดเดียว 
            แต่ทุกข์ที่ตามมาบางครั้งมากมายเทียบเคียงกับสุขแล้วทุกข์มากกว่า การไปหาสุขของคนเราจึงเป็นการไปหาทุกข์มากกว่าถ้ามองให้ดีๆช้าๆ จะเห็นชัดเจน 
            ทุกข์ของคนเราถึงทับถมตัวเองตลอดเวลา ทุกข์ที่ทับถมนี้ก็คือสุขที่เราเสพเสวยแล้วนั่นเอง เรียกว่า&rdquo;ขยะตกค้าง&rdquo; 
            ทุกคนต้องการกำจัดออกไปจากตัวเรา แต่บางครั้งสิ่งเหล่านี้ไม่ได้ติดอยู่เฉพาะกายภายนอกเท่านั้น ยังเข้าไปติดแน่นอยู่ในจิตใจของเราอยู่ด้วย 
            อันนี้แหละที่เป็นขยะที่กำจัดออกจากตัวเองยากหรืออาจจะกำจัดไม่ได้เลยในชีวิตนี้ บางคนแบกขยะที่ได้มาจากที่เราไปหาสุขหรือขยะสุขที่เราใช้แล้วไม่ไหว 
            จึงทำให้ร่างกายทรุดโทรม อมโรค ในที่สุดอาจจะจบชีวิตตัวเองด้วยการฆ่าตัวตายเพราะทนไม่ได้จากขยะสุขที่ตัวเองหามา 
            ฉะนั้นเกิดมาเป็นคนจะต้องระวังขยะสุขที่เราใช้แล้วให้ดี ถ้าไม่มีการจัดการให้ดีแล้ว ขยะนั้นทับถมเจ้าของให้ตายได้ขยะสุขของคนเราเกิดจากการไปแสวงหาสุขไม่ถูกทาง 
            การแสวงหาสุขโดยการหาสิ่งที่มาปรนเปรอเสพเสวยทางตา หู จมูก ลิ้น กาย ใจ นี้เรียกเป็นภาษาง่ายๆว่าการ &rdquo;หลบทุกข์ชั่วคราว&rdquo; 
            บุคคลทุกคนถ้าไม่ได้ศึกษาเรียนรู้พระธรรมคำสอนของพระพุทธเจ้าแล้วก็จะพาตัวเองเข้าไปสู่วังวนหลบทุกข์ชั่วคราวอย่างนี้ไปตลอดชีวิต<br /></p><br /><br />
          </h4>
          <a href="/life05">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              ความพอดีของคนเราอยู่ตรงไหน?
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life04;