import React from 'react';

const Life06 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>การเจริญสติปัญญาที่ถูกต้องทำอย่างไร?</h2>
          </div>
          <h4>
            <p>ตลอดเวลาที่ผ่านมาหลายร้อยปีพวกเราชาวพุทธเข้าใจพระธรรมคำสอนของพระพุทธเจ้าคลาดเคลื่อนมาตลอด 
            คำว่าสติปัญญาในพระธรรมคำสอนของพระพุทธเจ้าในพระไตรปิฎกก็เช่นกัน จะเห็นว่าการปฏิบัติธรรมของชาวพุทธในประเทศไทยได้มีการอบรมสั่งสอนกันมานมนาน 
            ให้ชาวพุทธเจริญสติและปัญญาตามคำสอนของพระพุทธเจ้าที่พระองค์ตรัสไว้คือเอาคำว่าสติไปเจริญ คือเราไปฝึกให้เกิดสติรู้เท่าทันอิริยาบถตลอดเวลาที่มีการเคลื่อนไหวหรืออื่นๆ 
            เช่นเดินหนอ นั่งหนอ เป็นต้น การเอาสติไปฝึกอย่างนี้เป็นการปฏิบัติธรรมผิดทำให้ผลออกมาเป็นสมาธิเท่านั้น ไม่มีปัญญาเกิดขึ้น 
            เพราะไม่เข้าใจพระธรรมคำสอนของพระพุทธเจ้าและไม่รู้ความหมายของคำว่าสติหรือไม่รู้ธรรมชาติของคำว่าสติ<br />
            สติ หมายถึง การระลึกได้แปลเป็นภาษาคนต่อได้ความว่าลากมาหรือดึงมา สติเป็นธรรมชาติอันหนึ่งมีเฉพาะในตัวคนเท่านั้นที่มีมากไม่ต้องเจริญ หรือไม่ต้องสร้างมันขึ้นมาอีกใดๆทั้งสิ้น 
            คนทุกคนมีสติอยู่แล้ว มันทำหน้าที่ของมันตลอดเวลาตั้งแต่เราตื่นขึ้นมาไปจนถึงหลับไปคือทำหน้าที่ระลึก ลาก หรือดึงความจำที่เป็นสัญญาที่อยู่เก็บอยู่ในใจ 
            แล้วแต่ว่าในใจของผู้ใดจะเก็บบวก เก็บลบ หรือเก็บกุศล หรืออกุศลไว้ในใจมากกว่ากัน อันไหนมีมากกว่าสติจะดึงระลึกหรือลากเอาอันนั้นออกมารับการกระทบสัมผัสจากภายนอก 
            ถ้ามีลบมากก็ดึงเอาลบออกมารับ ถ้ามีบวกมากมันก็ดึงเอาบวกออกมารับ แล้วก็จะมีการคิดปรุงแต่งต่อไป จากนั้นก็จะไปสู่การกระทำ ผลออกมาตามเหตุที่ทำไว้ เช่นมีเสียงด่ากระทบหู 
            ถ้าใจเราเก็บเอาอกุศลไว้มาก สติก็จะระลึกหรือลากเอาอกุศลออกมารับเสียงด่า ทำให้เกิดความไม่พอใจ แสดงออกมา อาจจะไปทำร้ายคนด่าได้ 
            แต่ถ้าในใจเก็บข้อมูลที่เป็นกุศลบวกไว้มากจะติก็จะลึกหรือลากเอากุศลนั้นออกมารับกระทบเสียงด่า แล้วมองเห็นเสียงด่านั้นเป็นคำตักเตือนทันที เห็นคุณค่าของเสียงด่านั้นได้ 
            นี่คือหน้าที่ของสติ มันทำหน้าที่อย่างนี้การเจริญสติที่ปฏิบัติกันมานั้นไม่ถูกต้อง ที่ถูกต้องจะต้องเจริญความรู้ที่ดับทุกข์ได้ หรือปัญญาให้สติระลึกได้ 
            หรือลากมาต้อนรับการกระทบสัมผัสเพื่อแก้ไขปัญหาหรือทุกข์ตั้งแต่ที่ถูกกระทบสัมผัส หรือที่มันเกิดซึ่งตรงกับคำสอนของพระพุทธเจ้าที่ตรัสไว้ว่า ทุกข์เกิดที่ไหนดับที่นั่น<br />
            ปัญญาหมายถึงความรู้ที่ดับทุกข์ได้ ความรู้ที่ดับทุกข์ไม่ได้ไม่ไม่ใช่ปัญญาทางธรรมเป็นเพียงความรู้หรือรอบรู้เท่านั้น<br />
            ปัญญาในพระธรรมคำสอนของพระพุทธเจ้าหมายถึงพระธรรมในส่วนที่เป็นผล ไม่ใช่ส่วนที่เป็นเหตุเอาคำว่าปัญญาไปใช้ดับทุกข์ไม่ได้ 
            จะต้องรู้และเข้าใจต่อไปอีกว่าปัญญาที่เป็นความรู้ที่ดับทุกข์ได้นั้นมีต้นตอแหล่งกำเนิดหรือเหตุปัจจัยของการเกิดของปัญญาอยู่ที่ไหน<br />
            ปัญญาเกิดขึ้นได้อย่างไร? ปัญญาที่เป็นความรู้ที่ดับทุกข์ได้นั้นเกิดจากความจริงที่เป็นความจริงของโลกและชีวิตเท่านั้นความจริงเป็นแม่เป็นต้นตอของปัญญา<br />
            ความจริงของโลกและชีวิตก็คือกฎธรรมชาติ 2 กฎ ที่พระพุทธเจ้าตรัสรู้คือกฎไตรลักษณ์ หรือ อนิจจัง ทุกขัง อนัตตา หรือเกิดขึ้น ตั้งอยู่ ดับไป และกฎของเหตุปัจจัย 
            หรืออิทัปปัจจยตาปฏิจจสมุปบาท กฎนี้แหละคือต้นตอหรือแม่ หรือเป็นเหตุปัจจัยของปัญญา ปัญญาจะเกิดกับความจริงเท่านั้น อวิชชาเกิดจากความพอใจ หรือไม่พอใจ
            หรือความเชื่อความเชื่อเป็นเหตุปัจจัยหรือต้นตอของอวิชชา</p><br /><br />
            <p>เมื่อเรารู้จักที่มาที่ไปของสติปัญญาแล้ว จะเห็นว่าการปฏิบัติธรรมโดยการเจริญสติปัญญาโดยตรง 
            อย่างที่มีการสอนการปฏิบัติกันในปัจจุบันนี้ไม่ถูกต้องตามธรรมไม่ถูกเหตุถูกปัจจัย เมื่อรู้ว่าเหตุปัจจัยของสติปัญญาแล้ว การปฏิบัติก็เริ่มเจริญปัญญาไม่ต้องเจริญสติเพราะมีอยู่แล้ว 
            แต่คนเราขาดปัญญาจึงจำเป็นต้องเจริญปัญญามาดับทุกข์ หรือแก้ปัญหา การเจริญปัญญาที่ถูกต้องต้องเจริญที่เหตุของการเกิดปัญญา 
            เหตุปัจจัยของการเกิดปัญญาหรือสัมมาทิฐินั้นคือพระธรรมคำสอนของพระพุทธเจ้าที่พระองค์ตรัสไว้ เป็นทางสายเอกคือการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 
            ให้รู้เห็นสิ่งทั้งปวงที่มากระทบสัมผัสตัวเรา ตามความเป็นจริงของโลกและชีวิตว่าสิ่งทั้งปวงไม่เที่ยง เป็นทุกข์ เป็นอนัตตา ไม่มีตัวตนเป็นของตนเอง เกิดจากเหตุปัจจัย ว่างจากตนหรือของตน 
            พิจารณาให้รู้เห็นความจริงอย่างนี้จนเป็นปกตินิสัยในชีวิตประจำวัน และจะมีปัญญาหรือสัมมาทิฐิเกิดขึ้น รู้เท่าทันความจริงของโลกและชีวิตตามความพอใจ (โลภ) ไม่พอใจ (โกรธ) 
            ทันทีอย่างนี้เรียกว่าสัมมาทิฏฐิ ปัญญาเกิดขึ้นมรรคมีองค์ 8 เกิดขึ้น องค์ธรรมอื่นๆจะเกิดตามมาจนครบโพธิปักขิยธรรม 37 ประการ แล้วมีปัญญาดับทุกข์หรือแก้ไขปัญหาให้กับตัวเองได้ถาวร</p><br /><br />
            <p>เมื่อมีปัญญา (รู้จริง รู้แจ้ง) เกิดขึ้นในใจตลอดเวลาแล้ว ปัญญาก็จะเข้ามาแทนที่อวิชชา เมื่อมีอะไรมากระทบสัมผัสตัวเรา สติก็จะระลึก หรือดึง หรือลากเอาความจริงที่เป็นปัญญาที่เก็บอยู่ในใจเป็นสัญญา (ความจำ) 
            ออกมารับการกระทบสัมผัส ปัญหาหรือทุกข์ก็จะถูกแก้ไขหรือดับที่มันเกิดทันที ยกตัวอย่างเช่น มีเสียงด่ามากระทบหู สติก็จะลากเอาหรือระลึกเอาปัญญา หรือความจริงออกมารับว่าเสียงด่าไม่เที่ยง 
            ปัญญาจะทำหน้าที่พิจารณาว่าเสียงด่าเกิดดับ คนด่าก็เกิดดับ คนถูกด่าก็เกิดดับ พูดง่ายๆว่าคนด่าก็ตาย คนถูกด่าก็ตายเช่นกัน และปัญญาจะสั่งให้ยิ้มให้กับคนที่ด่าทันที และก็ยิ้มได้ด้วย 
            เพราะหน้ามืดหน้าแดงที่เกิดจากความพอใจไม่พอใจถูกดับไปก่อนแล้ว ปัญหาก็ถูกแก้ไขในทางถูกต้องคือดับปัญหา ณ ที่เกิดนั้นทันที ปัญหาที่เกิดต่อเนื่องต่อไปอีกไม่มี ถ้าเราไม่ฝึกเจริญความจริงไว้ในใจแล้ว 
            ก็จะไม่มีปัญญาออกมารับเสียงด่า สติก็จะลากเอาความเชื่อที่เป็นความพอใจไม่พอใจที่เก็บเป็นอวิชชาอยู่ในใจออกมารับการกระทบเสียงด่า ความพอใจไม่พอใจก็เกิดขึ้น ทำให้เราควบคุมตนเองไม่ได้ 
            อาจจะไปทำร้ายร่างกายคนด่าเข้าให้ ในที่สุดก็ต้องไปแก้ปัญหาที่สถานีตำรวจหรือที่ศาลหรือที่คุก ซึ่งไม่ใช่เป้าหมายหรือสิ่งที่คนเราต้องการ ความจริงแล้วคำว่าสติปัญญาในพระธรรมคำสอนของพระพุทธเจ้านั้น 
            เป็นคำตรัสย่อของพระพุทธเจ้าตรัสกับพระอริยบุคคล ตรัสอย่างนี้อริยบุคคลเข้าใจได้จะเอาคำว่าสติปัญญาไปปฏิบัติ หรือไปเจริญโดยตรงไม่ได้ ไม่ถูกธรรมวิธีปฏิบัติหรือเจริญสติปัญญาที่ถูกต้องนั้น 
            ต้องเอาพระธรรมที่เป็นเหตุของการได้ปัญญามาปฏิบัติก่อน จึงจะมีปัญญาเกิดขึ้น เก็บไว้ในใจตนเป็นปกติปกตินิสัยประจำวัน แล้วปัญญาก็จะเข้าไปแทนที่อวิชชา (ความหลง) ที่อยู่ในใจของเรา 
            ใจของเราก็เต็มไปด้วยปัญญา รู้จริง รู้แจ้ง เมื่อมีอะไรมากระทบสัมผัส สติก็จะลากหรือระลึกเอาปัญญาออกมารับการกระทบและแก้ปัญหา หรือดับทุกข์ได้ 
            ขบวนการเจริญสติปัญญาตามคำสอนของพระพุทธเจ้าเต็มรูปแบบทำอย่างนี้</p><br /><br />
            <p>สรุปการเจริญสติปัญญาที่ถูกต้องตรงกับคำสอนของพระพุทธเจ้านั้นจะต้องปฏิบัติวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ดังกล่าวมาข้างต้นอย่างนี้ 
            เรียกว่าการเจริญสติปัญญาที่ถูกต้องไม่ใช่เอาสติปัญญาไปเจริญโดยตรง อย่างที่ปฏิบัติกันมาซึ่งเป็นการปฏิบัติธรรมผิดธรรม ไม่มีปัญญาที่จะดับทุกข์ได้ 
            การเจริญสติปัญญาก็คือการวิปัสสนาภาวนาพิจารณาขันธ์ 5 และ อินทรีย์ 6 ตามทางสายเอกที่พระพุทธเจ้าตรัสไว้นั่นเอง<br /></p><br /><br />
          </h4>
          <a href="/life07">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              การรู้เท่าทันความพอใจและไม่พอใจแก้ปัญหาหรือดับทุกข์ได้
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life06;