import React from 'react';

const Life09 = () => {
  return (
    <div>
      <section id="hero2" className="d-flex">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>วิธีการวิปัสสนาแบบง่ายๆ แต่ได้ผล มีปัญญาแก้ปัญหาชีวิตและดับทุกข์ได้ถาวร</h2>
          </div>
          <h4>
            <p>การฝึกทำได้ทุกหนทุกแห่งควบคู่กันไปกับการทำงานหรือการดำเนินชีวิตของเราตามปกติ</p><br /><hr /><br /><br />
            <p>ให้ฝึกดังนี้ - เริ่มตั้งแต่ตื่นนอนขึ้นมาจนกระทั่งหลับ<br />ตาเห็นรูปอะไร หูได้ยินเสียงอะไร จมูกได้กลิ่นอะไร ลิ้นได้รสอะไร กายกระทบสัมผัสอะไร ใจคิดนึกอะไร 
            ฝึกให้รู้ให้เห็นความจริงของโลกและชีวิตดังนี้</p><br /><hr /><br /><br />
            <p>ตาเห็นรูป<br /></p>
            <p>พิจารณาว่า รูปไม่เที่ยงเกิดดับ<br /></p>
            <p>ตัวของเราก็ไม่เที่ยงเกิดดับ เช่นกัน<br /><br /></p>
            <p>หูได้ยินเสียง<br /></p>
            <p>พิจารณาว่า เสียงไม่เที่ยงเกิดดับ<br /></p>
            <p>ตัวของเราก็ไม่เที่ยงเกิดดับ เช่นกัน<br /><br /></p>
            <p>จมูกได้กลิ่น<br /></p>
            <p>พิจารณาว่า กลิ่นไม่เที่ยงเกิดดับ<br /></p>
            <p>ตัวของเราก็ไม่เที่ยงเกิดดับ เช่นกัน<br /><br /></p>
            <p>ลิ้นได้รส<br /></p>
            <p>พิจารณาว่า รสไม่เที่ยงเกิดดับ<br /></p>
            <p>ตัวของเราก็ไม่เที่ยงเกิดดับ เช่นกัน<br /><br /></p>
            <p>กายกระทบสัมผัส<br /></p>
            <p>พิจารณาว่า กายสัมผัสไม่เที่ยงเกิดดับ<br /></p>
            <p>ตัวของเราก็ไม่เที่ยงเกิดดับ เช่นกัน<br /><br /></p>
            <p>ใจคิดนึก<br /></p>
            <p>พิจารณาว่า ความคิดไม่เที่ยงเกิดดับ<br /></p>
            <p>ตัวของเราก็ไม่เที่ยงเกิดดับ เช่นกัน</p><br /><hr /><br /><br />
            <p>ให้พิจารณาทั้งสองด้านอย่างนี้ เมื่อมีอะไรมากระทบสัมผัสตา หู จมูก ลิ้น กาย ใจ ในขณะปัจจุบันจนเป็นปกตินิสัยในชีวิตประจำวัน
            หรือท่องให้ได้เหมือนสูตรคูณ แล้วความพอใจ ไม่พอใจ หรือโลภ โกรธ หลง หรือสมุทัยของทุกข์ทั้งปวง ซึ่งเรียกว่าเป็นความเชื่อก็จะถูกความจริงว่าไม่เที่ยงดับลงไปทันที 
            ตรงกับคำสอนของพระพุทธเจ้าที่ตรัสไว้ว่าทุกข์เกิดที่ไหนดับที่นั่น ทุกข์เกิดทางตา ดับทางตา ทุกข์เกิดทางหูดับทางหู ทุกข์เกิดทางจมูกดับทางจมูก ทุกข์เกิดทางลิ้นดับทางลิ้น 
            ทุกข์เกิดทางกายดับทั้งกาย ทุกข์เกิดทางใจดับทางใจ เมื่อเหตุทั้งปวงของทุกข์ดับไปแล้ว ต่อจากนั้น ปัญญาหรือความรู้ที่ดับทุกข์ได้ หรือแก้ปัญหาชีวิตได้ เกิดขึ้นตามมา 
            ทางตา หู จมูก ลิ้น กาย ใจ มหาศาลแล้วก็จะมีปัญญาแก้ปัญหาชีวิตได้และดับทุกข์ได้ถาวรในที่สุด คือบรรลุมรรค ผล นิพพานได้ภายใน 7 วัน 7 เดือน 7 ปีอย่างช้าพระพุทธเจ้าตรัสไว้อย่างนี้</p><br /><br />
          </h4>
          <a href="/life10">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              ความคิดเห็นของคนเราคืออะไร?
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life09;