import React from 'react';

const Life01 = () => {
  return (
    <div>
      <section id="hero2" className="team section-bg">
        <div className="container" data-aos="fade-up">
          <div className="section-title">
            <h2>ปฏิบัติธรรมด้วยความไม่ประมาทปฏิบัติอย่างไร?</h2>
          </div>
          <h4>
            <p>คนเราส่วนมากเกิดมาต้องการหนีทุกข์ไปหาสุขกันทุกคน แต่ละคนก็พาตัวเองไปหาสุขกัน ตามความคิดความเข้าใจของตนเองที่คิดว่าทางนี้ ทำอย่างนี้ คิดอย่างนี้จะนำความสุขสำเร็จมาให้แก่ชีวิตของตนเอง 
            ฉะนั้นจะเห็นว่าแต่ละคนจะมีวิธีการหนีทุกข์ไปหาสุขกันมากมายหลายรูปแบบแตกต่างกัน ลองผิดลองถูกกันเกือบค่อนชีวิตหรือตลอดชีวิตก็ยังหาความสุขจริงๆ ที่ตนเองต้องการไม่พบ บางครั้งได้สุขมาก็คิดว่าจะเป็นความสุขที่ตนเองต้องการ 
            ไปหลงประคบประหงมความสุขอันนั้นไว้ แต่พอเวลาเปลี่ยนไปหน่อยความสุขที่ตนเองคิดว่าน่าจะใช่ความสุขจริงๆที่ตนเองต้องการกลับกลายเป็นทุกข์มหาศาลเกือบเอาชีวิตไม่รอดก็มี 
            สุขที่ทุกคนที่เป็นปุถุชนไปเสาะแสวงหานั้นก็คือความสุขที่ได้อะไรมาสนองความอยากของตนเองทาง ตา หู จมูก ลิ้น กาย ใจ เมื่อได้มาแล้ว สุขนั้นก็หายไปก็ไปแสวงหามาอีก ไม่ได้ก็ทุกข์ ต้องดิ้นรนไปเสาะหามาปรนเปรอไปตลอดชีวิตไม่มีที่สิ้นสุด<br /></p>
            <p>ปุถุชนคนธรรมดาทั่วไปไม่ได้สดับฟังพระธรรมคำสอนของพระพุทธเจ้า จึงไม่มีโอกาสจะรู้ได้เลยว่าสุขจริงๆ ที่คนเราต้องการนั้นอยู่ที่ใด ทำอย่างไรจึงจะพบและหามาใส่ตัวเองได้ สุขที่มนุษย์ทุกคนต้องการในขณะนี้นั้นก็คือสุขถาวรไม่มีวันเปลี่ยนแปลง 
            สุขอย่างนี้เป็นสิ่งที่ทุกคนต้องการ สุขถาวรนี้ถ้าแปลเป็นภาษาธรรมก็คือ &ldquo;นิพพาน&rdquo; นั่นเอง พวกเขาไม่รู้เลยว่าสุขถาวรนี้มีศาสดาเอกของโลกตรัสสอนไว้ให้แล้ว พร้อมบอกทางเดินไปหาสุขนั้นได้ในชีวิตนี้อย่างเร็ว 7 วัน 7 เดือน 7 ปี อย่างช้า 
            ถ้าปฏิบัติตามทางที่ถูกนี้มนุษย์ทุกคนไปถึงเป้าหมายนี้ได้<br /></p>
            <p>คนเราทุกวันนี้ต้องการให้ตัวเองพบสุขถาวรกันทุกคน แต่ขี้เกียจศึกษาเรียนรู้พระธรรมคำสอนที่ศาสดาเอกของโลกสอนไว้ให้ศึกษาเรียนรู้วิธีปฏิบัติให้เข้าถึงสุขถาวรที่ตนเองต้องการ 
            จะเห็นว่าบางคนตั้งใจจะปฏิบัติธรรมเพื่อหาทางหนีทุกข์ไปหาสุขถาวร แต่ไม่ได้ศึกษาแนวทางที่พระพุทธเจ้าศาสดาเอกของโลกบอกทางดับทุกข์ไว้ให้เป็นพื้นฐานก่อน แล้วมุ่งหน้าไปสำนักปฏิบัติไปปฏิบัติกับครูบาอาจารย์ที่สอนการปฏิบัติธรรมเอาทันที 
            เพื่อเดินทางลัดต้องการให้ตนเองพบความสำเร็จหนีทุกข์ได้เร็วๆ โดยไม่ได้หยุดคิดสักนิดว่า ถ้าครูบาอาจารย์ของเราไม่เรียนคำสอนหรือเรียนคำสอนของพระพุทธเจ้าไม่จบตามพระธรรมคำสอนในพระไตรปิฎกแล้วจะทำอย่างไรดี ครูบาอาจารย์ก็ต้องสอนเราผิดแน่นอน 
            ตัวของเราก็จะนำเอาพระธรรมคำสอนที่ผิดไปปฏิบัติ ผลก็จะออกมาตามเหตุ คือได้ผลที่ผิดออกมา เราจะต้องเสียเวลาชีวิตไปชาติหนึ่ง ชาตินี้เกิดมาจึงเสียชาติเกิด ชาติต่อไปจะเกิดมาพบพระพุทธศาศนาพบพระธรรมคำสอนอีกหรือไม่ก็ไม่รู้ได้ ความคิดในลักษณะอย่านี้ไม่ค่อยมี 
            ไปมั่นใจว่าหลวงปู่หลวงพ่อที่เป็นครูบาอาจารย์ของเราทั้งหลายท่านคงจะเรียนพระธรรมคำสอนของพระพุทธเจ้ามาจบแน่ หรือเห็นว่าท่านเป็นพระสงฆ์หรือฆราวาสผู้มีความรู้ ก็ไปเป็นลูกศิษย์ของท่านเลย ดังนี้เป็นต้น ผลปรากฏว่าท่านเหล่านั้นส่วนมากไม่เคยเรียนพระธรรมคำสอนของพระพุทธเจ้าในพระไตรปิฎกกันจบแต่อย่างใด 
            อาศัยเอาวิธีปฏิบัติที่ครูบาอาจารย์รุ่นก่อนๆสอนปฏิบัติสืบต่อกันมาแล้วท่านเหล่านั้นก็อ้างว่าหลวงพ่อ หลวงปู่ นั้นสอนไว้อย่างนี้ แล้วก็เอาไปปฏิบัติสืบต่อกันมาโดยไม่รู้ไม่เข้าใจที่ท่านสอนไว้ว่าถูกต้องครบถ้วนหรือไม่<br /></p>
            <p>จะเห็นว่าท่านผู้นำการปฏิบัติธรรมทั้งหลายทั้งรุ่นก่อนๆ 
            และรุ่นปัจจุบันมีลักษณะเหมือนกันคือ ปฏิบัติธรรมตามครูบาอาจารย์ที่สอนสืบต่อกันมาเท่านั้นไม่มีผู้ใดพาตนเองข้ามเข้าไปถึงคำสอนของพระพุทธเจ้าจริงๆในพระไตรปิฎกได้ ไปถึงได้แค่ของครูบาอาจารย์หลวงปู่ หลวงพ่อเท่านั้น ไปติดอยู่ตรงนี้ จึงไม่มีความรู้เพียงพอที่นำพาตัวเองเข้าไปหาทางที่ถูกต้องได้ 
            เพราะไม่มีความรู้ที่เป็นพระธรรมคำสอนของพระพุทธเจ้าเป็นหลักไว้ในตัวเอง ทำให้การปฏิบัติธรรมของผู้สนใจทั้งหลาย ไปไม่ถึงเป้าหมายของชีวิต เพราะมรู้ทางเดินที่ถูกต้องที่แท้จริง ปฏิบัติธรรมผิดธรรมกันมาตลอด จึงไม่มีปัญญาแก้ปัญหาหรือดับทุกข์ให้กับตัวเองได้ ได้แค่หลบทุกข์ชั่วคราวอยู่ที่ความสงบเท่านั้น<br /></p>
            <p>การปฏิบัติธรรมผิดนั้นปฏิบัติอย่างไร?การปฏิบัติโดยไม่รู้ ไม่เข้าใจพระธรรมคำสอนของพระพุทธเจ้าว่า พระธรรมส่วนใดเป็นพระธรรมส่วนที่เป็นผลของการตรัสรู้ และพระธรรมส่วนใดเป็นเหตุของการตรัสรู้ และไม่เข้าใจว่าพระธรรมคำสอนในสูตรนั้นๆ ที่ตนนำมาปฏิบัติพระพุทธเจ้าตรัสสอนกับผู้ใด 
            สอนอริยบุคคลหรือสอนบุคคลธรรมดาทั่วไป สอนสรุปคำย่อ หรือสอนคำเต็ม ถ้าเป็นคำย่อแล้ว คำเต็มท่านสอนว่าอย่างไร ดังนี้เป็นต้น ถ้าไม่รู้ไม่เข้าใจถึงขั้นนี้แล้วผู้สอนก็สอนผิด ผู้ปฏิบัติก็ปฏิบัติผิด เมื่อปฏิบัติผิดธรรมอย่างนี้แล้วโอกาสที่จะมีปัญญาดับทุกข์หรือแก้ปัญหาได้นั้นไม่มี จะไปหลงติดอยู่ที่ความสงบของจิตหรือสมาธิเท่านั้น<br /></p>
            <p>การปฏิบัติอย่างนี้เรียกว่าพาตัวเองไปติดตาข่ายของมาร หมดโอกาสจะพาตัวเองดับทุกข์ได้ในชาตินี้ ดังเช่นบางคนบางท่านเอาโพธิปัขิยธรรม 37 ประการ คือ มรรคมีองค์ 8 สติปัฏฐาน 4 สัมมัปปธาน 4 อิทธิบาท 4 อินทรีย์ 5 พละ 5 โพชฌงค์ 7 ไปปฏิบัติวิปัสสนาภาวนา ซึ่งไม่ถูกต้อง เพราะพระธรรมเหล่านี้เป็นผลการตรัสรู้ของพระพุทธเจ้า 
            ไม่ใช่เป็นพระธรรมที่เป็นเหตุของการตรัสรู้ เป็นพระธรรมที่เป็นผลรวมของการปฏิบัติวิปัสสนาภาวนาพิจารณาขันธ์ 5 และอินทรีย์ 6 ให้รู้เท่าทันสิ่งที่มากระทบสัมผัสตัวของเราเองตามความเป็นจริงของโลกและชีวิตว่าสิ่งทั้งปวงไม่เที่ยงเกิดดับ พระธรรมคำสอนในโพธิปักขิยธรรม 37 ประการนี้ 
            เป็นพระธรรมคำสอนของพระพุทธเจ้าตรัสสอนอริยบุคคลตั้งแต่โสดาบันบุคคลขึ้นไปเท่านั้น แต่ถ้าบุคคลธรรมดาทั่วไปนำไปปฏิบัติแล้วจะผิดธรรมทันที เพราะจะเอาพระธรรมที่เป็นผลไปเป็นเหตุของการปฏิบัติ คือจะปฏิบัติโดยเอาจิตไปกำหนดสติ<br /></p>
            <p>ติดตามความเคลื่อนไหวอิริยาบถของตนเองเช่น เดินหนอ ยกหนอ นั่งหนอ กินหนอ ยุบหนอ พองหนอ ฯลฯ อย่างนี้เป็นต้น การปฏิบัติอย่างนี้ของบุคคลธรรมดาทั่วไปไม่ใช่วิปัสสนาภาวนาที่ถูกต้อง เป็นการเจริญความสงบของจิตหรือสมาธิเท่านั้น ใช้จิตกำหนดรู้ความเคลื่อนไหวอย่างนี้ไม่มีปัญญาเกิดขึ้น 
            การกระทำอย่างนี้เป็นการเจิญสมาธิให้จิตสงบ ไม่ใช่เจริญปัญญา ในพระไตรปิฎกพระพุทธเจ้าตรัสกับพระอริยบุคคลอย่างนี้ ให้อริยบุคคลเอาไปปฏิบัตินั้นถูกต้อง เพราะอริยบุคคลมีปัญญาหรือสัมมาทิฐิแล้ว ปฏิบัติเพื่อให้จิตสงบประกอบด้วยปัญญา อย่างนี้เรียกว่าสัมมาสมาธิ เป็นผลให้บรรลุอรหันต์เร็วขึ้น 
            แต่ถ้าบุคคลธรรมดาเอาไปปฏิบัติจะเกิดมิจฉาสมาธิ หรือสมาธิที่ไม่มีปัญญาประกอบ ซึ่งเรียกว่าความหลง ไม่มีปัญญามาดับทุกข์ได้<br /></p>
            <p>ฉะนั้น การปฏิบัติธรรมโดยความไม่ประมาทนั้น ต้องเข้าใจพระธรรมคำสอนของพระพุทธเจ้าอย่างถ่องแท้ เมื่อเข้าใจแล้วการปฏิบัติธรรมก็ถูกธณรม 
            เช่น ถ้าคนเราต้องการดับทุกข์ต้องรู้ว่าทุกข์เกิดจากอะไร? ทุกข์เกิดจากความไม่รู้หรืออวิชชา จึงทำให้คนเรา คิดผิด ทำผิด ผลออกมาผิด จึงมีปัญหาหรือทุกข์ตามมา การดับทุกข์ได้ก็ต้องใช้ปัญญาคือ ความรู้จริงมาดับทุกข์ ความรู้ที่ดับทุกข์ได้หรือปัญญานี้มาจากไหน? ปัญญามาจากความจริงของโลกและชีวิตที่พระพุทธเจ้าได้ตรัสรู้ไว้ 
            ได้แก่ กฎธรรมชาติ 2 กฎ กฎแรกคือกฎของไตรลักษณ์ (เกิดขึ้น ตั้งอยู่ ดับไป หรือ อนิจจัง ทุกขัง อนัตตา) และกฎของเหตุปัจจัย หรือกฎของอิทัปปัจจยตา ปฏิจจสมุปบาท นี่คือที่เกิดของปัญญา แล้วจะสร้างปัญญาให้เกิดขึ้นได้อย่างไร? พระพุทธเจ้าตรัสบอกวิธีสร้างปัญญาไว้ในทางสายเอกที่ดับทุกข์ได้ นั้นคือการวิปัสสนาภาวนาพิจารณาขันธ์ 5 อินทรีย์ 6 
            ให้รู้ให้เห็นสิ่งทั้งปวงที่มากระทบสัมผัสตัวของเราในขณะปัจจุบันตามความเป็นจริงของโลกและชีวิตว่า สิ่งทั้งปวงไม่เที่ยงเกิดดับ เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวเท่านั้น ไม่มีตัวตนเป็นของตนเอง ว่างจากตนและของตน<br /><br /><br /></p>
          </h4>
          <a href="/life02">
            <button type="button" className="btn btn-primary me-5">
              <i className="bi bi-arrow-right-square" /> &nbsp;
              วิธีเจริญหรือสร้างปัญญา ปฏิบัติอย่างไร?
            </button>
          </a>
        </div>
      </section>
    </div>
  )
}

export default Life01;